{
  "posts": [
    {
      "title": "Money on Cloud : ระบบสินเชื่อบุคคลเพื่อประกอบอาชีพ",
      "description": "<a href=\"https://www.g-able.com/\">บริษัท เทคสเฟียร์ จำกัด</a> ได้พัฒนาระบบงานสินเชื่อบุคคลเพื่อประกอบอาชีพ (Nano-Finance)  ซึ่งเป็นผลิตภัณฑ์ใหม่ทางด้านการให้สินเชื่อขึ้นมาเป็นซอฟต์แวร์แพ็กเกจ เพื่อรองรับการใช้บริการทางการเงิน\r\n\r\n&nbsp;\r\n\r\nสำหรับการเข้าถึงแหล่งเงินทุนให้กับผู้ประกอบอาชีพรายย่อย และกำหนดแนวทางการประกอบธุรกิจสินเชื่อ ให้มีความเป็นธรรม ไม่เอาเปรียบผู้บริโภค และแก้ไขปัญหาภาระดอกเบี้ยจากการกู้ยืมนอกระบบที่สูงจนเกินควร\r\n\r\n&nbsp;\r\n\r\nโดยการกำหนดให้มีนิติบุคคลที่สามารถปล่อยกู้ให้ประชาชนได้ในวงเงินไม่สูงมาก ตามที่ทางรัฐบาลโดยกระทรวงการคลังและธนาคารแห่งประเทศไทยได้อนุญาตให้มีนิติบุคคลประเภทใหม่ในระบบสถาบันการเงินไทย\r\n\r\n<!--more-->\r\n<h3></h3>\r\n&nbsp;\r\n<h3><b>Standard Feature</b></h3>\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>ทำงานแบบ Online ทำให้ข้อมูลที่ได้เป็นปัจจุบันเสมอ</li>\r\n \t<li>ง่ายในการใช้งาน เนื่องจากมีฟังก์ชันคีย์แสดงหน้าต่างช่วยในการบันทึก/ค้นหาข้อมูล</li>\r\n \t<li>สามารถควบคุมสิทธิการเข้าใช้งาน</li>\r\n \t<li>สามารถกำหนดเมนูการใช้งานของผู้ใช้งานได้เอง</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n<h3><b>Overview</b></h3>\r\n<span style=\"font-weight: 400;\">รองรับการให้สินเชื่อบุคคลเพื่อประกอบอาชีพ โดยประกอบด้วย</span><span style=\"font-weight: 400;\">การทำงานต่างๆ ดังนี้</span>\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>การกำหนด Parameter ของระบบ และข้อมูลเบื้องต้น</li>\r\n \t<li>การสมัครขอสินเชื่อ</li>\r\n \t<li>การเบิกจ่ายเงินกู้</li>\r\n \t<li>การรับชำระเงิน</li>\r\n \t<li>การติดตามหนี้</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n<h3><b>Key Feature</b></h3>\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-27313\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/08/Digital-4-300x169.jpg\" alt=\"\" width=\"750\" height=\"422\" />\r\n\r\n&nbsp;\r\n\r\n<strong>การกำหนด Parameter ของระบบ และข้อมูลเบื้องต้น</strong>\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>กำหนดข้อมูลเบื้องต้นของสินเชื่อบุคคล ได้แก่ เงื่อนไขการคิดดอกเบี้ย ค่าธรรมเนียม</li>\r\n \t<li>กำหนดรหัสให้กับเจ้าหน้าที่การตลาด ซึ่งสามารถแยกรหัสของเจ้าหน้าที่การตลาดตามสาขา และทีมงานได้</li>\r\n \t<li>กำหนดเงื่อนไขระยะเวลาผ่อนผันการชำระหนี้ (GracePeriod) ได้โดยนับรวมถึงวันหยุด</li>\r\n \t<li>กำหนดนโยบายการพิมพ์เอกสารติดตามหนี้ และจำนวนเงินค่าปรับ</li>\r\n \t<li>กำหนดประวัติของบุคคลที่ไม่พึงประสงค์ (Black List)ของบริษัท</li>\r\n \t<li>กำหนดเงื่อนไขของ Product Package ในส่วนของค่าธรรมเนียมและอัตราดอกเบี้ย</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-26884 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/07/contract.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n<strong>บันทึกแบบคำขอใช้บริการสินเชื่อ</strong>\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>สามารถ Download ใบสมัครสินเชื่อได้ เพื่อกรอกข้อมูลใบสมัครขอสินเชื่อได้</li>\r\n \t<li>สามารถคำนวณค่างวด และบันทึกเพื่อสอบถามค่างวดที่ต้องการได้</li>\r\n \t<li>กรณีเป็นลูกค้าเก่า จะมีการค้นหาข้อมูลมาแสดงให้อัตโนมัติ เมื่อบันทึกเลขที่บัตรประชาชน</li>\r\n \t<li>สามารถบันทึกที่อยู่ของลูกค้าได้หลายที่อยู่ และกำหนดสถานที่ส่งเอกสารได้</li>\r\n \t<li>บันทึกข้อมูลแบบคำขอได้ครบถ้วน ไม่ว่าจะเป็นข้อมูลผู้กู้ ข้อมูลบุคคลค้ำประกัน เงื่อนไขการคำนวณดอกเบี้ยค่าธรรมเนียมและการชำระคืนเงินกู้</li>\r\n \t<li>ตรวจสอบประวัติของบุคคลที่ไม่พึงประสงค์ (Black List) ของบริษัทให้อัตโนมัติ</li>\r\n \t<li>พิมพ์รายงานคำขอใช้บริการสินเชื่อ และรายงานสรุปผลการพิจารณาสินเชื่อ</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28811 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/money-1.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\n<strong>การเบิกจ่ายเงินกู้</strong>\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>วิธีการคิดคำนวณ เป็นแบบเศษปัดเต็มสองบาทเสมอ</li>\r\n \t<li>วิธีการชำระค่างวด เป็นแบบชำระเท่ากันทุกงวด (งวดละ1 เดือน)</li>\r\n \t<li>อัตราดอกเบี้ย สามารถคำนวณแบบ Floating Rate (Effective Rate)</li>\r\n \t<li>ทำการหักค่าธรรมเนียมการจัดการ และค่าอากรแสตมป์ก่อนทำการโอนเงินให้ลูกค้า</li>\r\n \t<li>สะดวกด้วยการโอนจ่ายเงินกู้เข้าบัญชีธนาคาร (Direct Credit) หรือเลือกจ่ายเป็นเช็คระบุชื่อผู้กู้</li>\r\n \t<li>สร้างรายการที่จ่ายเป็น Direct Credit เป็น Text File ส่งให้กับธนาคาร</li>\r\n \t<li>ทำการสร้างรายการลงบัญชีให้อัตโนมัติ</li>\r\n \t<li>ยกเลิกสัญญา ได้ทั้งก่อน และหลังการจ่ายเงิน และสร้างรายการลงบัญชีให้อัตโนมัติ</li>\r\n \t<li>สามารถพิมพ์รายงานการเบิกเงินกู้ประจำวัน เพื่อตรวจสอบรายการบัญชี</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28810 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/payment-1.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\n<b>การรับชำระเงิน</b>\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>รับชำระเงินผ่าน Counter บริษัท ด้วยเงินสด, PAY-IN เงินสด, เช็ค</li>\r\n \t<li>สะดวกด้วยการตัดชำระผ่านบัญชีธนาคาร (Direct Debit)</li>\r\n \t<li>สะดวกด้วยการตัดชำระผ่านช่อง Bill Payment (Phase 2)</li>\r\n \t<li>ใช้ที่อยู่ตามทะเบียนบ้าน เป็นที่อยู่ในใบกำกับภาษี และใช้ที่อยู่ส่งเอกสารของลูกค้า เป็นที่อยู่ในใบเสร็จรับเงิน</li>\r\n \t<li>คิดค่าปรับกรณีผิดนัด และค่าปรับปิดบัญชีก่อนกำหนดได้</li>\r\n \t<li>บันทึกค่าใช้จ่าย หรือค่าธรรมเนียมเพื่อเรียกเก็บจากลูกหนี้เพิ่มเติม</li>\r\n \t<li>สอบถามยอดค้างชำระ หรือประวัติการชำระเงินของแต่ละสัญญา</li>\r\n \t<li>ยกเลิกใบเสร็จรับเงินที่เกิดจากการพิมพ์ผิดพลาด หรือเช็คคืนพร้อมทั้งระบุสาเหตุการยกเลิกได้</li>\r\n \t<li>ทำการสร้างรายการลงบัญชีให้อัตโนมัติ</li>\r\n \t<li>สามารถพิมพ์รายงานการรับชำระประจำวันเพื่อตรวจสอบรายการบัญชี</li>\r\n</ul>\r\n",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "big-data-and-analytics",
          "title": "Big Data and Analytics"
        },
        {
          "domain": "portfolio_category",
          "slug": "cloud-applications",
          "title": "Cloud Applications"
        },
        {
          "domain": "portfolio_category",
          "slug": "cloud-platform-infrastructure",
          "title": "Cloud Platform &amp; Infrastructure"
        },
        {
          "domain": "portfolio_category",
          "slug": "digital-marketing",
          "title": "Digital Marketing"
        },
        {
          "domain": "portfolio_category",
          "slug": "digital-transformation",
          "title": "Digital Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "enterprise-business",
          "title": "Enterprise Business"
        },
        {
          "domain": "portfolio_category",
          "slug": "fsi-financial",
          "title": "FSI (Financial)"
        },
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        },
        {
          "domain": "portfolio_category",
          "slug": "iot-internet-of-things",
          "title": "IoT (Internet of Things)"
        },
        {
          "domain": "portfolio_category",
          "slug": "it-operation-management",
          "title": "IT Operation Management"
        },
        {
          "domain": "portfolio_category",
          "slug": "solutions",
          "title": "Solutions"
        },
        {
          "domain": "portfolio_category",
          "slug": "thailand-4-0",
          "title": "Thailand 4.0"
        },
        {
          "domain": "portfolio_category",
          "slug": "thinking",
          "title": "Thinking"
        }
      ]
    },
    {
      "title": "ก้าวเข้าสู่ Cloud ด้วยโจทย์ทางธุรกิจ สนองความต้องการให้เป็นเรื่องง่าย",
      "description": "ปัจจุบันองค์กรธุรกิจมีการปรับเปลี่ยนด้านบริการตลอดจนการจัดการเกิดขึ้นอย่างรวดเร็ว เพื่อให้ตอบสนองต่อความต้องการของผู้ใช้บริการ หรือลูกค้า รวมถึงเพื่อรองรับรูปแบบความต้องการที่หลากหลายซึ่งกำลังจะเกิดขึ้นในอนาคต\r\n\r\n&nbsp;\r\n\r\nดังนั้นระบบเทคโนโลยีสารสนเทศ (IT) ภายในองค์กรจำเป็นต้องรองรับ หรือสอดคล้องกับรูปแบบการขับเคลื่อนธุรกิจที่หลากหลายเช่นกัน\r\n\r\n<!--more-->\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-24421 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2016/07/Digital-economy-1.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nความต้องการที่หลากหลายดังกล่าว ทำให้ผู้บริหารจัดการระบบเทคโนโลยีสารสนเทศของแต่ละองค์กรจะต้องปรับเปลี่ยนวิธีบริหารจัดการ หรือเปลี่ยนแปลงระบบไอทีให้ทันกับการดำเนินธุรกิจในรูปแบบใหม่ๆ เพื่อวางแผนให้ระบบไอทีภายในองค์กรสอดคล้องกับธุรกิจขององค์กร จากโจทย์ดังกล่าวทำให้ผู้จัดการระบบไอทีจำเป็นต้องพิจารณา และให้ความสำคัญกับปัจจัยต่างๆ เหล่านี้\r\n\r\n&nbsp;\r\n\r\n<strong>Cost</strong> – การลงทุนระบบไอที ณ ปัจจุบันต้องใช้เงินลงทุนเป็นจำนวนมากในช่วงแรก ทั้งด้านฮาร์ดแวร์และ\r\nซอฟต์แวร์ ดังนั้นการให้บริการ หรือนวัตกรรมใหม่ของธุรกิจอาจจะไม่สามารถเกิดขึ้นได้เลย\r\n\r\n&nbsp;\r\n\r\n<strong>Time</strong> – เวลาเป็นปัจจัยที่สำคัญในการดำเนินธุรกิจ หากระบบไอทีพร้อมที่จะให้บริการได้อย่างรวดเร็ว และสอดคล้องกับธุรกิจได้ จากในอดีตระยะเวลาในการติดตั้งระบบไอทีหนึ่งระบบต้องใช้เวลา 3–6 เดือน หรือ 1 ปี ปัจจุบันการติดตั้งระบบไอทีจะใช้เวลาเพียงไม่ถึง 1 เดือนเท่านั้น จึงส่งผลให้ธุรกิจสามารถขยายตัวได้อย่างรวดเร็วเช่นเดียวกัน\r\n\r\n&nbsp;\r\n\r\n<strong>Elastic</strong> – ในปัจจุบันระบบไอที รวมทั้งศูนย์ข้อมูลขององค์กรมีความยืดหยุ่นขึ้นมาก โดยสามารถทำการปรับเปลี่ยนทั้งการเพิ่ม-ลดทรัพยากรได้อย่างรวดเร็ว ไม่ว่าจะเป็นการเพิ่ม-ลด CPU, Memory, Disk, การเพิ่มจำนวนเซิร์ฟเวอร์ ฯลฯ โดยสามารถใช้งานได้ภายในไม่กี่ชั่วโมง จึงสอดรับกับการดำเนินธุรกิจในยุคนี้ที่มีความต้องการหลากหลาย\r\n\r\n&nbsp;\r\n\r\n<strong>Location</strong> – การเปิดประชาคมอาเซียนนั้น จะทำให้ธุรกิจ และบริการต่างๆ มีการกระจายไปยังต่างประเทศ หรือประเทศเพื่อนบ้านเพิ่มมากขึ้น ดังนั้นสถานที่ตั้งศูนย์ข้อมูลจะมีความสำคัญต่อการดำเนินธุรกิจ\r\n\r\n&nbsp;\r\n\r\nเพราะหากสถานที่ตั้งศูนย์ข้อมูลสามารถให้บริการผู้ใช้บริการได้อย่างทั่วถึงทั้งในประเทศและประเทศเพื่อนบ้านในอาเซียนก็ย่อมจะเป็นผลดีต่อธุรกิจและบริการในอนาคตอย่างแน่นอน\r\n<h2></h2>\r\n<h2>Cloud ตอบโจทย์ความต้องการ</h2>\r\n&nbsp;\r\n\r\nณ ปัจจุบันระบบคลาวด์ (<a href=\"https://www.g-able.com/solutions/cloud-platform-infrastructure/\"><strong>Cloud</strong></a>) ช่วยทำลายกำแพงที่เกิดขึ้นจากปัจจัยต่างๆ ที่ได้กล่าวมาข้างต้น โดยคลาวด์มีบริการให้เลือกหลากหลาย ทั้งจากผู้ให้บริการในประเทศ และผู้ให้บริการต่างประเทศ\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-27737 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/09/cloud-migrate-1.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nซึ่งปัจจุบันผู้ให้บริการมีรูปแบบการให้บริการแตกต่างกันไป สำหรับการนำระบบคลาวด์ไปใช้นั้นมีมุมมองต่างๆ ต่อการดำเนินธุรกิจ และการเพิ่มศักยภาพขององค์กร ดังต่อไปนี้\r\n\r\n&nbsp;\r\n\r\n<strong>Cost Efficiency</strong> – การลงทุนระบบคลาวด์มีรูปแบบ Pay Per Use หรือชำระค่าบริการแบบรายเดือนการลงทุนในช่วงแรกจึงไม่สูงนัก ทำให้การตัดสินใจเพื่อลงทุนกับบริการใหม่เป็นไปได้ง่ายมากขึ้น อีกทั้งยังสามารถเพิ่มหรือลดระบบตามการใช้งานที่เกิดขึ้นจริงในองค์กรได้ด้วย\r\n\r\n<strong>Time to Market</strong> – ระบบคลาวด์พร้อมที่จะให้ลูกค้าสามารถเข้าไปใช้งานได้ในทันที โดยการให้บริการของ G-ABLE จะเตรียมระบบโครงสร้างพื้นฐาน (Infrastructure), ระบบเครือข่าย (Network) และระบบปฏิบัติการ\r\n\r\n&nbsp;\r\n\r\nซึ่งลูกค้าหรือผู้ใช้บริการสามารถติดตั้งแอพพลิเคชั่นอื่นๆ ลงไปบนระบบคลาวด์ได้ทันที จึงช่วยลดเวลาในการติดตั้งให้เหลือเพียง เดือน สัปดาห์ หรือบางการประยุกต์ใช้งานสามารถเตรียมระบบให้พร้อมใช้งานได้เพียงแค่ 1 วันเท่านั้น ส่งผลให้องค์กรสามารถมีระบบที่รองรับต่อความต้องการของการดำเนินธุรกิจได้ทันที\r\n\r\n&nbsp;\r\n\r\n<strong>High Elastic</strong> – ระบบคลาวด์ให้ความยืดหยุ่นทั้งทางด้านเพิ่ม-ลดทรัพยากรในแบบอัตโนมัติ และแบบแมนนวล การเพิ่ม-ลดสามารถใช้เวลาไม่กี่ชั่วโมง หรือเพียงไม่กี่คลิ๊กก็สามารถปรับเปลี่ยนได้ทันทีจึงทำให้องค์กรไม่เกิดการเสียเปล่าต่อการใช้งานทรัพยากร และในขณะเดียวกันยังทำให้องค์กรสามารถรองรับความต้องการใช้งานระบบได้อย่างไม่จำกัดอีกด้วย\r\n\r\n<strong>Global Location</strong> – ระบบคลาวด์มีศูนย์ข้อมูลเพื่อให้บริการทั่วโลก สามารถรองรับธุรกิจของลูกค้าที่กระจายไปยังต่างประเทศได้ เช่น กลุ่มธุรกิจที่ต้องติดต่อประสานงานหรือให้บริการลูกค้าที่อยู่ต่างภูมิภาค เป็นต้น\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-25219 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/06/Cloud-3.jpg\" alt=\"\" width=\"900\" height=\"506\" />\r\n\r\n&nbsp;\r\n\r\nสำหรับระบบ<a href=\"https://www.g-able.com/solutions/cloud-platform-infrastructure/\">คลาวด์ของ G-ABLE</a> สามารถออกแบบให้ Data Center นั้นไป Operation อยู่ในภูมิภาคที่ใกล้เคียงกับงานที่จะต้องให้บริการเพื่อให้เกิดความสะดวกและมีประสิทธิภาพในการทำงานมากที่สุด\r\n\r\n&nbsp;\r\n\r\nจากปัจจัยที่กล่าวมาในหลายมิติ ปัจจุบันทีมของ G-ABLE พร้อมที่จะให้บริการกลุ่มองค์กรที่มีความสนใจจะนำ Cloud Technology (IaaS: Infrastructure as a Service) เข้าไปเริ่มประยุกต์ใช้กับองค์กร\r\n\r\n&nbsp;\r\n\r\nโดย G-ABLE มีบริการตั้งแต่เริ่มต้นด้วยการตรวจสอบความต้องการ และทำการประเมินปัจจัยที่จะเกิดผลกระทบเมื่อเริ่มนำระบบคลาวด์เข้าไปใช้งาน รวมถึงช่วยออกแบบโครงสร้างพื้นฐานของระบบคลาวด์ (Design Cloud Infrastructure) ให้สามารถตอบโจทย์ทางธุรกิจของลูกค้าให้ดีที่สุด\r\n\r\n&nbsp;\r\n\r\nG-ABLE มีบุคลากรที่มีความรู้ความเชี่ยวชาญสูง ได้รับใบรองรับหรือ Certificate ด้าน Cloud Computing Technology ทั้งในและต่างประเทศ นอกจากนั้น G-ABLE ยังมีผู้เชี่ยวชาญด้านการสร้าง Cloud Environment อีกทั้งยังทำการดูแลระบบความปลอดภัยของข้อมูลตามมาตรฐานความปลอดภัยหรือ Compliant ต่างๆ ที่ธุรกิจแต่ละประเภทจะต้องให้ความสำคัญ\r\n\r\n&nbsp;\r\n\r\nสำหรับการให้บริการนั้น G-ABLE สามารถรองรับลูกค้าได้ทั้งองค์กรที่มีความต้องการใช้งานคลาวด์ขนาดเล็กไปจนถึงองค์กรที่ต้องการใช้คลาวด์ขนาดใหญ่ เช่น บางองค์กรต้องการเครื่อง Virtual Machine จำนวน 1,000 เครื่อง เป็นต้น\r\n\r\n&nbsp;\r\n\r\nนอกจากนี้ G-ABLE ยังให้บริการ Cloud Storage ในหลายรูปแบบด้วย เช่น ความต้องการในด้านขนาดพื้นที่ในการจัดเก็บที่มาก หรือรูปแบบที่ต้องการความสามารถของ IOPS ที่สูงเป็นพิเศษสำหรับรองรับงานเฉพาะทาง\r\n\r\n&nbsp;\r\n\r\nทั้งนี้ทาง G-ABLE ยังพร้อมที่จะช่วยกลุ่มลูกค้าทำการทดสอบการใช้งานระบบคลาวด์ในระบบปิดที่แยกจากระบบอื่นอย่างชัดเจนเพื่อให้ลูกค้าเข้าใจการนำระบบคลาวด์ในแบบ IaaS ไปประยุกต์ใช้งานกับองค์กรของลูกค้าได้อย่างเต็มประสิทธิภาพนั่นเอง",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "advanced-technologies",
          "title": "Advanced technologies"
        },
        {
          "domain": "portfolio_category",
          "slug": "cloud-applications",
          "title": "Cloud Applications"
        },
        {
          "domain": "portfolio_category",
          "slug": "cloud-platform-infrastructure",
          "title": "Cloud Platform &amp; Infrastructure"
        },
        {
          "domain": "portfolio_category",
          "slug": "data-center-transformation",
          "title": "Data Center Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "digital-transformation",
          "title": "Digital Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "iot-internet-of-things",
          "title": "IoT (Internet of Things)"
        },
        {
          "domain": "portfolio_category",
          "slug": "it-operation-management",
          "title": "IT Operation Management"
        },
        {
          "domain": "portfolio_category",
          "slug": "solutions",
          "title": "Solutions"
        },
        {
          "domain": "portfolio_category",
          "slug": "thailand-4-0",
          "title": "Thailand 4.0"
        },
        {
          "domain": "portfolio_category",
          "slug": "thinking",
          "title": "Thinking"
        }
      ]
    },
    {
      "title": "Database Security",
      "description": "ในทุกวันนี้ถ้าหากมีการพูดถึงเรื่อง IT Security ขึ้นมาแล้ว เชื่อว่าทุกคนมักจะนึกถึงเรื่องของ Firewall หรือ ไม่ Anti-Virus ซะเป็นส่วนใหญ่ โดยที่มักจะหลงลืม ไปว่ายังมี Security ในส่วนของ Database อยู่อีกด้วย\r\n\r\n&nbsp;\r\n\r\nลองพิสูจน์ได้โดยให้ลองนึกชื่อของ Product Vendor ที่ขายสินค้าทางด้าน IT Security ขึ้นมา โดยมากแล้วชื่ออื่นที่จะผุดขึ้นมากก็มักจะเป็นลักษณะประเภท Firewall หรือ Anti-Virus กันแทบจะทั้งนั้น โดยที่แทบจะไม่มีประเภท Database Security ขึ้นมาเลย<!--more-->\r\n\r\n&nbsp;\r\n\r\nทั้งๆ ที่เป้าหมายสุดท้ายส่วนใหญ่ของการบุกรุกก็มักจะเป็นตัว Database นั่นเอง ไม่ว่ารูปแบบของการบุกรุกจะเป็นการขโมยข้อมูล เช่น หมายเลขบัตรเครดิต ข้อมูลทางด้านการเงิน ไปจนถึง ทรัพย์สินทางปัญญาและอื่นๆ\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-27792 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/09/information-leak-1.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nบางครั้งที่ไม่ได้เป็นการเข้ามาขโมยข้อมูล แต่ก็จะเป็นการเข้ามาแก้ไขข้อมูลเลย ซึ่งโดยมากก็มักจะเป็นข้อมูลทางด้านการเงินหรือทรัพย์สินที่มีมูลค่าที่อยู่ในรูปแบบของ Digital ต่างๆ เช่น บัตรเติมเงิน, Debit Card\r\n\r\n&nbsp;\r\n\r\nลองมาคิดดูเล่นๆ กันว่าถ้าหากองค์กรของเราตกอยู่ในสถานการณ์ดังต่อไปนี้ แล้วระบบ IT Security ของเรามีกลไกครบถ้วนมากพอที่จะรับมือกับสิ่งที่เกิดขึ้นนี้ได้อย่างมีประสิทธิภาพเพียงพอหรือไม่\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li><strong>ถ้าหาก </strong>ผู้บุกรุกสามารถผ่านด่านของ Network Security เข้ามาได้ ทำให้สามารถเข้าถึง Database ได้โดยตรง โดยที่ Database เองไม่ได้มีกลไกต่างหากในการป้องกันตัวเองเลย</li>\r\n \t<li><strong>ถ้าหาก </strong>ผู้บุกรุกอยู่ในฐานะที่จะเข้ามา Access Network ภายในขององค์กรได้ในระดับเดียวกับที่พนักงานใช้อยู่ เช่น เป็นพนักงานของ Vendor, Outsource, Partner หรือแม้กระทั่งตัวพนักงานเอง ทำผู้บุกรุกสามารถทะลุเข้าไปถึงตัว Database ได้โดยอาศัยสิทธิจากหน้าที่งานที่ทำอยู่ โดยไม่ต้องใช้เทคนิคหรือความสามารถพิเศษใดๆ เลย</li>\r\n \t<li><strong>ถ้าหาก </strong>Database Admins (DBAs) ซึ่งมีสิทธิที่จะทำ อะไรก็ได้ทุกอย่างในระบบ Database แล้วถ้าหาก DBA นี้เกิดทำ Password รั่วไหลไปสู่บุคคลอื่นไม่ว่าจะโดยเจตนาหรือไม่เจตนา หรือแม้กระทั่งตัว DBA เกิดทุจริตซะเอง</li>\r\n \t<li><strong>ถ้าหาก </strong>ข้อมูล Database ซึ่งมักจะมีการทำ Backup เก็บลง Tape ไว้ เกิดถูกขโมยแล้วนำไป Restore ข้อมูลออกมาก็จะเท่ากับว่าผู้บุกรุกได้ข้อมูลไปทั้งหมดโดยไม่ต้องผ่านด่านของ IT Security ใดๆ เลย</li>\r\n \t<li><strong>ถ้าหาก </strong>ระบบ Database ที่มักจะมีระบบ DR คู่ขนานไปด้วยซึ่งระบบ DR นี้ ในบางครั้งจะมีระดับของการป้องกันการบุกรุกที่ต่ำกว่าระบบ Production ดังนั้นผู้ที่จะบุกรุกเข้าไปที่ระบบ DR แทนที่จะไปที่ระบบ Production</li>\r\n \t<li><strong>ถ้าหาก </strong>งาน Develop/Test Application ที่มีการเรียกใช้ข้อมูลส่วนที่เป็น Sensitive Information ซึ่งไม่ต้องการให้ Developer/Tester มองเห็นข้อมูลนี้ แต่ถ้าไม่ให้ข้อมูลไปก็จะไม่สามารถ Develop/Test Application ได้ลุล่วงตามที่ต้องการ</li>\r\n \t<li><strong>ถ้าหาก </strong>Application บางตัวจำเป็นต้องเข้าถึงข้อมูลบางอย่างที่ไม่ได้ต้องการให้เห็น เช่น ระบบพิมพ์ใบเรียกเก็บเงินบัตรเครดิต ที่ต้องการให้ Application เห็นหมายเลขบัตรเครดิตเพียงแค่บางส่วน เช่น 1234-xxxx-xxxx-xx56 แต่ในขณะเดียวกันก็ต้องการให้ Application ตัวอื่นยังคงสามารถเข้าถึงหมายเลขบัตรเครดิตนี้ได้แบบครบถ้วน</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-27762 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/09/human-error-1.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nจะเห็นได้ว่าข้อมูลทุกอย่างขององค์กรซึ่งนั่นก็จะรวมถึงข้อมูลสำคัญประเภทที่ว่าสามารถทำ ให้องค์กรสั่นคลอนได้ถ้าหากเกิดปัญหาขึ้นกับข้อมูลเหล่านี้ไม่ว่าจะเป็น ข้อมูลหาย ถูกแก้ไข ถูกขโมย ซึ่งผลเสียก็จะมีทั้งที่เป็นทางตรงที่คิดเป็นมูลค่าได้แล้วยังมีที่เป็นผลเสียแบบประเมินค่าไม่ได้\r\n\r\n&nbsp;\r\n\r\nซึ่งก็คือชื่อเสียงขององค์กร ที่อาจจะเป็นเรื่องใหญ่กว่าความเสียหายทางตัวเงินด้วยซ้ำ โดยเฉพาะอย่างยิ่งสำหรับองค์กรที่มีธุรกิจที่ต้องขายความน่าเชื่อถือ เช่น ธนาคาร ประกัน โรงพยาบาลหรือหน่วยงานราชการบางประเภท ซึ่งปัญหาทั้งหมดนี้สามารถที่จะเกิดขึ้นได้จากการกระทำของบุคคลเพียงบุคคลเดียว ไม่ว่าจะเป็นการกระทำที่ตั้งใจหรือไม่ตั้งใจ\r\n\r\n&nbsp;\r\n\r\nจากสถานการณ์ที่ยกมาทั้งหมดนี้ หากพบว่าองค์กรของเรายังไม่มีเครื่องมือหรือวิธีการที่จะจัดการสถานการณ์เหล่านี้ได้อย่างเหมาะสม ในส่วนของ Oracle จะมี Solutions ที่จะช่วยเหลือได้\r\n\r\n&nbsp;\r\n\r\nโดย <strong>Oracle Database Security Solution</strong> นี้จะช่วยในการป้องกันระบบ Database โดยแบ่งออกตามลักษณะการทำงานเป็นกลุ่มต่างๆ ได้ดังต่อไปนี้\r\n\r\n&nbsp;\r\n<h3><strong>Protecting Against Database Bypass</strong></h3>\r\n&nbsp;\r\n\r\nเป้าหมายการทำงานของ Solutions ในกลุ่มนี้คือเพื่อป้องกันการเข้าถึง Sensitive Information ที่มาในรูปแบบการ Access ไปที่ File ตรงๆ โดยไม่ผ่านระบบ Database เช่น ตามภาพด้านล่างจะแสดงให้เห็นวิธีการดึงข้อมูลหมายเลขบัตรเครดิตออกมาโดยใช้คำสั่งของ OS เพียงคำสั่งเดียวเท่านั้น\r\n\r\n&nbsp;\r\n\r\nซึ่งแน่นอนว่าไม่ต้องผ่านด่านระบบป้องกันต่างๆ ของ Database เลย (ขออนุญาตไม่แสดงตัวอย่างคำสั่งนะครับ เนื่องจากกลัวว่าจะกลายเป็นการชี้ช่องไป)\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16747 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/BD_sec_2.jpg\" alt=\"\" width=\"750\" height=\"255\" />\r\n\r\n&nbsp;\r\n\r\nรวมไปถึงการป้องกันไม่ให้มีการนำ Backup Tape ไปทำการ Restore ข้อมูลและเข้าถึงข้อมูลต่างๆ ได้\r\n\r\n&nbsp;\r\n\r\nโดยความสามารถนี้ของ Oracle จะมีชื่อว่า <a href=\"http://www.oracle.com/technetwork/database/security/twp-transparent-data-encryption-bes-130696.pdf\"><strong>Transparent Data Encryption</strong></a> (TDE) ซึ่งจะมีหลักการคือจะทำการ Encrypt Database โดยสามารถทำได้ทั้งในระดับของ Columns และทั้ง Application Tablespaces โดยที่ในส่วนของ Application นั้นจะไม่ต้องมีการเปลี่ยนแปลงอะไรเลย\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16748 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/BD_sec_3.jpg\" alt=\"\" width=\"642\" height=\"362\" />\r\n\r\n&nbsp;\r\n<h3><strong>Protecting Against Application Bypass</strong></h3>\r\n&nbsp;\r\n\r\nเป้าหมายการทำงานของ Solutions ในกลุ่มนี้คือเพื่อป้องกันการเข้าถึง Sensitive Information ที่เข้ามาโดยไม่ผ่าน Applicationที่มีสิทธิในการเข้าถึงอย่างถูกต้อง เช่น DBA ที่สามารถเข้าถึงข้อมูลโดยตรงได้ทุกอย่าง\r\n\r\n&nbsp;\r\n\r\nซึ่งนี่ก็จะเป็นความเสี่ยงขององค์กรที่เอา Sensitive Information รวมไปถึงความมั่นคงปลอดภัยของธุรกิจมาขึ้นอยู่กับ DBA เพียงคนเดียว\r\n\r\n&nbsp;\r\n\r\nโดย Oracle จะมี Solutions ที่ทำงานป้องกันในลักษณะนี้อยู่คือ <a href=\"http://www.oracle.com/technetwork/database/options/database-vault/index-085211.html\"><strong>Oracle Database Vault</strong></a> มีหลักการการทำงานคือแบ่งสิทธิการทำงานต่างๆ จากกันรวมถึงออกจาก DBA ด้วยเช่นกัน ซึ่งจะมีผลทำให้ DBA จะมีหน้าที่ในการดูแล Database Engine เท่านั้น\r\n\r\n&nbsp;\r\n\r\nโดยที่ไม่สามารถเข้าถึงข้อมูลโดยตรงได้อีก โดยในส่วนของข้อมูลก็จะมีการแบ่งสิทธิให้กับ User ต่างๆ ตามหน้าที่รับผิดชอบและตาม Application เท่านั้น รวมไปถึงยังสามารถตั้งเงื่อนไขเพิ่มเติมสำหรับการเข้าถึงข้อมูลได้อีกด้วย เช่น ช่วงเวลาที่สามารถเข้าไปใช้ข้อมูลได้\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16749 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/BD_sec_4.jpg\" alt=\"\" width=\"643\" height=\"362\" />\r\n\r\n&nbsp;\r\n\r\n<a href=\"http://www.oracle.com/technetwork/database/database-technologies/audit-vault-and-database-firewall/overview/overview-1877404.html\"><strong>Oracle Database Firewall</strong></a> มีหลักการการทำงานคล้ายกับ Network Firewall แต่จะต่างกันตรงที่ Network Firewall จะป้องกันระบบโดยวิเคราะห์จาก IP, Service Port\r\n\r\n&nbsp;\r\n\r\nแต่ Database Firewall จะวิเคราะห์จาก SQL Transaction โดยจะคอยตรวจจับและป้องกันไม่ให้ Unauthorized Database Activities ตามที่ได้กำหนดไว้ใน Policy เข้ามาถึงระบบ Database ได้ ซึ่งรวมไปถึงสามารถป้องกันการโจมตีในลักษณะของ SQL Injection ได้ด้วยเช่นกัน\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16750 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/BD_sec_5.jpg\" alt=\"\" width=\"643\" height=\"362\" />\r\n\r\n&nbsp;\r\n\r\n<strong>Protecting Against Sensitive Data Exposure</strong>\r\n\r\n&nbsp;\r\n\r\nเป้าหมายการทำงานของ Solutions ในกลุ่มนี้คือเพื่อปกปิดข้อมูลบางส่วนหรือทั้งหมด ไม่ให้ผู้ใช้งานหรือ Application ได้เห็นข้อมูลที่แท้จริง แต่โครงสร้างรูปแบบของข้อมูลจะยังคงเดิมและสามารถนำไปใช้กับงานบางอย่างได้\r\n\r\n&nbsp;\r\n\r\nโดย Oracle จะมี Solutions ที่ทำงานในลักษณะนี้อยู่คือ<a href=\"http://www.oracle.com/technetwork/database/options/data-masking-subsetting/overview/index.html\"><strong> Oracle Data Masking</strong></a> มีลักษณะการทำงานคือทำให้ข้อมูลใน Database มีค่าเปลี่ยนแปลงไปโดยที่ยังคงมีโครงสร้างเหมือนเดิม เช่น เปลี่ยนชื่อ เปลี่ยนหมายเลขบัตรเครดิต เป็นชื่อ/หมายเลขอื่นๆ ที่ไม่ใช่ค่าจริงแต่โครงสร้างยังถูกต้องมากพอที่จะใช้ในการทดสอบหรือพัฒนาระบบงานได้โดยที่เราสามารถกำหนดวิธีการที่จะเปลี่ยนแปลงข้อมูลเหล่านี้ได้ด้วย\r\n\r\n&nbsp;\r\n\r\nซึ่งจะส่งผลให้ Application Development/Test ยังคงเดินหน้าได้ต่อไปโดยที่ไม่มีปัญหาเรื่อง Sensitive Information รั่วไหลออกไป ไม่ว่า Developer/Tester นั้นจะเป็นคนภายในหรือภายนอกองค์กร\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16751 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/BD_sec_6.jpg\" alt=\"\" width=\"642\" height=\"364\" />\r\n\r\n&nbsp;\r\n\r\nจากที่ได้กล่าวมาทั้งหมด เชื่อว่าจะเป็นข้อมูลเพิ่มเติมสำหรับองค์กรต่างๆ เพื่อใช้พิจารณาถึงความจำเป็นสำหรับการที่จะเพิ่ม Security ให้กับระบบ Database ขององค์กร\r\n\r\n&nbsp;\r\n\r\nโดยเฉพาะอย่างยิ่งในส่วนของ Database ที่เก็บ Sensitive Information ต่างๆ ไม่ว่าจะเป็น ข้อมูลหมายเลขบตั รเครดิตลกู ค้า ข้อมูลของเงินเดือนพนักงาน ข้อมูลหมายเลขที่มีลักษณะเป็น Digital Money เช่น บัตรเติมเงินต่างๆ ข้อมูลทางการเงินขององค์กร และอื่นๆ เพื่อให้การดำเนินงานขององค์กรเป็นไปอย่างราบรื่น ปลอดภัยและน่าเชื่อถือ",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "cybersecurity",
          "title": "Cybersecurity"
        },
        {
          "domain": "portfolio_category",
          "slug": "data-center-transformation",
          "title": "Data Center Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "digital-transformation",
          "title": "Digital Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "oracle-solutions",
          "title": "Oracle Solutions"
        },
        {
          "domain": "portfolio_category",
          "slug": "solutions",
          "title": "Solutions"
        },
        {
          "domain": "portfolio_category",
          "slug": "thinking",
          "title": "Thinking"
        }
      ]
    },
    {
      "title": "Secured Software Development",
      "description": "“ปัจจุบันโลกของเรามีการเปลี่ยนแปลงเทรนด์ของเทคโนโลยีอย่างรวดเร็ว รวมถึงพฤติกรรมของผู้คนที่มีแนวโน้มหันมาใช้งาน IT Solution เช่น Internet Banking, E-Wallet หรือ E-Service ต่างๆ ที่มีการใช้งานข้อมูลส่วนตัวที่สำคัญ ไม่ว่าจะเพื่อเข้าใช้งานหรือใช้เพื่อการสั่งการทำธุรกรรมต่างๆ\r\n\r\n&nbsp;\r\n\r\nทำให้นักพัฒนาหรือองค์กรที่มีการให้บริการระบบดังกล่าวต้องคำนึงถึงภัยที่อาจจะเกิดขึ้นต่อระบบด้วยความรอบคอบและคำนึงถึงความปลอดภัยของข้อมูลทั้งของผู้ใช้งานและองค์กร”<!--more-->\r\n\r\n&nbsp;\r\n\r\nถ้าพูดถึงกระบวนการในการพัฒนาระบบทุกคนคงรู้จัก <a href=\"http://searchsoftwarequality.techtarget.com/definition/systems-development-life-cycle\">System/Software Development Life Cycle</a> (SDLC) ซึ่งเป็นการพูดภาพรวมของขั้นตอนในการพัฒนาระบบเอาไว้อย่างครบถ้วน สำหรับขั้นตอนการพัฒนาระบบ SDLC แบ่งคร่าวๆ ได้ 6 ขั้นตอนดังนี้\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n<img class=\"wp-image-16754 size-full aligncenter\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/Sec_sw_dev_1.jpg\" alt=\"\" width=\"397\" height=\"403\" />\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>Requirement Gathering and Analysis ขั้นตอนการวางแผนงาน โดยกำหนดรูปแบบของซอฟต์แวร์ ประมาณการต้นทุนในการพัฒนาระบบกำหนดแนวทางของการพัฒนาระบบ กำหนดระยะเวลา และค้นหาความต้องการของระบบ วิเคราะห์ความต้องการนั้น เพื่อให้เข้าใจภาพรวมและหน้าที่การทำงานของระบบ</li>\r\n \t<li>Design ขั้นตอนการออกแบบส่วนประกอบต่างๆ ของซอฟต์แวร์ เพื่อให้ตรงกับความต้องการที่ได้วิเคราะห์มาแล้ว</li>\r\n \t<li>Implementation or Coding ขั้นตอนการสร้างระบบโดยการเขียนโปรแกรม ตามแนวทางการออกแบบจากขั้นตอนที่ผ่านมา</li>\r\n \t<li>Integration and Testing ขั้นตอนการนำระบบทที่ทำทดสอบการใช้งาน ว่าทำงานถูกต้องหรือไม่ ซึ่งการทดสอบนี้จะรวมถึงการทดสอบการเชื่อมโยงกับระบบซอฟต์แวร์อื่นๆ ที่เกี่ยวข้องด้วย และประเมินว่าระบบที่ผ่านการทดสอบแล้ว เหมาะสมที่จะนำไปใช้งานได้หรือไม่</li>\r\n \t<li>Installation and Deployment ขั้นตอนการนำระบบที่พัฒนาและผ่านการทดสอบแล้วไปใช้งาน โดยทำการติดตั้ง และสอนวิธีการใช้งาน แก่ผู้ใช้ (บางระบบเป็นการพัฒนาต่อเนื่อง หรือเป็นการพัฒนาระบบใหม่มาแทนระบบเดิม อาจจะต้องมีการนำข้อมูลเก่าเข้าระบบใหม่ก่อนการนำระบบไปใช้จริง)</li>\r\n \t<li>Maintenance ขั้นตอนของการให้ความช่วยเหลือต่อผู้ใช้ เมื่อพบปัญหา โดยหากปัญหาที่เกิดไม่สามารถแก้ไขได้ จะต้องทำการพัฒนาระบบเพิ่มเติม ก็จะเริ่มวนไปที่ขั้นตอนแรกใหม่</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n\r\nจากวงจรการพัฒนาระบบตามที่กล่าวมานั้น หากเราต้องการพิจารณาถึงความปลอดภัยของข้อมูลในระบบที่จะดำเนินการพัฒนาก็สามารถอ้างอิงได้จากวงจรการพัฒนาเช่นกัน แต่กระบวนการนี้จะมีชื่อเล่นใหม่ว่า\r\n\r\n&nbsp;\r\n<h3><strong>Secured System/Software Development Life Cycle</strong> (SSDLC)</h3>\r\nซึ่งจะเป็นการระบุว่าในแต่ละขั้นตอน ของการพัฒนาผู้ที่เกี่ยวข้องในส่วนต่างๆ จะต้องคำนึงถึงความปลอดภัยของข้อมูลอย่างไรบ้าง แต่ก็แน่นอนว่าแต่ละระบบที่ ทำการพัฒนานั้น จะมีข้อควรระวังไม่เหมือนกันตามแต่รูปแบบการพัฒนาของแต่ละระบบ\r\n\r\n&nbsp;\r\n\r\nโดยแต่ละขั้นตอนของวงจรการพัฒนาระบบจะต้องมีการคำนึงถึงความปลอดภัยของระบบดังนี้\r\n\r\n&nbsp;\r\n\r\n<strong>Requirement Gathering and Analysis</strong>\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-27248 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/08/auto-analysis.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nในขั้นตอนนี้จะต้องมีการจัดทำ Security Requirements ของระบบ โดยมีการระบุว่าในการดำเนินการพัฒนาระบบนั้นจะต้องมีการคำนึงถึงความปลอดภัยต่างๆ ด้วยจากการทำ Risk Assessment ของระบบว่าระบบนั้นมีความเสี่ยงด้านความปลอดภัยของข้อมูลหรือระบบอย่างไรบ้าง\r\n\r\n&nbsp;\r\n\r\nสำหรับขั้นตอนนี้นั้นนับว่าเป็นขั้นตอนที่สำคัญที่สุดในขั้นตอนทั้งหมดเพราะจะเป็นการกำหนดให้ผู้ที่รับผิดชอบในส่วนต่างๆ ของการดำเนินการพัฒนาระบบต้องคำนึงถึงความปลอดภัยของข้อมูลในระบบตลอดวงจรการดำเนินการพัฒนา\r\n\r\n&nbsp;\r\n\r\n<strong>Design</strong>\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28818 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/think_design-1.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nในขั้นตอนนี้เป็นการกำหนด Secured Design สำหรับระบบตามที่เราได้ Security Requirements จากข้อก่อนหน้าแล้ว โดยการดีไซน์ระบบให้มีความปลอดภัยนั้นจะมีการทำ Analyze Attack Surface เพื่อหาความเป็นไปได้ในการโจมตีระบบจาก Risk ต่างๆ ที่เรามีอยู่\r\n\r\n&nbsp;\r\n\r\nเพื่อนำมาสู่การทำ Threat Modeling เพื่อดูว่าสุดท้ายแล้วเราจะต้องดำเนินการเสริมความปลอดภัยในด้านใด เพื่อให้ระบบของเรามีความเสี่ยงด้านความปลอดภัยของข้อมูลอยู่ในระดับที่รับได้\r\n\r\n&nbsp;\r\n\r\n<strong>Implementation and Testing</strong>\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-27555 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/08/check-list.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nในหัวข้อนี้ขอรวบเนื้อหาทั้งส่วนการดำเนินการพัฒนาและการทดสอบระบบ เนื่องในการดำเนินการจริงทั้งสองระบบนี้มักจะทำไปควบคู่กันแบบคู่ขนานและมีการแลกเปลี่ยนข้อมูลที่ทำการทดสอบเพื่อแก้ไขระบบอยู่ตลอดเวลา\r\n\r\n&nbsp;\r\n\r\nสำหรับการพัฒนาในปัจจุบันนั้นจะต้องคำนึงถึงความปลอดภัยของข้อมูลจากจากโจมตีต่างๆ ที่มีอยู่ในขณะนั้น โดยมักจะอ้างอิงมาจากมาตรฐานต่างๆ ที่มีความน่าเชื่อถือ เช่น NIST, SANS และ OWASP เป็นต้น\r\n\r\n&nbsp;\r\n\r\nตัวอย่างการพัฒนาแอปพลิเคชันโดยคำนึงถึงภัยที่อาจจะเกิดขึ้นตาม<a href=\"https://www.owasp.org/index.php/Top_10_2013-A3-Cross-Site_Scripting_(XSS)\"> OWASP Top 10:2013 A3 – Cross-Site Scripting</a> (XSS) ในตัวอย่างนี้จะพูดถึง Web Page ที่ผู้ไม่หวังดีสามารถใส่คำสั่งที่สามารถขโมยข้อมูล Cookies และ Sessions ID ของผู้อื่นได้โดยไม่ได้รับอนุญาต\r\n\r\n&nbsp;\r\n\r\nผลที่ตามมาคือผู้ใช้งานรายอื่นๆ ที่เข้ามายัง Web Page นี้นั้นถูกขโมยข้อมูลออกไปยังเครื่องของผู้ไม่หวังดีได้ ดังรูปต่อไปนี้\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28820\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/xss-1-300x177.jpg\" alt=\"\" width=\"750\" height=\"442\" />\r\n\r\n&nbsp;\r\n\r\nจากตัวอย่างเราจะสามารถพิจารณาถึงการพัฒนาที่ต้องคำนึงถึงการป้องกันการไม่ให้ผู้ที่ไม่ได้รับอนุญาตใส่คำสั่งไม่พึงประสงค์ใน Web Page เช่น การทำ Input Validation ในทุกๆ ช่องทาง มีการทำ Blacklist และ Whitelist ของข้อมูลที่เราสามารถรับได้ เป็นต้น และการทดสอบที่ต้องมีการดำเนินการตรวจสอบความปลอดภัยตามมาตรฐานต่างๆ เช่นการทำ Vulnerability Assessment หรือ Penetration Testing ก่อนการใช้งานจริง เป็นต้น\r\n\r\n&nbsp;\r\n\r\n<strong>Installation and Deployment</strong>\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-26757 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/06/Big-Data-faster-1.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nในขั้นตอนนี้เป็นการนำไปใช้งานจริง ซึ่งหลายๆ ท่านอาจจะคิดว่าไม่น่าจะมีอะไรที่เกี่ยวข้องกับความปลอดภัยของข้อมูล แต่จริงๆ แล้วในขั้นตอนนี้นั้นถือเป็นการตรวจสอบและยืนยันผลว่าสิ่งที่เราได้ทำไปแล้วในขั้นตอนทั้งหมดนั้นได้ดำเนินการตาม Security Requirement จริงๆ\r\n\r\n&nbsp;\r\n\r\nส่วนที่สำคัญคือการนำข้อมูลทดสอบออกจากระบบก่อนใช้งานจริง ไม่ว่าจะเป็นข้อมูลที่เป็นส่วนการปฏิบัติงานหรือข้อมูลที่เป็นส่วนของการบริหาร เช่น ข้อมูล User ที่เข้าระบบในการทดสอบ เป็นสิ่งที่หลายๆ ท่านมักลืมแล้วอาจจะเป็นภัยที่ไม่คาดคิดได้ในอนาคต\r\n\r\n&nbsp;\r\n\r\n<strong>Maintenance</strong>\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-26816 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/07/Big-Data-Right-Tools.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nในขั้นตอนนี้เป็นขั้นตอนในการรักษาระบบให้ข้อมูลมีความปลอดภัยอยู่เสมอ เช่น การทำ <a href=\"https://www.ready.gov/business/implementation/continuity\">Business Continuity Plan</a> (BCP) เพื่อป้องกันเหตุที่อาจจะทำให้ระบบไม่สามารถใช้งานได้ตามปกติหรือ Backup Plan ในกรณีเหตุฉุกเฉินที่ทำให้ข้อมูลในระบบไม่สมบูรณ์หรือศูนย์หาย และสุดท้ายการทำ Incident Response Management เพื่อคอยเฝ้าระวังเหตุต่างๆ ที่อาจจะเกิดขึ้น ทำให้ป้องกันภัยที่จะเกิดขึ้น หรือทำให้ระบบสามารถกลับมาทำงานได้ในระยะเวลาอันสั้น\r\n\r\n&nbsp;\r\n\r\nที่กล่าวมาทั้งหมดนั้นหากท่านได้นำหลักการของ SSDLC ไปใช้ในการทำ SDLC ปกติ จะทำให้โครงการของท่านมีความปลอดภัยทางข้อมูลมากยิ่งขึ้น เพราะในปัจจุบันผู้ที่ไม่หวังดีซึ่งคอยมุ่งโจมตีระบบของท่านนั้นมีจำนวนเพิ่มมากขึ้นและวิธีการโจมตีในปัจจุบันก็ง่ายมากขึ้น ทำให้การนำ SSDLC ไปใช้เพิ่มเติมต่อยอดในการดำเนินการพัฒนานั้นมีประโยชน์ต่อโครงการของท่านอย่างแน่นอน\r\n\r\n&nbsp;\r\n\r\nสุดท้ายนี้ที่กล่าวมานั้นเป็นเพียงโครงสร้างของการดำเนินการพัฒนาโครงการโดยรวม ทำให้ยังมีรายละเอียดปลีกย่อยอื่นๆ ที่ยังไม่ได้กล่าวถึงอีกมากมาย ทั้งนี้ทีมผู้เขียน จะนำความรู้เชิงเทคนิเกี่ยวกับ OWASP มานำเสนอให้ท่านในครั้งถัดไป",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "cybersecurity",
          "title": "Cybersecurity"
        },
        {
          "domain": "portfolio_category",
          "slug": "solutions",
          "title": "Solutions"
        }
      ]
    },
    {
      "title": "Security Framework และมาตรฐานความมั่นคงดิจิทัล",
      "description": "<a href=\"https://www.g-able.com/solutions/cybersecurity/attachment/information-security/\">Information Security</a> นั้นประกอบไปด้วยหลายองค์ประกอบและหลากหลายสาขาความรู้ ในสาขา IT เช่น Network Security, Application Security, Forensics, Cryptography, และอื่นๆ อีกมากมาย\r\n\r\n&nbsp;\r\n\r\nพื้นฐานการจัดการปัญหาต่างๆ ที่เกี่ยวข้องกับ Information Security นั้นมีความจำเป็นที่จะต้องทำให้สอดคล้องกับ Business Objectives หรือเป้าหมายทางธุรกิจ และการลงทุนนั้นจะต้องตอบโจทย์ของธุรกิจ กล่าวคือ จะต้องปกป้องทรัพย์สินที่สำคัญที่สุดของธุรกิจนั้นๆ จึงจะคุ้มค่า\r\n\r\n<!--more-->\r\n\r\n&nbsp;\r\n\r\nหลักการจัดการดังกล่าวประกอบไปด้วยการดูแลให้เกิดการจัดการที่ดีมีธรรมาภิบาล (Good Governance) การจัดการความเสี่ยง (Risk Management) และการปฏิบัติตามกฎกติกา (Compliance) หรือเรียกสั้นๆ ว่า GRC\r\n\r\n&nbsp;\r\n\r\n<img class=\"aligncenter wp-image-28601 size-medium\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/grc-1-300x300.png\" alt=\"\" width=\"300\" height=\"300\" />\r\n\r\n&nbsp;\r\n\r\nGRC นั้นประกอบไปด้วยหลาย Concept เช่น IT Governance (ซึ่งมีมาตรฐานการจัดการเช่น <a href=\"http://www.isaca.org/Knowledge-Center/COBIT/Pages/Overview.aspx\">CobiT</a>) และ IT Best Practice เช่น <a href=\"https://www.iso.org/isoiec-27001-information-security.html\">ISO 27001 – Information Security Management System</a>.\r\n\r\n&nbsp;\r\n\r\nแนวทางการดำเนินการ GRC (GRC Framework) เน้นการสร้างดุลยภาพระหว่าง People, Process และ Technology เพื่อเกื้อหนุนกันในการสร้างการจัดการองค์กรที่ดี โดยมีระบบการจัดการเป็นวัฎจักร PDCA (Plan-Do-Check-Act) เพื่อให้เกิดการพัฒนาอย่างต่อเนื่อง (Continuous Improvement)\r\n\r\n&nbsp;\r\n\r\n<img class=\"aligncenter wp-image-28603 size-medium\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/pdca-circle-image-300x273.jpg\" alt=\"\" width=\"300\" height=\"273\" />\r\n\r\n&nbsp;\r\n\r\nบทความนี้จะอธิบายถึงมาตรฐาน <a href=\"https://www.iso.org/standard/54534.html\">ISO 27001:2013</a> ที่เป็นมาตรฐานที่เป็นที่ยอมรับที่สุดอันหนึ่งในวงการเกี่ยวกับการจัดการดูแลความปลอดภัยและความมั่นคงของข้อมูล (ISMS)\r\n\r\n&nbsp;\r\n\r\nนอกจากนั้น จะพูดถึงโครงสร้างการดำเนินการความมั่นคงไซเบอร์ระดับนานาชาติของ National Institute of Standards and Technology หรือ <a href=\"https://www.nist.gov/\">NIST</a> Cyberse-Curity Framework ซึ่งมีเนื้อหาที่แตกต่างจาก ISMS และเริ่มเป็นที่นิยมใช้มากขึ้น\r\n\r\n&nbsp;\r\n\r\nInformation Security Management System (ISO 27001:2013) ISMS เป็นมาตรฐานการจัดการข้อมูลที่มีความสำคัญเพื่อให้สามารถดำเนินธุรกิจได้อย่างต่อเนื่อง การนำ ISMS มาประยุกต์ใช้ในองค์กรจะช่วยป้องกันกระบวนการทางธุรกิจจากภัยร้ายแรงต่างๆ เช่น วาตภัย อุทกภัย หรือการโจมตีจากผู้ไม่ประสงค์ดี\r\n\r\n&nbsp;\r\n\r\nเป้าหมายของ ISMS คือการสร้างระบบการจัดการความปลอดภัยของข้อมูลเพื่อ\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>Confidentiality - การจัดการให้แน่ใจว่า ผู้ที่ควรได้รับสิทธิเท่านั้นที่สามารถเข้าถึงข้อมูลได้</li>\r\n \t<li>Integrity - การดูแลป้องกันให้ข้อมูลมีความถูกต้องสมบูรณ์ทั้งในการเก็บและระหว่างการสื่อสาร</li>\r\n \t<li>Availability - การทำให้แน่ใจว่าผู้ที่มีสิทธิสามารถเข้าถึงข้อมูลได้ในเวลาที่ต้องการ</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n\r\nหลักการสำคัญของการทำ ISMS คือการเข้าใจถึงการจัดการความเสี่ยงขององค์กร (Risk Management)\r\n\r\nโดยปกติแล้วจะมีขั้นตอนคร่าวๆ ดังนี้\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>ความเห็นชอบและการให้ความสำคัญของผู้บริหารองค์กรต่อการมีมาตรฐาน ISMS</li>\r\n \t<li>การวิเคราะห์องค์กรเพื่อเข้าใจ Context ขององค์กรและการจำกัด Scope ที่จะทำการ พัฒนากระบวนการเข้าสู่มาตรฐาน ISMS</li>\r\n \t<li>การกำหนด Policy หลักขององค์กร</li>\r\n \t<li>การประเมินความเสี่ยงขององค์กร และการกำหนดมาตรการ(Control) เพื่อจัดการความเสี่ยง (Managing Risk)\r\n<ul>\r\n \t<li>การลดทอนความเสี่ยง (Risk Reduction)</li>\r\n \t<li>การหลีกเลี่ยง ความเสี่ยง (Risk Avoidance)</li>\r\n \t<li>การถ่ายทอดความเสี่ยง (Risk Transfer)</li>\r\n \t<li>การยอมรับความเสี่ยง (Risk Acceptance)</li>\r\n</ul>\r\n</li>\r\n \t<li>การสร้างระบบการติดตามและประเมินผล (Monitoring and Evaluation)</li>\r\n \t<li>การเก็บหลักฐานและการจดบันทึก (Document Information)</li>\r\n \t<li>การฝึกฝนพนักงาน</li>\r\n \t<li>การตรวจสอบ (Audit)</li>\r\n \t<li>การประเมินโดยฝ่ายบริหาร (Management Review)</li>\r\n \t<li>การตรวจสอบโดยองค์กรภายนอกเพื่อประเมินและสอบรับใบรับรอง (External Audit and Certification)</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n\r\nโดยเป้าหมายขององค์กรส่วนใหญ่จะทำการสร้างระบบ ISMS เพื่อการได้รับใบรับรองในขั้นตอนที่ 10 เพื่อให้เป็นที่น่าเชื่อถือของลูกค้าและ Partner โดยเมื่อองค์กรได้รับใบรับรองแล้วจะต้องมีการตรวจสอบและประเมินเป็นระยะทุกปี เพื่อยืนยันการดำเนินการที่ถูกต้องและมีการพัฒนาอย่างต่อเนื่องของระบบ ISMS\r\n\r\n&nbsp;\r\n\r\nประโยชน์ของระบบ ISMS คือทำให้องค์กรรู้จักความเสี่ยงของตนเอง เพื่อนำไปสู่การลงทุนในการปกป้องข้อมูลสารสนเทศได้อย่างมีประสิทธิภาพ\r\n\r\n&nbsp;\r\n<h3><strong>NIST Cybersecurity Framework</strong></h3>\r\n&nbsp;\r\n\r\nNational Institute of Standards and Technology (NIST) ของประเทศสหรัฐอเมริกา ประกาศแนวทางการจัดการ Cybersecurity เพื่อเป็นแนวทางให้ภาครัฐและเอกชนใช้ในการดำเนินการเกี่ยวกับการดูแลและปกป้ององค์กรจากภัยในโลกไซเบอร์เมื่อเดือนกุมภาพันธ์ 2557 ตามคำสั่งของประธานาธิบดี\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28602 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/logo-2x-1.png\" alt=\"\" width=\"578\" height=\"76\" />\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\nโครงสร้างการดำเนินการ Cybersecurity ของ NIST (NIST Cybersecurity Framework) ถูกสร้างขึ้นเพราะปัจจุบันภัยร้ายจากการถูกโจมตีบนโลกไซเบอร์ได้สร้างความเสียหายแก่เศรษฐกิจและความมั่นคงของประเทศเป็นอย่างมาก\r\n\r\n&nbsp;\r\n\r\nโดยเป้าหมายของโครงสร้างการดำเนินการดังกล่าวคือช่วยให้องค์กรเข้าใจและมีวิธีการจัดการกระบวนการปกป้องและรับมือจากภัยร้ายได้อย่างมีประสิทธิภาพ โดยโครงสร้างดังกล่าวมีองค์ประกอบหลักดังนี้\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>กลุ่มของกิจกรรมและกระบวนการขององค์กรที่จัดทำขึ้นเพื่อแยกแยะ (Identify) ปกป้อง (Protect) ตรวจสอบ (Detect)ตอบสนอง (Respond) และกอบกู้ (Recover) จากการโจมตีไซเบอร์ (Cyber Attack) หรือเรียกรวมๆ ว่า Framework Core&nbsp;</li>\r\n \t<li>ชุดของวิธีการประเมินระดับความพร้อมขององค์กรในการเตรียมการและดำเนินการปฏิบัติกิจกรรมและกระบวนการข้างต้นของ Framework Core (เรียกว่า Implementation Tiers)&nbsp;</li>\r\n \t<li>การจัดทำเป้าหมาย Profile (Target Profile) ขององค์กรและการประเมินสถานะขององค์กรในปัจจุบัน (Profile) เพื่อแยกแยะและบ่งชี้โอกาสในการพัฒนาระบบการปกป้องตนเองตามโครงสร้างความมั่นคง (Cybersecurity Framework)</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n\r\nจุดแข็งของ NIST Cybersecurity Framework เมื่อเทียบกับ ISO27001 (ISMS) คือ NIST Cybersecurity Framework มีเป้าหมายเพื่อปกป้ององค์กรจากการโจมตีซึ่งรวมไปถึงการตอบสนองและการกู้จากปัญหา\r\n\r\n&nbsp;\r\n\r\nโดยมีหลักการเน้นชุดกิจกรรมและวิธีปฏิบัติ ซึ่งต่างจาก ISMS ซึ่งเน้นที่ Policy และการป้องกันเป็นหลัก แต่ทั้งสองระบบไม่ได้มีความขัดแย้งกัน และองค์กรสามารถ Implement NIST Cybersecurity Framework เป็นส่วนหนึ่งของระบบ ISMS ได้ หรืออาจเริ่มจาก NIST Cybersecurity Framework Core แล้วเมื่อพร้อม ขยายชุดของ Control/Documentation/Audit เพื่อนำไปสู่การรับรองของ ISMS ได้เช่นกัน\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-24980 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/05/14-Ransomeware.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nการจัดการ Information Security นั้น ไม่มีวิธีใดวิธีหนึ่งหรือหลักการใดหลักการหนึ่งสามารถใช้ได้กับทุกองค์กรเพื่อแก้ทุกปัญหา (No Panacea หรือ Silver Bullet) หากแต่เป็นการจัดการให้เหมาะสมแก่คุณค่าและการลงทุนอยู่ตลอดเวลา\r\n\r\n&nbsp;\r\n\r\nโดยหลักการและมาตรฐานที่นำมากล่าวถึงในบทความนี้ทั้งสองตัวอย่างเป็นเพียงบางส่วนของมาตรฐานที่มีใช้ การจัดการ Security นั้นยังมีหลักการอื่นๆ ที่น่าสนใจและมีเป้าหมายจำเพาะอีก เช่น CSA C*STAR ซึ่งเป็นมาตรฐานการจัดการ Cloud Datacenter &amp; Service Provider เพื่อสร้างความน่าเชื่อถือของระบบ Cloud และองค์กรที่ให้บริการผ่านระบบ Cloud\r\n\r\n&nbsp;\r\n\r\nยังมีมาตรฐานอื่นๆ เช่น OWASP และ S-SDLC (Secure Software Development Life Cycle) อื่นๆ ที่มีเพื่อสร้างความน่าเชื่อถือของกระบวนการพัฒนาซอฟต์แวร์เป็นหลักอีก ซึ่งผู้เขียนจะนำมากล่าวถึงในบทความถัดๆ ไป",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "cloud-platform-infrastructure",
          "title": "Cloud Platform &amp; Infrastructure"
        },
        {
          "domain": "portfolio_category",
          "slug": "cybersecurity",
          "title": "Cybersecurity"
        },
        {
          "domain": "portfolio_category",
          "slug": "solutions",
          "title": "Solutions"
        }
      ]
    },
    {
      "title": "ปรับโฉมธุรกิจ ติดปีกดาต้าเซ็นเตอร์ด้วย Technology All Flash Array",
      "description": "การบริหารจัดการศูนย์ข้อมูลเป็นเรื่องที่ท้าทาย ต้องพยายามตอบโจทย์ความต้องการที่แตกต่างและหลากหลายจากแต่ละส่วนสายงานธุรกิจ อีกทั้งยังต้องคำนึงถึงค่าใช้จ่ายที่จะเกิดขึ้นทั้งหมด ความปลอดภัยและความต้องการในส่วนของแผนกไอทีเองอีกด้วย\r\n\r\n&nbsp;\r\n\r\nทั้งต้องทำให้ได้ตามนโยบายของผู้บริหารองค์กร ซึ่งบางคนเน้นเรื่องการควบคุมต้นทุนและเพิ่มประสิทธิภาพการทำงาน ในขณะที่ผู้บริหารอีกส่วนอาจต้องการเน้นเรื่องการรองรับการเติบโตของธุรกิจและการตอบสนองต่อความต้องการของตลาด\r\n\r\n&nbsp;\r\n\r\n<!--more-->\r\n\r\nทุกวันนี้ทีมงานดาต้าเซ็นเตอร์ส่วนใหญ่เน้นเพียงแค่พยายามให้ระบบแอพพลิเคชันทำงานได้ตามที่กำหนดพยายามหาวิธีการจัดการกับระบบการทำงานที่ซับซ้อนซึ่งก็คือการขยายเพิ่มอุปกรณ์โครงสร้างพื้นฐานไปเรื่อยๆ ค่าบำรุงรักษาก็เพิ่มขึ้นตามด้วย ทั้งนี้เพียงเพื่อให้ได้ความเร็วกับระบบแอพพลิเคชันแต่ก็มักจะมีประเด็นต่างๆ ตามมาเช่น\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>ต้องใช้พื้นที่สำหรับอุปกรณ์จัดเก็บข้อมูลสูงสุด 10 เท่า เพื่อสนับสนุนแอพพลิเคชันเพียงระบบเดียวที่ทำงานทั้ง Production และ Non-Production ตลอดอายุการใช้งาน</li>\r\n \t<li>ต้องใช้เวลานานนับชั่วโมงหรืออาจจะถึงหลายวันเพียงเพื่อให้ได้ผลวิเคราะห์สำหรับสิ่งที่คุณอยากรู้แบบทันทีหรือด่วน</li>\r\n \t<li>ต้องใช้เวลาในการพัฒนาและทดสอบที่ยาวนาน และทดสอบ ครั้งหนึ่งก็ทำได้กับข้อมูลเพียงแค่บางส่วนเท่านั้น ไม่สามารถทำกับข้อมูลทั้งหมดทุกส่วนได้</li>\r\n</ul>\r\n\r\n\r\nหากทั้งหมดข้างต้นนี้เป็นเรื่องที่คุณประสบอยู่นั่นคือระบบสตอเรจกำลังเป็นปัญหาท้าทายสำหรับธุรกิจคุณ คุณอาจจะต้องมองหาเทคโนโลยีที่สามารถจัดการได้ด้วยโซลูชันที่เกี่ยวข้องกับสตอเรจ\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16782\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/Technology_all_flash_array_1-300x176.jpg\" alt=\"\" width=\"750\" height=\"440\" />\r\n\r\n&nbsp;\r\n\r\nดังนั้นเทคโนโลยี<a href=\"http://searchsolidstatestorage.techtarget.com/definition/Flash-array\">ออลแฟลชอาเรย์</a> (All Flash Array) จะช่วยให้คุณได้ดาต้าเซอร์วิสแพลตฟอร์มที่มีพลัง คล่องตัวและตอบสนองความต้องการได้รวดเร็วอย่างเหนือชั้น\r\n\r\n&nbsp;\r\n\r\nสำหรับวงการไอทีแล้ว การออกแบบดาต้าเซ็นเตอร์ให้กับระบบแอพพลิเคชันต่างๆ เพื่อให้เกิดความคล่องตัว ความเร็วเป็นสิ่งที่ทุกองค์กรต้องการแทบทั้งสิ้นแต่เป็นเรื่องที่ไม่ง่ายเลย\r\n\r\n&nbsp;\r\n\r\nโดยเฉพาะ เมื่อคุณกำลังริเริ่มโปรเจคใหม่ๆ อย่างเช่น Private/Hybrid Cloud,Database-as-a-Service, VDI, หรือการรวม Oracle SAP และ Microsoft แอพพลิเคชันเข้าด้วยกัน เป็นต้น ซึ่งการจะได้ความรวดเร็วในสภาพแวดล้อมไอทีที่ซับซ้อนนั้นสตอเรจของคุณควรจะเป็นออลแฟลชอาเรย์ ที่มีคุณสมบัติความสามารถที่ดีเพื่อการตอบโจทย์ธุรกิจได้แท้จริง\r\n\r\n&nbsp;\r\n<h3><strong>ทำไมต้อง All Flash Storage สำหรับระบบ Application</strong></h3>\r\n&nbsp;\r\n\r\nจากการที่แทบจะทุกดาต้าเซ็นเตอร์ต้องการที่จะปรับปรุงและพัฒนาเพื่อให้สอดคล้องและตอบโจทย์ให้กับธุรกิจ ดังนั้นจึงหลีกหนีไม่พ้นที่จะต้องมีการปรับปรุงและพัฒนาฮาร์ดแวร์และอุปกรณ์ต่างๆ ภายในดาต้าเซ็นเตอร์เพื่อให้สามารถรองรับระบบแอพพลิเคชันที่มีดาต้าเบสขนาดเป็นล้านเร็คคอร์ดและการดึงข้อมูลเป็นล้านนี้ออกมาทำการวิเคราะห์\r\n\r\n&nbsp;\r\n\r\nหรือหากเราจะต้องมีระบบ Virtualization หรือ <a href=\"http://searchvirtualdesktop.techtarget.com/definition/virtual-desktop-infrastructure-VDI\">Virtual Desktop Infrastructure</a> (VDI) เราจะต้องใช้เซิร์ฟเวอร์และสตอเรจอะไร ที่จะสามารถรองรับระบบดังกล่าวได้\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28807\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/VDI-2-300x200.jpg\" alt=\"\" width=\"750\" height=\"500\" />\r\n\r\n&nbsp;\r\n\r\nทุกวันนี้ต้องบอกว่าเซิร์ฟเวอร์นั้นมีประสิทธิภาพสูงขึ้นเรื่อยๆ ซึ่งสิ่งที่พัฒนาคือ <strong>ซีพียู</strong> (CPU) และ<strong>เม็มโมรี</strong> (Memory) แต่สำหรับ<strong>ดิสก์</strong> (Disk) นั้นเรียกได้ว่าเกิดคอขวดมานานแล้วจึงเป็นที่มาของเทคโนโลยีที่เรียกกันว่าแฟลชสตอเรจ (Flash Storage)\r\n\r\n&nbsp;\r\n\r\nซึ่งคือการเอาชิพเม็มโมรีมาทำเป็นสตอเรจ มีความเร็วมากกว่าแบบเก่าเป็นหลายสิบเท่า ถ้าเรียกให้เข้าใจง่ายๆ คือ <a href=\"https://th.wikipedia.org/wiki/%E0%B9%82%E0%B8%8B%E0%B8%A5%E0%B8%B4%E0%B8%94%E0%B8%AA%E0%B9%80%E0%B8%95%E0%B8%95%E0%B9%84%E0%B8%94%E0%B8%A3%E0%B8%9F%E0%B9%8C\">โซลิดสเตจไดร์ฟ</a> (Solid State Drive) นั่นเอง แต่คำว่าแฟลชสตอเรจไปไกลกว่านั้นคือการเอา SSD มาทำให้สตอเรจหรือระบบทำงานได้ไวขึ้นอันที่จริงแล้วมีหลายระดับที่จะทำได้เพื่อให้สตอเรจนั้นทำงานได้ไวขึ้นตั้งแต่\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>การเอา SSD มาทำเป็นแคช (Cache) เพื่อให้สามารถเข้าใช้งานดาต้าที่ใช้บ่อยๆ นั้นได้ไวขึ้น</li>\r\n \t<li>การเอา SSD มาทำเป็นสตอเรจเลย หรือ ออลแฟลชสตอเรจอาเรย์ (All Flash Storage Array) แบบนี้ก็ทำให้ระบบทำงานได้ไวขึ้นไปอีกด้วยเช่นกัน</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n\r\nการทำแผงแฟลชสตอเรจเพื่อทดแทนดิสก์แล้วมีซีพียูภายในตัวมาบริหารจัดการชิพของดิสก์เพื่อให้การเขียนผ่านมีประสิทธิภาพมากขึ้น การลงทุนแบบนี้อาจจะต้องใช้งบประมาณสูงในการจัดเตรียมระบบ\r\n\r\n&nbsp;\r\n\r\nแต่ถ้าเทียบประสิทธิภาพระดับแสนถึงล้าน <a href=\"http://searchsolidstatestorage.techtarget.com/definition/IOPS-Input-Output-Operations-Per-Second\">IOPs</a> ขององค์กรมีการทำการวิเคราะห์ข้อมูลมากขึ้นแล้วมีผลทางธุรกิจ การลงทุนหลักล้านแล้วใช้ได้หลายปีนั้นก็ถือว่าไม่ได้แพงมาก เพราะผลทางธุรกิจที่ได้กลับมานั้นมากมายกว่าการลงทุนบางธุรกิจทำเงินกับการวิเคราะห์ข้อมูลได้ในระดับนาทีหนึ่งหลายแสนบาทเลยทีเดียว\r\n\r\n&nbsp;\r\n<h3><strong>เหนือกว่าด้วย XtremIO จาก EMC XtremIO – Gen 4 Storage Array:Linear Scale-out Architecture </strong></h3>\r\n<h3><strong>ทางเลือกอันดับหนึ่งในปัจจุบันที่การ์ทเนอร์ยกให้เป็นผู้นำใน Gartner’s Magic Quadrant</strong></h3>\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16783 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/Technology_all_flash_array_2.jpg\" alt=\"\" width=\"602\" height=\"373\" />\r\n\r\n&nbsp;\r\n\r\n<strong>EMC XtremIO</strong> มียอดขายเป็นอันดับหนึ่งในบรรดาเทคโนโลยี ออลแฟลชอาเรย์ (All Flash Array) และยังได้รับการจัดอันดับให้เป็น Leader ใน Gartner’s Magic Quadrant สำหรับโซลิดสเตจอาเรย์ (Solid State Arrays) 2014 อีกด้วย\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28806 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/gartners-magic-quadrant-for-solid-state-arrays-2015.jpg\" alt=\"\" width=\"608\" height=\"608\" />\r\n\r\n&nbsp;\r\n\r\n<strong>EMC XtremIO</strong> เป็นออลแฟลชอาเรย์ที่ถูกออกแบบมาให้มีสถาปัตยกรรมเทคโนโลยีที่แตกต่างอย่างเหนือชั้นจากออลแฟลชอาเรย์ยี่ห้ออื่นๆ และถือเป็นสตอเรจอาเรย์ยุค 4 (Generation 4) ที่สมบูรณ์แบบมากที่สุดในตลาด ณ ปัจจุบัน\r\n\r\n&nbsp;\r\n\r\nไม่เพียงแค่เ ร็วทีสุดแต่ยังมความเชื่อถือทีสุดในเรื่องประสิทธิภาพ และยังช่วยลดทั้ง OPEX และ CAPEX ได้สูงสุดถึง 50% และที่สำคัญคือมีสิทธิบัตรทางเทคโนโลยีเฉพาะที่ถือเป็นการปฏิวัตินวัตกรรมของสตอเรจซึ่งไม่มีในออลสตอเรจอาเรย์ยี่ห้ออื่น อันได้แก่\r\n\r\n&nbsp;\r\n\r\n<strong>XtremIO เป็นออลแฟลชอาเรย์รายเดียว</strong>ที่เป็น Linear Scale-Out Architecture โดยสามารถ Scale Out ได้หลายหน่วยควบคุมแบบ N-Way Active ควบคู่ไปกับการเพิ่มขึ้นของ IOPs แบบเส้นตรง แบนด์วิดท์ (Bandwidth) และความจุของพื้นที่ใช้งานภายใต้ Latency ที่คงที่ระดับ Sub-Millisecond\r\n\r\n&nbsp;\r\n\r\nด้วยเทคโนโลยี Intelligent Content Engine ที่ใช้กระบวนการลายพิมพ์ของข้อมูลอันช่วยให้อาเรย์ ทำงานอย่างสมดุลย์ ช่วยเพิ่มประสิทธิภาพ IOPs ได้มากถึง50% และยังเพิ่มความจุได้อีก 50% ในขณะที่ยังคงรักษาระดับการตอบสนองด้วยความรวดเร็วไม่ถึงมิลลิวินาที\r\n\r\n&nbsp;\r\n\r\n<strong>XtremIO เป็นออลแฟลชอาเรย์รายเดียว</strong>ที่สามารถทำสำเนาข้อมูลในหน่วยความจำภายใน (Copy Data Services Fully Integrated at the Storage Layer) และผสานรวมการทำงานเป็นหนึ่งเดียวได้ทั้งหมดอย่างดีในระดับสตอเรจช่วยให้บริหารจัดการทั้งส่วน Production และ Non-Productionได้อย่างมีประสิทธิภาพบนอาเรย์เดียว\r\n\r\n&nbsp;\r\n\r\nลดค่าใช้จ่ายได้อย่างเหลือเชื่อ ช่วยให้ทั้งทีมแอพพลิเคชันและทีมอินฟราสตรัคเจอร์ทำงานได้ง่ายขึ้น บริหารจัดการได้ดีขึ้น ใช้เวลาน้อยลง ทำให้มีเวลาไปสร้างสรรค์ผลงานหรือโปรเจคใหม่ๆ ได้อย่างไร้กังวล\r\n\r\n&nbsp;\r\n\r\n<strong>Inline, Always-on Data Services XtremIO</strong> ใช้หลักการของ In-Memory Computing ในระดับของอุปกรณ์จัดเก็บข้อมูล ดังนั้นการทำ Thin Provisioning, Deduplication,Compression, Data Protection, Encryption และ Copy Service จึงเกิดขึ้น ณ เวลาจริงในทุกๆ ขณะโดยที่ไม่มีผลกระทบต่อประสิทธิภาพการทำงาน\r\n\r\n&nbsp;\r\n\r\nซึ่งเหล่านี้มีเพียงเอกลักษณ์ด้านสถาปัตยกรรมแบบ In-Memory Metadata เท่านั้นและด้วยเทคโนโลยบีบอัดข้อมลู แบบ 100% อินไลน์ทั้งหมด ทำให้สามารถจัดเก็บข้อมูลได้อย่างมหาศาล และรองรับแอพพลิเคชันดาต้าได้หลายเพตะไบต์อีกด้วย\r\n\r\n&nbsp;\r\n<h3><strong>คุณสมบัติทั้ง 5 ประการของ All Flash Array ที่ต้องพิจารณาก่อนนำไปใช้งานในระดับองค์กร</strong></h3>\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-18979 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/Tech_review_Flasg_array.jpeg\" alt=\"\" width=\"900\" height=\"315\" />\r\n\r\n&nbsp;\r\n\r\nเทคโนโลยี All Flash Array หรือ SAN สตอเรจที่ถูกออกแบบมาโดยเฉพาะสำหรับการใช้งาน SSD ล้วนๆ ถือเป็นอีกทางเลือกที่น่าสนใจสำหรับองค์กรในทุกวันนี้ด้วยประสิทธิภาพการทำงานที่รวดเร็วจน สตอเรจไม่กลายเป็นคอขวดของระบบงานขนาดใหญ่อีกต่อไป และรองรับการนำไปใช้งานที่หลากหลาย ดังนั้น ถ้าหากองค์กรใดต้องการเลือกซื้อ All Flash Array การพิจารณาประเด็นต่างๆ เหล่านี้ถือเป็นสิ่งสำคัญ\r\n\r\n&nbsp;\r\n\r\n<strong>All Flash Array ควรมีระบบ Data Protection ที่ออกแบบมาสำหรับ SSD โดยเฉพาะ</strong>\r\n\r\nเนื่องจาก SSD เป็นเทคโนโลยีที่มีพื้นฐานต่างจาก HDD โดยสิ้นเชิงดังนั้น วิธีการรักษาข้อมูลให้มีความทนทานด้วยเทคโนโลยี RAID ทีสามารถใชง้ านกบั HDD ได้จึงไม่สามารถนำมาใชกั้บ SSD ได้อย่างมีประสิทธิภาพ\r\n\r\n&nbsp;\r\n\r\nซึ่ง All Flash Array ที่ดีมักจะมีวิธีการในการรักษาข้อมูลให้มีความทนทานด้วยการใช้ SSD หลายๆ ลูกโดยมีการคำนึงถึงอายุการใช้งานของ SSD ไปพร้อมๆ กัน ไม่เช่นนั้นการใช้งาน SSD + RAID ก็อาจทำให้ RAID Volume พังเพราะ SSD หมดอายุการใช้งานพร้อมๆ กันทีละหลายๆ ลูกก็เป็นได้\r\n\r\n&nbsp;\r\n\r\n<strong>All Flash Array จะต้องมีวิธีการในการใช้งานข้อมูลต่างๆ ที่จัดเก็บอยู่บน SSD อย่างคุ้มค่า</strong>\r\n\r\nโดยทั่วไปในราคาที่เท่ากัน ถึงแม้ SSD จะมีความเร็วสูงกว่า HDD หลายเท่าแต่ความจุของ SSD ก็น้อยกว่า HDD หลายเท่าตัวเช่นกัน อีกทั้งอายุการใช้งานของ SSD ยังมีจำกัดจำนวนครั้งในการเขียนอีกด้วย\r\n\r\n&nbsp;\r\n\r\nดังนั้น All Flash Array ที่ดีจึงควรจะต้องมีความสามารถที่ช่วยทั้งยืดอายุการใช้งานของ SSD ไปพร้อมๆกับการลดพื้นที่การใช้งานบน SSD ไปด้วยในตัว ไม่ว่าจะเป็นการ Deduplication หรือ Compression แบบอินไลน์ก่อนมีการเขียนข้อมูลลง SSD ก็ตาม\r\n\r\n&nbsp;\r\n\r\n<strong>ตรวจสอบผลการทดสอบทางด้านประสิทธิภาพของ All Flash Array ที่เปิดใช้งาน Feature ทั้งหมด</strong>\r\n\r\nเพราะ SSD มีอายุการใช้งานที่จำกัด ดังนั้น All Flash Array จึงมักจะมาพร้อมกับความสามารถในการยืดอายุการใช้งานให้ SSD เช่น การทำ Deduplication หรือการทำ Compression รวมถึงการตั้งค่า Block Size ขนาดต่างๆ\r\n\r\n&nbsp;\r\n\r\nแต่ผลการรายงานทางด้านประสิทธิภาพของ All Flash Array มักจะไม่ได้เปิดใช้งาน Feature ต่างๆ เหล่านี้อย่างเต็มที่ ทำให้เรามักจะได้เห็น All Flash Array ที่มีค่า IOPs หลายแสนหรือหลายล้าน IOPs ต่อวินาทีแต่เมื่อใช้งานจริงแล้วประสิทธิภาพก็ไม่ถึงตามที่ต้องการ หรืออาจมี Performance Spike เกิดขึ้นเป็นระยะๆ ระหว่างการใช้งานจริงได้เช่นกัน\r\n\r\n&nbsp;\r\n\r\n<strong>All Flash Array จะต้องสามารถใช้งานได้กับ แอพพลิเคชันและอินฟราสตรัคเจอร์ที่หลากหลาย</strong>\r\n\r\nเพื่อเป็นการใช้ประโยชน์ระบบ All Flash Array ที่มีราคาสูงให้คุ้มค่าสูงสุด All Flash Array ควรจะต้องสามารถทำงานร่วมกับแอพพลิเคชันและอินฟราสตรัคเจอร์ที่หลากหลายภายในองค์กรได้ ไม่ว่าจะเป็นการทำงานร่วมกับ Hypervisor ได้หลายยี่ห้อ การทำงานร่วมกับระบบปฏิบัติการได้หลายยี่ห้อ การจัดเก็บข้อมูลของดาต้าเบสได้หลายยี่ห้อ\r\n\r\n&nbsp;\r\n\r\nโดยรองรับการทำ Backup และ Recovery ได้ถึงระดับแอพพลิเคชัน และสามารถรองรับ Workload ของ Application ทุกประเภทพร้อมๆ กันได้โดยไม่ต้องทำการปรับแต่งค่าการใช้งานของ All Flash Array ให้ซับซ้อน\r\n\r\n&nbsp;\r\n\r\n<strong>All Flash Array ไม่ใช่ SAN สตอเรจทั่วๆ ไปที่ใส่ SSD แทน HDD</strong>\r\n\r\nหลายๆ ผู้ผลิตพยายามเข้ามายังตลาดของ All Flash Array โดยใช้ SAN สตอเรจและเทคโนโลยีแบบเดิมๆ ที่ติดตั้ง SSD แทนHDD ทั้งหมดทำให้ผลการทดสอบทางด้านประสิทธิภาพสูงขึ้น\r\n\r\n&nbsp;\r\n\r\nแต่การใช้งานจริงจะมีปัญหาต่างๆ เช่น SSD หมดอายุการใช้งานเร็ว มีความเสี่ยงที่ SSD RAID Group จะพังพร้อมๆ กัน พื้นที่การใช้งานมีน้อย การปรับแต่งประสิทธิภาพให้เข้ากับแต่ละแอพพลิเคชันทำได้ยาก เกิดปัญหาทางด้าน Performance กับแอพพลิเคชันบางประเภท และอื่นๆ อีกมากมายที่ผู้ดูแลระบบคาดไม่ถึง\r\n\r\n&nbsp;\r\n\r\nเพราะ All Flash Array และ SSD เป็นเทคโนโลยีที่ค่อนข้างใหม่ ดังนั้นการตรวจสอบย้อนหลังเพื่อดูว่า All Flash Array ที่ผู้ขายพยายามนำเสนอ เป็น All Flash Array จริงๆ หรือเป็น SAN สตอเรจแบบเดิมๆ ที่ใส่ SSD เพื่อทำงานแบบ Hybrid Array ได้ก็ถือเป็นประเด็นที่ค่อนข้างสำคัญเช่นกัน",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "data-center-transformation",
          "title": "Data Center Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "enterprise-business",
          "title": "Enterprise Business"
        },
        {
          "domain": "portfolio_category",
          "slug": "microsoft-solutions",
          "title": "Microsoft Solutions"
        },
        {
          "domain": "portfolio_category",
          "slug": "oracle-solutions",
          "title": "Oracle Solutions"
        },
        {
          "domain": "portfolio_category",
          "slug": "solutions",
          "title": "Solutions"
        },
        {
          "domain": "portfolio_category",
          "slug": "thinking",
          "title": "Thinking"
        }
      ]
    },
    {
      "title": "Center Of Excellence ตอบโจทย์เทคโนโลยีและบริการ",
      "description": "คำถามบ่อยๆ ที่หลายคนสงสัยเสมอคือ เราจะรู้ได้อย่างไรว่า Product และ Solution ต่างๆ ที่สนใจอยู่นั้นมีลักษณะการทำงานเป็นอย่างไร สามารถตอบโจทย์ปัญหาที่กำลังเผชิญอยู่ได้จริงหรือไม่ แน่นอนว่าเพียงแค่การฟัง Production Presentation หรืออ่านจากเอกสาร คงจะไม่เพียงพออย่างแน่นอนโดยเฉพาะอย่างยิ่งที่ลักษณะของ Product และ Solution ต่างๆ ในปัจจุบันที่มีความซับซ้อนและความสามารถมากขึ้น\r\n\r\n<!--more-->\r\n\r\nหน่วยงาน Center of Excellence (COE) ถูกจัดตั้งขึ้นโดยกำหนดเป้าหมายเพื่อช่วยส่งเสริมให้มีความเข้าใจใน Technology และ Solution ต่างๆ ของ Oracle เพื่อให้องค์กรที่สนใจสามารถเลือกนำไปใช้งานได้อย่างเหมาะสมกับความต้องการ\r\n\r\n&nbsp;\r\n\r\nสำหรับประโยชน์ที่จะได้รับนั่นคือ กลุ่มลูกค้ามั่นใจได้ถึงประโยชน์ของ Oracle Technology ที่จะมีต่อการดำเนินธุรกิจโดยเจ้าหน้าที่ที่เชี่ยวชาญหากมีการนำไปใช้งานโดยผ่านการทำ Demo และ POC (Proof of Concept) เข้าถึงและได้ใช้ประโยชน์จากความสามารถของ Oracle ในการจัดตั้งและพัฒนาระบบงาน\r\n\r\n&nbsp;\r\n\r\nลดความเสี่ยง และเวลาที่ใช้ในการจัดตั้งและพัฒนาระบบงานรวมถึงการ มี Best Practice และข้อมูลอ้างอิงสำหรับการนำ Oracle Technology ไปใช้งานในแต่ละกลุ่มธุรกิจ ทั้งนี้ลูกค้าที่สนใจสามารถเข้ามาเยี่ยมชม Solution ได้โดยติดต่อผ่านฝ่ายขาย หรือฝ่ายการตลาด หรือ Call Center ของจีเอเบิลโดยภาระกิจหลักๆ ที่หน่วยงาน COE ให้บริการอยู่ก็คือ\r\n<ul>\r\n \t<li>Demo Product/Solution</li>\r\n \t<li>Customize Solution to Meet Customer Requirement</li>\r\n \t<li>POC on Solution Customer Required</li>\r\n</ul>\r\nซึ่งหัวข้อ Solution ที่น่าสนใจที่ COE จัดทำและให้บริการอยู่นั้นมีอยู่หลากหลาย อาทิเช่น\r\n\r\n&nbsp;\r\n\r\n<strong>Exadata</strong>\r\n\r\nDatabase Server แบบ High Performance องค์กรใดมีระบบ Database ที่ทำงานช้า ทำงานเสร็จไม่ทันตามเวลาที่ต้องการ สามารถมาทดสอบความเร็วของ Exadata ดูได้\r\n\r\n&nbsp;\r\n\r\n<strong>In-Memory Computing</strong>\r\n\r\nการเพิ่มความเร็วให้กับระบบ Database โดยใช้รูปแบบการทำงานแบบ In-Memory เพื่อเพิ่มความเร็วให้กับงาน Reporting, Analytics รวมทั้ง Transaction\r\n\r\n<img class=\"size-full wp-image-16802 aligncenter\" src=\"https://www.g-able.com/wp-content/uploads/2017/02/COE_1.jpg\" alt=\"\" width=\"249\" height=\"199\" /><img class=\"size-full wp-image-16803 aligncenter\" src=\"https://www.g-able.com/wp-content/uploads/2017/02/COE_2.jpg\" alt=\"\" width=\"249\" height=\"199\" />\r\n\r\n<strong>Multitenant</strong>\r\n\r\nการจัดการ Database จำนวนมากๆ พร้อมๆ กัน ไม่ว่าจะเป็น Patch, Upgrade, Backup การเคลื่อนย้าย Database ได้โดยง่าย การเพิ่ม Utilization ให้กับ Database Server\r\n\r\n<img class=\"size-medium wp-image-16804 aligncenter\" src=\"https://www.g-able.com/wp-content/uploads/2017/02/COE_3-300x196.jpg\" alt=\"\" width=\"300\" height=\"196\" />\r\n\r\n<strong>Disaster Recovery</strong>\r\n\r\nทดสอบการทำ DR สำหรับระบบต่างๆ ในรูปแบบที่แตกต่างกันไปของแต่ละองค์กร ไม่ว่าจะเป็นในส่วนของ DB หรือ Application Server\r\n\r\n&nbsp;\r\n\r\n<strong>Database Replication</strong>\r\n\r\nการทำ Database Replication ในลักษณะที่หลากหลายไม่ว่าจะเป็นแบบ Active-Standby เพื่อตอบสนองในการทำ DR แบบActive-Active (Read Only) เพื่อช่วยลดงานประเภท Reporting จากระบบ Production ไปไว้กับระบบ DR แทน การ Replicate ระหว่าง Server Platform ที่แตกต่างกัน การ Replicate แบบ Active-Active ที่สามารถทำการ Read/Write Database ได้ทั้ง 2 ข้างพร้อมๆ กันเพื่อสนับสนุนการทำงานแบบ Parallel Site\r\n\r\n&nbsp;\r\n\r\n<strong>WebCenter Portal</strong>\r\n\r\nระบบ Web Platform ที่ช่วยให้องค์กรสามารถสร้างระบบ Intranet, Extranet และ Portal ได้อย่างสะดวกรวดเร็ว โดยที่ระบบจะมีความสามารถต่างๆ เพิ่มเติมมากมายเช่น Role-Based และ Social Service ต่างๆ (Wiki, Facebook, Blog,Discussion Group)\r\n\r\n&nbsp;\r\n\r\n<strong>Enterprise Manager</strong>\r\n\r\nการดูแลจัดการส่วนประกอบต่างๆ ของระบบงานตั้งแต่ระดับของ Server, Storage, OS, Virtualize, Database, Middleware ไปจนถึง Application ด้วย Single Tool, Single Theme ทำให้สะดวกกับผู้ดูแลระบบงานที่ไม่จำเป็นต้องใช้หรือเรียนรู้ Tool ที่หลากหลาย และยังทำให้สามารถเรียกดูข้อมูลในแต่ละ Layer ได้สะดวกเพื่อตรวจสอบการทำงานของระบบได้โดยง่ายด้วย\r\n\r\n<img class=\"size-medium wp-image-16805 aligncenter\" src=\"https://www.g-able.com/wp-content/uploads/2017/02/COE_4-300x221.jpg\" alt=\"\" width=\"300\" height=\"221\" />\r\n\r\n<strong>Mobile Security Management</strong>\r\n\r\nการใช้ Application ต่างๆ ขององค์กรผ่านทางอุปกรณ์ Mobile หรือ BYOD ต่างๆ โดยที่ยังคงต้องการเรื่องความปลอดภัยไม่ว่าจะเป็นการ Lock Down อุปกรณ์ ในกรณีที่ Mobile หายหรือถูกขโมยหรือจะเป็นในเรื่องการแบ่ง Mobile ออกเป็น Containerเพื่อแยกการใช้ในเรื่องงาน และ Container ที่ใช้สำหรับเรื่องส่วนตัวแยกออกจากกันเพื่อให้มีความสะดวกในการใช้งานส่วนตัวและยังคงมีความปลอดภัยสำหรับระบบงานขององค์กร\r\n\r\n&nbsp;\r\n\r\n<strong>SOA/Service Bus</strong>\r\n\r\nการจัดการการเชื่อมต่อกันระหว่างระบบต่างๆ ที่ใช้เทคโนโลยีแตกต่างกันไป เพื่อให้สามารถแลกเปลี่ยนข้อมูล รวมถึงขอใช้บริการกับระบบงานอื่นๆ ได้อย่างมีประสิทธิภาพ\r\n\r\n<img class=\"size-medium wp-image-16806 aligncenter\" src=\"https://www.g-able.com/wp-content/uploads/2017/02/COE_5-300x171.jpg\" alt=\"\" width=\"300\" height=\"171\" />\r\n\r\n<strong>BPM</strong>\r\n\r\nการสร้าง Work-Flow จากระบบงานต่างๆ ที่มีอยู่ในองค์กรให้ทำงานได้อย่างรวดเร็วและมีประสิทธิภาพ\r\n\r\n<img class=\"size-medium wp-image-16807 aligncenter\" src=\"https://www.g-able.com/wp-content/uploads/2017/02/COE_6-300x173.jpg\" alt=\"\" width=\"300\" height=\"173\" />\r\n\r\nทั้งหมดนี้สามารถสาธิตและสร้างความมั่นใจให้กับผู้สนใจ ได้เห็นถึงประโยชน์ของ Oracle Technology ที่จะมีต่อการดำเนินธุรกิจโดยเจ้าหน้าที่ที่เชี่ยวชาญ หากมีการนำไปใช้งานโดยผ่านการทำ Demo และ POC (Proof of Concept) เข้าถึงและได้ใช้ประโยชน์จากความสามารถของ Oracle ในการจัดตั้งและพัฒนาระบบงาน ลดความเสี่ยง และเวลาที่ใช้ในการจัดตั้งและพัฒนาระบบงาน รวมถึงการมี Best Practice และข้อมูลอ้างอิงสำหรับการนำ Oracle Technology ไปใช้งานในแต่ละกลุ่มธุรกิจ องค์กรใดที่สนใจสามารถเข้ามาเยี่ยมชม Solution ได้โดยติดต่อผ่านฝ่ายขายหรือฝ่ายการตลาด หรือ Call Center กลุ่มบริษัทจีเอเบิล\r\n\r\n&nbsp;",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "data-center-transformation",
          "title": "Data Center Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "digital-marketing",
          "title": "Digital Marketing"
        },
        {
          "domain": "portfolio_category",
          "slug": "digital-transformation",
          "title": "Digital Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "enterprise-business",
          "title": "Enterprise Business"
        },
        {
          "domain": "portfolio_category",
          "slug": "enterprise-communication",
          "title": "Enterprise Communication"
        },
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        },
        {
          "domain": "portfolio_category",
          "slug": "iot-internet-of-things",
          "title": "IoT (Internet of Things)"
        },
        {
          "domain": "portfolio_category",
          "slug": "oracle-solutions",
          "title": "Oracle Solutions"
        },
        {
          "domain": "portfolio_category",
          "slug": "solutions",
          "title": "Solutions"
        },
        {
          "domain": "portfolio_category",
          "slug": "thailand-4-0",
          "title": "Thailand 4.0"
        },
        {
          "domain": "portfolio_category",
          "slug": "thinking",
          "title": "Thinking"
        }
      ]
    },
    {
      "title": "SPARC M7 Processor นวัตกรรมใหม่จากออราเคิล โดดเด่นที่ Software in Silicon",
      "description": "<strong>SPARC M7 Processor</strong> นวัตกรรมด้านโปรเซสเซอร์ออกใหม่ของ <a href=\"https://www.oracle.com/index.html\">Oracle </a>ชิ้นนี้ มีคุณลักษณะที่น่าสนใจอยู่หลายประการไม่ว่าจะเป็นทางด้านฮาร์ดแวร์และซอฟต์แวร์ ต่างมีความโดดเด่นมาก ในช่วงเวลานี้ เนื่องจากสามารถตอบสนองต่อความต้องการของการใช้งานทางด้าน Multicore และ Multithread ได้มากขึ้น<!--more-->\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16821 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/Sparc_m7_1.jpg\" alt=\"\" width=\"876\" height=\"587\" />\r\n\r\n&nbsp;\r\n\r\nนอกเหนือจากความเร็วที่สูงขึ้นแล้ว SPARCM7 Processor ยังมีคุณสมบัติด้านอื่นๆ ที่โดดเด่น อาทิ ความสามารถของ Software in Silicon ที่มาพร้อมระบบรักษาความปลอดภัยข้อมูล, การจัดการฐานข้อมูล และการเพิ่มความเร็วให้กับ Java Application\r\n\r\n&nbsp;\r\n\r\nซึ่งคุณสมบัติต่างๆ เหล่านี้เป็นพื้นฐานโครงสร้างระบบการทำงานที่สำคัญทางด้านความปลอดภัย ตลอดจนการเพิ่มประสิทธิภาพ และศักยภาพของการทำงาน\r\n\r\n&nbsp;\r\n\r\nโดยความสามารถของ Software in Silicon ในการทำงานร่วมกับนวัตกรรม Cache และเทคโนโลยี Memory ของ SPARC M7 Processor นั้น ได้ปฏิวัติระบบป้องกันการทำงานที่ผิดปกติซึ่งอาจเกิดจาก Malware และ\r\n\r\n&nbsp;\r\n\r\nซอฟต์แวร์ที่ทำงานร่วมกัน จึงทำให้การทำงานมีประสิทธิภาพทั้งทางด้าน Throughput Performance, Single Thread Performance, Encryption Bandwidth รวมไปถึง Security in Silicon ที่ประกอบไปด้วยการทำงานของ\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>Silicon Secured Memory</li>\r\n \t<li>The In-Line Data Decompression</li>\r\n \t<li>SQL in Silicon (In-Memory Acceleration)</li>\r\n \t<li>Accelerated Cryptography (Encryption Acceleration)</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n\r\nศักยภาพของ SPARC M7 Processor ที่กล่าวมาเบื้องต้น เป็นการทำงานร่วมกันเป็นอย่างดีกับซอฟต์แวร์ของออราเคิล (Oracle Database, Java Application และ Oracle WebLogic) และระบบปฏิบัติการ Oracle Solaris\r\n\r\n&nbsp;\r\n\r\nซึ่งก่อให้เกิดระบบงานที่มีความปลอดภัย คุ้มค่าต่อการลงทุน รวมไปถึงเพิ่มประสิทธิภาพของการทำงานได้อย่างดีเยี่ยม ตามที่ออราเคิล กล่าวไว้ คือ Hardware and Software Engineered Together\r\n\r\n&nbsp;\r\n\r\nออราเคิลได้นำเสนอเทคโนโลยี SPARC M7 Processor ติดตั้งอยู่บนเครื่องรุ่นต่างๆ ซึ่งเป็น CPU ตระกูลเดียวกันทุกรุ่น ดังต่อไปนี้\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>Oracle SPARC T7-1</li>\r\n \t<li>Oracle SPARC T7-2</li>\r\n \t<li>Oracle SPARC T7-4</li>\r\n \t<li>Oracle SPARC M7-8</li>\r\n \t<li>Oracle SPARC M7-16</li>\r\n \t<li>Oracle SuperCluster M7</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16822 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/Sparc_m7_2.jpg\" alt=\"\" width=\"907\" height=\"508\" />\r\n\r\n&nbsp;\r\n<h3><strong>Silicon Secured Memory</strong></h3>\r\nสำหรับ Silicon Secured Memory ที่มาพร้อมกับ SPARC M7 Processor จะทำการตรวจสอบและรายงานผลการทำงานของ Memory ที่มีการทำงานผิดพลาด ทำให้โปรแกรมนั้นหยุดการทำงาน หรือการเกิดกรณี แอพพลิเคชั่นเข้าถึงข้อมูลที่อยู่ใน Memory โดยไม่ได้รับอนุญาต ซึ่งรูปแบบของภาษาโปรแกรม เช่น ภาษา C, C++ ที่มีช่องโหว่ทำให้ Memory มีการอ้างการทำงานผิดพลาดของซอฟต์แวร์\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16824 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/Sparc_m7_4.jpg\" alt=\"\" width=\"532\" height=\"391\" />\r\n\r\n&nbsp;\r\n\r\nโดยปกติแล้วสาเหตุของปัญหาด้านการทำงานผิดพลาดเกี่ยวกับการอ้างถึงข้อมูลที่อยู่ใน Memory นั้นมักจะล่าช้า ซึ่งความซับซ้อนของฐานข้อมูลและการพัฒนาโปรแกรมที่มีผู้พัฒนาโปรแกรมหลากหลาย และมีปริมาณของจำนวนโปรแกรมอยู่หลายบรรทัด จะมีผลทำให้เกิดความเสี่ยงได้ เช่น เรื่อง Buffer Overflow อาจเป็นสาเหตุทำให้องค์กรเกิดความเสี่ยง เป็นต้น\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16823 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/Sparc_m7_3.jpg\" alt=\"\" width=\"530\" height=\"395\" />\r\n\r\n&nbsp;\r\n\r\nปัจจุบันโปรแกรมประยุกต์มีการใช้งานหลากหลาย Threads ที่ใช้งานบน Memory ร่วมกัน ซึ่งมีโอกาสเกิดข้อผิดพลาดหรือมีการอ้างถึงข้อมูลใน Memory ผิดตำแหน่งได้ เนื่องจากมีการใช้งานแบบสุ่ม ซึ่งจะใช้เวลาในการแก้ไขปัญหา เช่น ข้อผิดพลาดของข้อมูลที่ไม่สามารถหาสาเหตุได้ และการใช้งาน Memory แล้วเกิด Buffer Overrun ที่ทำให้แก้ปัญหาได้ยาก\r\n\r\n&nbsp;\r\n\r\nซึ่งกรณีดังกล่าว Silicon Secured Memory จะช่วยลดเวลาในการแก้ไขปัญหาของ Memory ในการอ้างถึงข้อมูลได้\r\n\r\n&nbsp;\r\n\r\nผลของความเสี่ยงที่เกิดจากการเข้าถึงข้อมูลใน Memory คือ <a href=\"http://heartbleed.com/\">Heartbleed Bug</a> ที่เกิดจาก Buffer Over-Read Attack คือข้อมูลที่อยู่ใน Memory และถูกโจมตีเข้าถึงข้อมูลใน Memory เพื่อดู User/Password หรือหมายเลขบัตรที่มีการใช้บริการซึ่งก่อให้เกิดความเสียหายได้\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16825 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/Sparc_m7_5.jpg\" alt=\"\" width=\"1002\" height=\"563\" />\r\n\r\n&nbsp;\r\n\r\nหากผู้โจมตีได้ข้อมูลเหล่านี้ไป และ <a href=\"http://venom.crowdstrike.com/\">Venom</a> ที่เกิดจาก Buffer Over-Write Attack เป็นการโจมตีในส่วนของ Virtualizationเพื่อหาข้อมูล Account ที่อยู่ใน Guest OS โดยผ่านทาง Virtual FDC (Floppy Disk Controller) และเข้าถึง Hypervisor ของ Host Server และสามารถเข้าถึงผ่านระบบเน็ตเวิร์คต่อไปได้\r\n\r\n&nbsp;\r\n<h3><strong>SQL in Silicon: In-Memory Query Acceleration</strong></h3>\r\n&nbsp;\r\n\r\nIn-Memory Query Acceleration ได้ถูกออกแบบมาเพื่อการใช้งานคู่กับ Oracle Database In-Memory ซึ่งเป็นสถาปัตยกรรมของการวิเคราะห์ข้อมูลโดยใช้ได้ทั้งแบบ Row Format สำหรับงาน OLTP Operations และ Column Format สำหรับงาน Analytics Operations\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16827 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/Sparc_m7_7.jpg\" alt=\"\" width=\"708\" height=\"605\" />\r\n\r\n&nbsp;\r\n\r\nรูปแบบการทำงานของ Core SPARC M7 มีการรับ Database Query ที่สามารถนำไปใช้งานบน On-Chip Accelerator โดยรูปแบบงานของ Accelerated Database Operations มีการทำงานดังต่อไปนี้\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>Select: Filter to Reduce a Column</li>\r\n \t<li>Scan: Search (“Where” Clause)</li>\r\n \t<li>Extract: Decompression</li>\r\n \t<li>Translate: Lookup to Accelerate Big-to-Small Joins</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n\r\nจากการที่นำ Query ไปทำงานบน On-Chip Accelerator ทำให้ Processor Core มีความสามารถในการทำงานต่างๆ ต่อได้ ในส่วนของผลลัพธ์จากการใช้งาน On-Chip Acceleratorที่ทำการเชื่อมต่อตรงไปยัง Memory Cache และส่งต่อไปยัง Processor Core ส่งผลให้ข้อมูลที่อยู่ใน In-Memory ทำงานได้อย่างรวดเร็วขึ้นถึง 83 เท่าเมื่อเทียบกับการใช้ Flash Disk\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16826 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/Sparc_m7_6.jpg\" alt=\"\" width=\"774\" height=\"363\" />\r\n\r\n&nbsp;\r\n<h3><strong>In-Line Data Decompression</strong></h3>\r\n&nbsp;\r\n\r\nคุณสมบัติของ In-Line Data Decompression ที่อยู่บน SPARC M7 Processor เป็นการใช้งานของ Data Analytics Accelerators (DAX) ในการใช้งาน Query Process โดย In-Line Decompress สามารถใช้งานในความเร็วของ Memory ได้ถึง 120 GB ต่อวินาที ซึ่งรูปแบบการทำงานของ Decompression มีดังนี้\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>Processor Core นำงานของ Query ไปอยู่บน Accelerator เพื่อทำการอ่านข้อมูลที่เข้ารหัส (OZIP Compression)</li>\r\n \t<li>Accelerator ทำการถอดรหัสพร้อมกับทำการ Query ทันทีโดยไม่ต้องมีการอ่านหรือเขียน</li>\r\n \t<li>Processor Core มีการส่งข้อมูลออกในรูปแบบข้อมูลไม่มีการเข้ารหัส</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n<h3><strong>Encryption Acceleration</strong></h3>\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16828 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/Sparc_m7_8.jpg\" alt=\"\" width=\"770\" height=\"388\" />\r\n\r\n&nbsp;\r\n\r\nออราเคิลมีการพัฒนาโปรเซสเซอร์ให้ทำงานร่วมกับ Cryptographic Accelerator โดยได้นำเสนอ Oracle SPARC M7 ที่มีจำนวนProcessor Core ถึง 32 Cores ต่อโปรเซสเซอร์และมีการทำงานร่วมกับ Cryptographic Cypher Hardware ที่รองรับ Algorithms จำนวน 15 แบบ ดังนี้\r\n\r\n&nbsp;\r\n\r\nAES, Camellia, CRC32c, DES, 3DES, DH, DSA, ECC, MD5, RSA, SHA-1, SHA-224, SHA-256, SHA-384, และ SHA-512\r\n\r\n&nbsp;\r\n\r\nโดยการทำงานสามารถนำไปสนับสนุน Oracle Database และใน Oracle Stack เพื่อให้มีการรักษาข้อมูลให้มีความปลอดภัย และไม่มีผลกระทบต่อประสิทธิภาพการทำงาน\r\n\r\n&nbsp;\r\n\r\nจากที่กล่าวมา Software in Silicon ที่มาพร้อมกับ Oracle SPARC M7 ถือว่าเป็นนวัตกรรมใหม่ที่เพิ่มศักยภาพของเครื่องรุ่นใหม่ (SPARC T7 และ SPARC M7) พร้อมกับจำนวนของ Processor Core ที่มีเพิ่มขึ้นเป็น 2 เท่าเมื่อเทียบกับ Oracle SPARC T5",
      "category": []
    },
    {
      "title": "G-ABLE ปักหมุดมุ่งสู่ตลาดอาเซียน กำหนดทิศทางใหม่ “บริการคือสินค้า”",
      "description": "<img class=\"alignnone wp-image-16948 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/G-ABLEปักหมุด_1-e1488963637138.jpg\" alt=\"\" width=\"900\" height=\"540\" />\r\n\r\nคุณสุเทพ อุ่นเมตตาจิต  | กรรมการผู้จัดการกลุ่มบริษัทจีเอเบิล\r\n\r\n&nbsp;\r\n\r\nจากพันธกิจ “<strong>Transform Business to Digital Economy</strong>” ของกลุ่มบริษัทจีเอเบิล (<strong>G-ABLE</strong>) ที่มุ่งเน้นขับเคลื่อนธุรกิจตามการเปลี่ยนแปลงของโลกที่เกิดขึ้น ซึ่งอยู่ระหว่างการเปลี่ยนผ่านทุกสิ่งไปสู่ดิจิทัล\r\n\r\n&nbsp;\r\n\r\nจีเอเบิลในฐานะผู้ให้บริการด้านไอทีอันดับต้นๆ ของประเทศไทยได้ทำการปรับกระบวนทัศน์ใหม่ โดยการเป็นมากกว่าพันธมิตรของลูกค้า หากแต่มองทะลุไปถึงผลรับปลายทาง คือ ประโยชน์ที่จะเกิดขึ้นกับลูกค้าของลูกค้า\r\n\r\n&nbsp;\r\n\r\nดังนั้นบทบาทของจีเอเบิล จากนี้ไปคือ IT Brands for Life and Business ด้วยการให้บริการโซลูชั่นที่จะเข้ามายกระดับการใช้ชีวิตประจำวันของผู้คน และการดำเนินธุรกิจ ให้ดียิ่งขึ้น ก้าวสู่โลกดิจิทัลมากขึ้น\r\n\r\n&nbsp;\r\n\r\nคุณสุเทพ อุ่นเมตตาจิต กรรมการผู้จัดการ กลุ่มบริษัทจีเอเบิลให้สัมภาษณ์กับ G-Magz ต่อพันธกิจขององค์กรที่ต้องปรับยุทธศาสตร์การดำเนินธุรกิจเพื่อให้เติบโตต่อไปอย่างมั่นคงและยั่งยืน ครองความเป็นผู้นำในระดับประเทศ และเตรียมตัวขยายธุรกิจไปในระดับอาเซียน\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n\r\nสำหรับแนวทางในการขับเคลื่อนนั้น คุณสุเทพ กล่าวว่ามีองค์ประกอบหลักอยู่ 3 ด้าน คือ <strong>People</strong>, <strong>Practice</strong> และ <strong>Partnership</strong>\r\n\r\n&nbsp;\r\n\r\nโดยเน้นการพัฒนาศักยภาพบุคลากร เติมเต็มความรู้ความเชี่ยวชาญ และมุมมองใหม่ๆ และสร้างความร่วมมือกับพาร์ทเนอร์เพื่อเพิ่มขีดความสามารถด้านการแข่งขัน ซึ่งหากทั้ง 3 ด้านทำได้ดีจะผลักดันให้เกิดแผนงานที่ดี ซึ่งจะนำไปสู่การขยายตลาดต่อไป\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n<h2>“วงแหวนพันธมิตร” หนุนยุทธศาสตร์</h2>\r\n&nbsp;\r\n\r\nจากแนวทางในการขับเคลื่อนทั้ง 3 ด้านดังกล่าว จีเอเบิลเดินเครื่องยุทธศาสตร์เพื่อก้าวสู่อนาคตอย่างมั่นคงด้วย “วงแหวนพันธมิตร”\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-16949 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/G-ABLEปักหมุด_2.jpg\" alt=\"\" width=\"706\" height=\"677\" />\r\n\r\n&nbsp;\r\n\r\nซึ่งประกอบด้วย 6 ด้าน เป็นวงแหวนเดียวกัน คือ <strong>G-ABLE</strong>, <strong>Supplier</strong>, <strong>Customer</strong>, <strong>R&amp;D</strong> (ภาควิชาการ), <strong>Regulator</strong> (ภาครัฐ) และ <strong>Domain Expert</strong> (ผู้เชี่ยวชาญด้านธุรกิจ)\r\n\r\n&nbsp;\r\n\r\nตามแนวคิดของ คุณสุเทพ เชื่อว่า องค์ประกอบทั้ง 6 มีการเชื่อมโยงสนับสนุนกันเป็นวงแหวนเดียวกัน ซึ่งจะหนุนนำไปสู่การขับเคลื่อนเชิงธุรกิจที่จะมีผลต่อการขับเคลื่อนเศรษฐกิจดิจิทัล (Digital Economy) ต่อไป\r\n\r\n&nbsp;\r\n\r\nทั้งนี้เป็นเพราะทั้ง 6 องค์ประกอบถูกหล่อหลอมขึ้นมาให้แข็งแกร่งและมั่นคงเพื่อผลักดันให้ประเทศไทยก้าวหน้าต่อในยุคดิจิทัลได้เป็นอย่างดี\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n<h2>ตำแหน่งใหม่-ความท้าทายใหม่</h2>\r\n&nbsp;\r\n\r\nเมื่อราวๆ กลางปี 58 ที่ผ่านมา “คุณสุเทพ อุ่นเมตตาจิต“ ได้รับมอบหมายภารกิจใหม่ในตำแหน่งที่สูงขึ้น นั่นคือ “กรรมการผู้จัดการ กลุ่มบริษัทจีเอเบิล” ที่มีบริษัทในเครือถึง 8 บริษัท ซึ่งย่อมมาพร้อมกับความท้าทาย\r\n\r\n&nbsp;\r\n\r\nครั้งใหม่ที่ยิ่งใหญ่กว่าเดิมหลายทบเท่า โดยคุณสุเทพ มองว่าความท้าทายครั้งนี้มีปัจจัยประกอบกัน 4 ด้าน ได้แก่ ปัจจัยด้านเศรษฐกิจระดับโลกเศรษฐกิจของประเทศไทย ที่ทั้งสองอยู่ในช่วงที่ไม่ดีนัก\r\n\r\n&nbsp;\r\n\r\nส่วนอีก 2 ปัจจัย คือ ช่วงการเปลี่ยนโฉมเทคโนโลยี ซึ่งหากกำหนดเส้นทางที่ผิดหรือไม่เท่าทัน ไม่เข้าใจทิศทางเทคโนโลยีก็อาจจะส่งผลเสียต่อการดำเนินธุรกิจ ปัจจัยสุดท้าย คือ ความสำเร็จของจีเอเบิลในช่วงที่ผ่านมาเป็นความท้าทายสำหรับตำแหน่งกรรมการผู้จัดการจะต้องทำให้สำเร็จเช่นกัน\r\n\r\n&nbsp;\r\n\r\nหากกล่าวย้ำถึงความท้าทายของการรับตำแหน่งใหม่ในครั้งนี้ สิ่งที่ยิ่งใหญ่ที่มีผลมาจากการเปลี่ยนโฉมเทคโนโลยีดังที่กล่าวมานั้น ด้านการปรับเปลี่ยนทิศทางในการดำเนินธุรกิจ\r\n\r\n&nbsp;\r\n\r\nซึ่งหมายถึง “เปลี่ยนบริการให้เป็นสินค้า” บนวิสัยทัศน์ที่ว่า “การเป็นผู้ให้บริการเทคโนโลยีสารสนเทศ (IT) ที่ช่วยสร้างแรงบันดาลใจในการค้นหาคำตอบที่ดีกว่า ง่ายกว่า สมเหตุสมผลมากกว่า ในการใช้ชีวิตและธุรกิจของผู้คนในอาเซียน” ย่อมเป็นประเด็นสำคัญของความท้าทายอย่างเลี่ยงไม่ได้\r\n\r\n&nbsp;\r\n<h2>ปูรากฐานธุรกิจสู่เป้าหมายใหม่ “อาเซียน”</h2>\r\n&nbsp;\r\n\r\nจากทิศทางการดำเนินธุรกิจที่ถูกวางให้เปลี่ยนบริการเป็นสินค้า คุณสุเทพได้ถ่ายทอดการขับเคลื่อนองค์กรเป็น 3 ช่วง คือ ช่วงสั้น กลาง และยาว\r\n\r\n&nbsp;\r\n\r\n<strong>ช่วงระยะสั้นเปลี่ยนทัศนคติการดำเนินธุรกิจ</strong> : โดยมองการดำเนินธุรกิจจากต้นทางถึงผลลัพธ์ปลายทาง นั้นคือ มองจากโจทย์ของลูกค้าไปถึงประโยชน์ที่จะเกิดขึ้นกับลูกค้าของลูกค้า ซึ่งจะต้องเข้าใจความต้องการของลูกค้าให้ลึกซึ้ง และสอดคล้องกับความต้องการของตลาด\r\n\r\n&nbsp;\r\n\r\n<strong>ช่วงระยะกลางขยายตลาดใหม่</strong> : ขับเคลื่อนกลยุทธ์ที่มุ่งปิดตลาดใหม่ด้วยการมองกลุ่มเป้าหมายเป็นสองส่วนคือลูกค้าใหม่และฐานลูกค้าเดิมโดยการนำเสนอสินค้าหรือบริการใหม่ให้สอดคล้องกับความต้องการของลูกค้ากลุ่มนั้นๆ\r\n\r\n&nbsp;\r\n\r\nคุณสุเทพ ขยายความว่า\r\n\r\n\r\n\r\n&nbsp;\r\n\r\nนอกจากนี้คุณสุเทพ ยังกล่าวถึงการพัฒนาบุคลากรภายในจีเอเบิลด้วยว่า\r\n\r\n\r\n\r\n&nbsp;\r\n\r\n<strong>ช่วงระยะยาวขยายตลาดสู่ประเทศในอาเซียน</strong> : โดยวางความฝันไว้อีกราว 3 ปีนับจากนี้ คือ อยากเห็นผู้ให้บริการไอทีมีส่วนร่วมในการดำเนินชีวิตประจำวันของคนในภูมิภาคนี้ ซึ่งจะหมายถึงการยกระดับคุณภาพชีวิตที่ดีขึ้น\r\n\r\n&nbsp;\r\n\r\nจากทิศทางการดำเนินธุรกิจที่เริ่มเข้าสู่การปรับเปลี่ยนสู่เส้นทางบริการตามนโยบายใหม่ รวมไปถึงการขยายตลาดใหม่ทั้งในกลุ่มลูกค้าเดิม และขยายไปยังลูกค้ากลุ่มใหม่ๆ ผนวกกับการกำหนดเป้าหมายขยายตลาดไปยังภูมิภาคอาเซียนนั้น ทำให้กลุ่มบริษัทจีเอเบิลคาดหวังว่า เริ่มตั้งแต่ปี 2559 จะมีอัตราการเติบโตปีละ 10-15% ต่อปีต่อเนื่องกันราว 5 ปีนับจากนี้ไป",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        },
        {
          "domain": "portfolio_category",
          "slug": "service",
          "title": "Service"
        }
      ]
    },
    {
      "title": "Gartner Top 10 Strategic Technology Trends 2016",
      "description": "<img class=\"wp-image-27248 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/08/auto-analysis.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n<h2></h2>\r\n<h2><strong>Gartner Top 10 Strategic Technology Trends 2016</strong></h2>\r\n<!--more-->\r\n\r\n&nbsp;\r\n\r\nในงาน <a href=\"https://www.gartner.com/newsroom/id/3115117\"><strong>Gartner Symposium/ITxpo 2015</strong></a> ที่เมือง Orlando นักวิเคราะห์ของ Gartner ได้นำเสนอถึง Top 10 Technology Trends ของปี 2016 ให้กับผู้เข้าร่วมงานสัมมนา เพื่อเป็นแนวทางในการวางแผนและเตรียมการด้านไอทีสำหรับองค์กร\r\n\r\n&nbsp;\r\n\r\nโดย Technology Trends ทั้ง 10 ข้อนี้เรียกว่าเป็น Strategic Technology Trend ซึ่ง Gartner ได้ให้คำจำกัดความไว้ว่าเป็นสิ่งที่มีศักยภาพที่จะทำให้เกิดผลกระทบต่อองค์กร\r\n\r\n&nbsp;\r\n\r\nทั้งนี้อาจทำให้องค์กรยุ่งเหยิงหรือพบกับความเสียหายได้หากไม่ได้เตรียมการรับมือเอาไว้ เทคโนโลยีเหล่านี้จะมีผลต่อการวางแผนระยะยาวขององค์กร การดำเนินโครงการต่างๆ ตลอดจนการริเริ่มโครงการใหม่ๆ ขององค์กร\r\n\r\n&nbsp;\r\n\r\nStrategic Technology Trends ทั้ง 10 ข้อ มีดังนี้\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>The Device Mesh</li>\r\n \t<li>Ambient User Experience</li>\r\n \t<li>3D Printing Materials</li>\r\n \t<li>Information of Everything</li>\r\n \t<li>Advanced Machine Learning</li>\r\n \t<li>Autonomous Agents and Things</li>\r\n \t<li>Adaptive Security Architecture</li>\r\n \t<li>Advanced System Architecture</li>\r\n \t<li>Mesh App and Service Architecture</li>\r\n \t<li>Internet of Things Platforms</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n\r\nผมขออธิบายเรื่อง <strong>3D Printing Materials</strong> ก่อน เนื่องจากไม่ได้สัมพันธ์กับเรื่องที่เหลือ โดยเครื่องพิมพ์สามมิติมีความสามารถเพิ่มขึ้นมาก และมีพัฒนาการในการพิมพ์ที่ดีขึ้นเรื่อยๆ\r\n\r\n&nbsp;\r\n\r\nในปัจจุบันวัสดุที่นำมาใช้ในการพิมพ์มีความหลากหลายและก้าวหน้ามาก เช่น นิเกิลอัลลอย คาร์บอนไฟเบอร์ กระจก หมึกนำไฟฟ้า ยา และสารชีวภาพ เช่น โปรตีน เป็นต้น\r\n\r\n&nbsp;\r\n\r\nความก้าวหน้าเหล่านี้เป็นตัวผลักดันให้มีการใช้เครื่องพิมพ์สามมิติในเชิงอุตสาหกรรมมากขึ้น และจะมีผลกระทบต่อห่วงโซ่อุปทานโดยตรง\r\n\r\n&nbsp;\r\n\r\nกลับมาอีก 9 เรื่องที่เหลือ ทั้ง 9 เรื่องนี้ร้อยเรียงต่อเนื่องกันตามแผนภูมิสรุปรูปนี้\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28408 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2016/01/Top10StrTechTrend2016.jpg\" alt=\"\" width=\"720\" height=\"592\" />\r\n\r\n&nbsp;\r\n\r\nแกนกลางของเรื่องก็คือ<strong> Ambient User Experience</strong> ซึ่งหมายถึงประสบการณ์ในการใช้งานอุปกรณ์ไอทีที่อยู่รอบตัวได้อย่างต่อเนื่องลื่นไหล สามารถสลับใช้อุปกรณ์ใดก็ได้โดยการใช้งานจะยังคงต่อเนื่องกันไป ตัวอย่างเช่น\r\n\r\n&nbsp;\r\n\r\nความสามารถ Handoff ของอุปกรณ์ในระบบ iOS และ OSX ของบริษัทแอปเปิล ทั้งนี้ ก็เนื่องจากการที่อุปกรณ์ต่างๆ ได้เชื่อมต่อกันเป็นโครงข่ายของอุปกรณ์ที่เรียกว่า Device Mesh\r\n\r\n&nbsp;\r\n\r\nซึ่งหมายถึงการที่อุปกรณ์ต่างๆ จะมีการติดต่อสื่อสารระหว่างกันตลอดเวลามีการโอนถ่ายข้อมูลและสถานะการทำงานต่างๆ ให้แก่กัน อุปกรณ์ในที่นี้ ได้แก่ คอมพิวเตอร์ สมาร์ทโฟน อุปกรณ์สวมใส่ รถยนต์ เครื่องใช้ไฟฟ้าภายในบ้าน รวมไปถึงเซ็นเซอร์ต่างๆ ด้วย\r\n\r\n&nbsp;\r\n\r\nข้อมูลต่างๆ ทีส่่งข้ามไปมาระหวา่งอุปกรณ์ก็คือ <strong>Information of Everything</strong> เดิมทีข้อมูลเหล่านี้มีปรากฏอยู่แล้วเพียงแต่แยกกันอยู่ ขาดความสมบูรณ์ หรือขาดความเชื่อมโยงถึงกัน\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-26781 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/06/big-data1-1.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nเทคโนโลยีในการเชื่อมโยงข้อมูลจะถูกนำมาใช้เพื่อการนี้ เช่น Graph Database หรือเทคโนโลยีใหม่ๆ ที่จะเข้ามาช่วยวิเคราะห์และเพิ่มความหมายให้กับข้อมูล เพื่อที่จะทำให้ข้อมูลที่กระจัดกระจายกันอยู่มีความหมายและความเชื่อมโยงที่สามารถนำไปประมวลผลได้\r\n\r\n&nbsp;\r\n\r\nหลังจากที่ข้อมูลได้ถูกจัดกลุ่มจัดหมวดหมู่และมีความหมายแล้ว ข้อมูลเหล่านี้จะต้องถูกนำไปศึกษา แต่ด้วยปริมาณที่มีในระดับมหาศาลและถูกสร้างขึ้นอยู่ตลอดเวลาซึ่งมากเกินกว่าความสามารถในการจัดการด้วยมนุษย์ธรรมดาๆ ทั่วไป\r\n\r\n&nbsp;\r\n\r\nดังนั้นเครือข่ายใยประสาทแบบลึก (<strong>Deep Neural Network</strong>) จึงถูกนำมาใช้เพื่อสร้างระบบที่สามารถเรียนรู้ได้ด้วยตนเอง (<strong>Advanced Machine Learning</strong>) ระบบจะเรียนรู้และสร้างความเข้าใจกับข้อมูลที่เกิดขึ้น เทคโนโลยีด้านนี้จะเติบโตก้าวหน้าขึ้นอย่างรวดเร็ว องค์กรต่างๆ จะต้องศึกษาและพิจารณาว่าจะนำเทคโนโลยีด้านนี้มาใช้ให้เกิดประโยชน์กับองค์กรได้อย่างไร\r\n\r\n&nbsp;\r\n\r\n<img class=\"wp-image-27111 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/08/Machine-Learning-hero-1.jpg\" alt=\"\" width=\"750\" height=\"375\" />\r\n\r\n<a href=\"https://www.g-able.com/digital-review/deep-learning/\">Machine Learning</a> นำความชาญฉลาดมาสู่อุปกรณ์ต่างๆ รอบๆ ตัวเรา จนเปลี่ยนบทบาทจากการทำตามคำสั่งมาเป็นเลขาส่วนตัวผู้คอยให้คำแนะนำและช่วยกำหนดการทำงานให้กับเรา (<strong>Autonomous Agents and Things</strong>)\r\n\r\n&nbsp;\r\n\r\nในปัจจุบันซอฟต์แวร์เลขาส่วนตัว เช่น Google Now, Microsoft Cortana, Siri มีความฉลาดมาก สามารถคิดและให้คำแนะนำที่เป็นประโยชน์ในสถานการณ์ที่แตกต่างกันอย่างหลากหลาย และซอฟต์แวร์เหล่านี้จะยิ่งมีความสามารถเพิ่มขึ้นเรื่อยๆ\r\n\r\n&nbsp;\r\n\r\nเมื่อผนวกรวมเข้ากับเทคโนโลยีทางด้านฮาร์ดแวร์ที่ก้าวหน้าขึ้นอย่างเช่น หุ่นยนต์ ก็จะทำให้หุ่นยนต์ทำหน้าที่ได้ดีขึ้น คอยให้บริการต่างๆ และคอยช่วยเหลือมนุษย์ได้ดีขึ้น ในอีก 5 ปีข้างหน้ารูปแบบการปฏิสัมพันธ์ระหว่างมนุษย์และระบบคอมพิวเตอร์จะเปลี่ยนไป มนุษย์จะออกคำสั่งน้อยลง และเปลี่ยนมาเป็นการตัดสินใจเลือกจากตัวเลือกที่ระบบนำเสนอมาให้แทน\r\n\r\n&nbsp;\r\n\r\nการเรียนรู้ของระบบด้วย Deep Neural Network ต้องการพลังในการประมวลผลที่สลับซับซ้อนมากขึ้น รูปแบบของการประมวลผลโดยอาศัยหน่วยประมวลด้านกราฟฟิก (Graphic Processing Unit : GPU) หรือโปรเซสเซอร์แบบ Field-Programmable Gate Arrays (FPGAs อย่าสับสนกับ FPGA ที่หมายถึง Flip-Chip Pin Grid Array ที่เป็นลักษณะขาของซีพียู) นำไปสู่สถาปัตยกรรมของระบบแบบใหม่ที่ก้าวหน้ามากขึ้น (<strong>Advanced System Architecture</strong>)\r\n\r\n&nbsp;\r\n\r\n<a href=\"https://www.xilinx.com/products/silicon-devices/fpga/what-is-an-fpga.html\">FPGAs </a>เป็นอุปกรณ์สารกึ่งตัวนำชนิดโปรแกรมได้ที่มีโครงข่ายการเชื่อมต่อภายในแบบแมทริกซ์ โครงสร้างภายในของ FPGA แทนที่โครงสร้างภายในจะมีลอจิกเกทที่ซับซ้อนและพร้อมสำหรับการประมวลผลคำสั่งต่างๆ แต่ โครงสร้างของ FPGAs จะมีชุดของลอจิกเกทแบบพื้นฐานเรียงกันเป็นกริด\r\n\r\n&nbsp;\r\n\r\nซึ่งแต่ละชุดลอจิกเกทพื้นฐานนี้สามารถกำหนดให้เป็นเกทแบบ AND, OR, NOT, XOR ได้ และกำหนดให้เชื่อมต่อกับชุดลอจิกเกทข้างเคียงในรูปแบบใดก็ได้ ทำให้สามารถประกอบกันขึ้นมาเป็นชุดคำสั่งเฉพาะตามที่ต้องการได้ เช่น ฟังก์ชั่นการถอดรหัส หรือฟังก์ชั่นคณิตศาสตร์ ซึ่งเหมาะกับการนำมาใช้เป็นโหนดในเครือข่ายใยประสาท\r\n\r\n&nbsp;\r\n\r\nระบบที่สร้างขึ้นจาก GPUs and FPGAs จะทำงานใกล้เคียงกับสมองของมนุษย์ซึ่งนั่นเหมาะกับการทำงานแบบ Deep Learning ซึ่งเป็นสิ่งที่สมาร์ทแมชชีนจำเป็นต้องใช้ การใช้ชิปสถาปัตยกรรม FPGAs จะช่วยเพิ่มระดับการทำงานของ Machine Learning ในอุปกรณ์ขนาดเล็ก เช่น IoT, บ้าน, รถ, นาฬิกาข้อมือ เนื่องจากมีขนาดที่เล็กและใช้พลังงานต่ำมาก\r\n\r\n&nbsp;\r\n\r\nเมื่อช่องทางในการใช้งานระบบมีหลากหลายช่องทางมากขึ้น ระบบมีความชาญฉลาดมากขึ้น ย่อมเป็นโอกาสให้พวกมิจฉาชีพแฝงตัวเข้ามาในระบบและเพิ่มความเสี่ยงต่อผู้ใช้งานและระบบขององค์กรมากขึ้น\r\n\r\n&nbsp;\r\n\r\nนอกจากนี้ในปัจจุบันยังมีธุรกิจที่ทำการซื้อขายช่องโหว่ของระบบอย่างเช่น <a href=\"http://www.hackingteam.it/\">Hacking Team</a> หรือ บริษัท <a href=\"https://zerodium.com/\">Zerodium </a>ก็ยิ่งทำให้ความเสี่ยงของระบบสูงมากขึ้น การป้องกันภัยแบบเดิมๆ ที่ป้องกันด้วยการตรวจตราที่บริเวณทางเข้าออกของเครือข่าย หรือการใช้กฎต่างๆ ในการตรวจสอบการบุกรุกจะไม่เพียงพออีกต่อไป ยิ่งองค์กรที่มีการใช้งานอุปกรณ์พกพา และการใช้งานคลาวด์ก็ยิ่งต้องเพิ่มความระมัดระวังมากยิ่งขึ้น\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-25550 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/06/protect.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nวิธีการในการตรวจสอบและป้องกันการเจาะระบบจะต้องยืดหยุ่นและปรับตัวตามสถานการณ์ได้มากขึ้นเรียกว่า <strong>Adaptive Security Architecture</strong>\r\n\r\n&nbsp;\r\n\r\nนั่นคือการป้องกันจะต้องฝังลงไปในแอพพลิเคชั่น ที่ติดตั้งใช้งานบนสมาร์ทโฟน และจะต้องอาศัยการวิเคราะห์ข้อมูลจากพฤติกรรมของผู้ใช้ระบบที่ผ่านช่องทางต่างๆ แล้ววิเคราะห์ว่าเป็นพฤติกรรมที่จะก่อให้เกิดความเสี่ยงต่อความปลอดภัยของระบบหรือไม่ แล้วนำเสนอหนทางป้องกันส่งตรงไปยังตัวผู้ใช้เพื่อทำการปิดกั้นหรือกำจัดภัยคุกคามที่อาจจะเกิดขึ้น\r\n\r\n&nbsp;\r\n\r\nสถาปัตยกรรมของแอพพลิเคชั่นที่ทำงานบน Device Mesh ก็จะเปลี่ยนไป ลักษณะการทำงานของแอพพลิเคชั่นจะเป็นการทำงานแบบ <strong>Apps and Services Architecture</strong>\r\n\r\n&nbsp;\r\n\r\nโดยแอพพลิเคชั่นจะทำงานโดยการติดต่อกับเซอร์วิสขนาดเล็กหลากหลายตัวที่ทำงานอยู่บนเซิร์ฟเวอร์ซึ่งอาจจะกระจายอยู่บนคลาวด์ ความสลับซับซ้อนจะถูกย้ายจากฝั่งเซิร์ฟเวอร์มาอยู่บนตัวแอพพลิเคชั่น\r\n\r\n&nbsp;\r\n\r\nซึ่งเซอร์วิสจะมีขนาดเล็กลงปรับเปลี่ยนได้ง่ายและมีความคล่องตัวสูงมากขึ้น การติดตั้งและเริ่มใช้งานก็ต้องการความรวดเร็ว และคล่องตัวตามไปด้วยเช่นกัน ซึ่งเทคโนโลยีที่เหมาะสมสำหรับเรื่องนี้คือ เทคโนโลยี <a href=\"http://www.computerweekly.com/feature/What-are-containers-and-microservices\">Container และ Microservices</a> ทีมงานพัฒนาแอพพลิเคชั่นจะต้องสร้างสถาปัตยกรรมใหม่ที่ทันสมัย เพื่อทำให้การส่งมอบแอพพลิเคชั่นบนคลาวด์ได้อย่างรวดเร็ว ยืดหยุ่น และคล่องตัว\r\n\r\n&nbsp;\r\n\r\nแม้ว่ามาตรฐานต่างๆ ในการสื่อสารและการทำงานระหว่างอุปกรณ์ต่างๆ ใน IoT ยังไม่ได้ลงตัวเนื่องจากการแข่งขันของผู้ผลิตแต่ละราย ซึ่งกว่าจะกำหนดมาตรฐานจนเป็นที่ยอมรับกันได้คงเป็นปี 2018 แต่ทว่าองค์กรที่จะใช้ IoT จะต้องติดตามและเตรียมพร้อมกำหนด IoT Platform ที่มีความเหมาะสมกับองค์กรของตนเอง มิเช่นนั้นเมื่อถึงเวลาที่มาตรฐานมาถึงก็จะสายเกินไป\r\n\r\n&nbsp;\r\n\r\nTechnology Trends ทั้ง 10 ข้อนี้ เป็นแนวทางให้ผู้บริหารด้านไอทีขององค์กรได้ตระหนักและนำไปพิจารณาเพื่อวางแผนงานด้านไอทีของตนเอง ผมหวังว่าทุกท่านคงได้เห็นภาพร่างของทิศทางเทคโนโลยีด้านไอทีในช่วงเวลา 2-3 ปีต่อจากนี้และเตรียมพร้อมรับกับอนาคตที่กำลังจะมาถึง สวัสดีปีใหม่ทุกท่านครับ\r\n\r\n&nbsp;\r\n\r\n<!--a href='http://www.freepik.com/free-vector/business-data-infographic_780884.htm'>Designed by Freepik</a-->",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "digital-marketing",
          "title": "Digital Marketing"
        },
        {
          "domain": "portfolio_category",
          "slug": "microsoft-solutions",
          "title": "Microsoft Solutions"
        }
      ]
    },
    {
      "title": "ada นวัตกรรมเปลี่ยนโลกการของสื่อสารในองค์กรผ่านโมบายแอพพลิเคชั่น",
      "description": "<a href=\"https://ada.g-able.com/site/test2/\">ada </a>จากการพัฒนารูปแบบการสื่อสารภายในองค์กรให้เป็นหนึ่งเดียว เชื่อมโยงทุกหน่วยธุรกิจเข้าด้วยกัน สู่เวทีการแข่งขันของกลุ่มบริษัท CDG &amp; G-ABLE  Innovation Award กลายเป็นเทคโนโลยีที่เพิ่มมูลค่าให้กับธุรกิจ ในรูปแบบของโมบายแอพพลิเคชั่น\r\n\r\n&nbsp;\r\n\r\nที่ตอบโจทย์ได้ตรงกลุ่มผู้ใช้ในองค์กร ให้ติดต่อสื่อสารกันได้สะดวกและปลอดภัย พร้อมการพัฒนาก้าวต่อไปแอพพลิเคชั่นที่เป็นศูนย์รวมการสื่อสารในองค์กรเต็มรูปแบบ ด้วยการ “สร้างโซเชียลมีเดียให้องค์กร”\r\n\r\n&nbsp;\r\n\r\n<img class=\"aligncenter wp-image-16999 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/V49_0.jpg\" alt=\"\" width=\"253\" height=\"228\" />\r\n\r\n&nbsp;\r\n\r\nด้วยความสำเร็จจากนวัตกรรมที่ช่วยยกระดับการสื่อสารในองค์กร ผ่านทางโมบายแอพพิเคชั่น สู่การสร้างสรรค์และนำมาต่อยอดในเชิงธุรกิจ จนกลายเป็นโมเดลธุรกิจใหม่\r\n\r\n&nbsp;\r\n<h3><strong>สร้างสรรค์-ผลักดัน-พัฒนา ต่อยอดสู่โครงการ CDG &amp; G-ABLE Innovation Award</strong></h3>\r\n&nbsp;\r\n\r\nเริ่มต้นจากแนวคิดของ<strong> คุณนาถ ลิ่วเจริญ</strong> ประธานกรรมการบริหาร กลุ่มบริษัทซีดีจี และกลุ่มบริษัทจีเอเบิล ที่ตอกย้ำ  <a href=\"http://www.bangkokbiznews.com/blog/detail/639505\">Disruptive Technology</a> พร้อมกระตุ้นให้สร้าง CDG &amp; G-ABLE Innovation Award เป็นเวทีของพนักงานในการนำเสนอแนวคิดใหม่ๆ เพื่อส่งเสริมการสร้างนวัตกรรมภายในองค์กร\r\n\r\n&nbsp;\r\n\r\n<img class=\"aligncenter wp-image-17000 size-medium\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/V49_1-251x300.jpg\" alt=\"\" width=\"251\" height=\"300\" />\r\n\r\n&nbsp;\r\n\r\n<strong>คุณปิยะ ตั้งสิทธิชัย </strong> Vice President, Information Technology Systems Department กลุ่มบริษัทจีเอเบิล กล่าวว่า CDG &amp; G-ABLE Innovation Award เปิดกว้างสำหรับพนักงานที่มีไอเดียสร้างสรรค์มานำเสนอ\r\n\r\n&nbsp;\r\n\r\nเพื่อเป็นการจุดประกายให้กับหน่วยงานต่างๆ ภายในและเป็นการกระตุ้นแนวคิดที่สามารถต่อยอดเป็นโมเดลธุรกิจต่อไปได้ โดยปีนี้เป็นปีที่ 3 สำหรับโครงการ Innovation Award ซึ่งแบ่งเป็น 2 ประเภทการประกวด คือ Inno Project และ Spark Idea\r\n\r\n&nbsp;\r\n\r\n<strong>Inno Project</strong> - เป็นการประกวดโดยใช้แนวคิดสร้างสรรค์ที่เกิดจากภายนอกองค์กร ทั้งในส่วนของโครงการที่สร้างความสำเร็จให้กับลูกค้า หรือเกิดจากการนำเอาเทคโนโลยีใหม่ๆ มาใช้\r\n\r\n&nbsp;\r\n\r\nรวมถึงการใช้นวัตกรรมและเทรนด์ที่เกิดขึ้นในท้องตลาด ซึ่งนำมาพัฒนาจนสำเร็จพร้อมส่งมอบให้กับลูกค้า โดยจะถูกนำมาวิเคราะห์และพัฒนาจนตกผลึกเป็นบริการที่ได้รับความนิยม ตัวอย่างที่เห็นได้ชัดคือ แอพพลิเคชัน JS100 (จ.ส. 100)\r\n\r\n&nbsp;\r\n\r\nซึ่งเป็นแอพพลิเคชันที่ทำให้ผู้ใช้รับทราบสถานการณ์บนท้องถนน ดูแผนที่เดินทาง ติดตามข่าวสาร ข้อมูลทวิตเตอร์ และแจ้งขอความช่วยเหลือฉุกเฉิน  อำนวยความสะดวกและสร้างความมั่นใจสำหรับการเดินทาง\r\n\r\n&nbsp;\r\n\r\n<strong>Spark Idea -</strong> เป็นการนำเสนอไอเดียใหม่ๆ ของพนักงาน ที่สามารถนำมาต่อยอดทางธุรกิจได้ในตลาดไอที ตัวอย่างเช่น แนวคิดโครงการ Harvest เพื่อช่วยเหลือเกษตรกรในการวางแผนการผลิต และ การตลาดอย่างครบวงจร เชื่อมโยงทั้งภาครัฐและเอกชนเข้าสู่กลุ่มเกษตรกร\r\n\r\n&nbsp;\r\n\r\nเพื่อสร้างการพัฒนาภาคการเกษตรที่ยั่งยืน  ซึ่งได้รับรางวัลจากการประดวกในปีที่ผ่านมา แม้จะเป็นเพียงการเริ่มต้นไอเดีย แต่ก็เป็นการจุดประกายไปยังไอเดียอื่นๆ ในกลุ่มบริษัทอย่างต่อเนื่อง\r\n\r\n&nbsp;\r\n<h3><strong>ผ่านการคัดกรองอย่างเข้มข้น จนตกผลึกสู่รูปแบบธุรกิจ </strong><strong>ada ขึ้นแท่น 1 ใน 5 บนเวทีใหญ่</strong></h3>\r\n&nbsp;\r\n\r\n<img class=\"size-medium wp-image-17001 aligncenter\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/V49_2-300x259.jpg\" alt=\"\" width=\"300\" height=\"259\" />\r\n\r\n&nbsp;\r\n\r\n<strong>คุณชัยวุฒิ ระตีพูน </strong>Core Solution Delivery Manager, Information Technology Systems Department กลุ่มบริษัทจีเอเบิล กล่าวถึงก่อนที่นวัตกรรมต่างๆ จะถูกนำมาพัฒนาเพื่อใช้ ต้องผ่านการคัดเลือกที่เข้มข้น ตั้งแต่ในระดับสายงาน Business Unit (BU)\r\n\r\n&nbsp;\r\n\r\nซึ่งแต่ละ BU จะมีการคัดเลือกไอเดียที่โดดเด่นเข้ามาพิจารณา และเมื่อผ่านระดับ BU มาแล้ว จึงเข้าสู่เวทีใหญ่ CDG &amp;G-ABLE  Innovation Award ซึ่งในปีที่ผ่านมามีนวัตกรรมที่เข้าประกวดประมาณ 50 โครงการ แบ่งออกเป็น Inno Project 18 โครงการ และ Spark Idea 27 โครงการ\r\n\r\n&nbsp;\r\n\r\nเมื่อผ่านเข้ามาสู่เวทีใหญ่ ก็ต้องผ่านการคัดเลือกโดยคณะกรรมการใหญ่ผู้ทรงคุณวุฒิอีก 2 รอบ และ ada ได้คว้าตำแหน่งชนะเลิศในระดับ BU : Business Support Innovation Award และก้าวสู่การแข่งขันบนเวทีใหญ่ CDG &amp; G-ABLE Innovation Award โดยผ่านเข้าสู่รอบแรก และขึ้นแท่น 1 ใน 5 ในรอบที่สอง ด้วยนวัตกรรมที่สามารถต่อยอดสู่โมเดลธุรกิจได้อย่างเต็มภาคภูมิ\r\n\r\n&nbsp;\r\n<h3><strong>เวทีประกวดคือแรงผลักดัน</strong></h3>\r\n<img class=\"size-medium wp-image-17002 aligncenter\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/V49_3-300x259.jpg\" alt=\"\" width=\"300\" height=\"259\" />\r\n\r\n&nbsp;\r\n\r\n<strong>คุณชลดรงค์ รัตนพร </strong>IT Specialist, Information Technology Systems Department กลุ่มบริษัทจีเอเบิล กล่าวถึงการเริ่มต้นโครงการ ada ที่เป็นการมองหาโมบายแอพพลิเคชั่นสำหรับใช้ในองค์กร\r\n\r\n&nbsp;\r\n\r\nโดยคาดหวังให้เป็นช่องทางในการติดต่อสื่อสารภายใน และมุ่งเป้าไปที่การสร้างโซเชียลมีเดียในองค์กร ซึ่งจุดสำคัญคือ ต้องได้การยอมรับจากผู้ใช้หรือพนักงานและการร่วมมือของฝ่ายสื่อสารภายในองค์กร\r\n\r\n&nbsp;\r\n\r\nด้วยการนำเสนอบริการในรูปแบบต่างๆ ไม่ว่าจะเป็นการสนทนา (Chat), การค้นหาเบอร์ติดต่อ (Contact), รวมไปถึงบริการด้านข่าวสาร (News Feed) เพื่อเชื่อมโยงการสื่อสารในองค์กรได้ง่ายและรวดเร็วที่สุดสำหรับพนักงานในทุกที่ ทุกเวลา\r\n\r\n&nbsp;\r\n\r\n“<em>นอกจากนี้ยังมีแนวคิดที่จะเสริมเทคโนโลยี VoIP เพื่อลดค่าใช้จ่าย โดยคาดว่าจะเริ่มเปิดใช้งานได้ในช่วงประมาณต้นปี 2017 และมีแนวโน้มจะพัฒนาฟังก์ชั่นเสริม อาทิ ระบบการเชื่อมโยงของฝ่ายบุคคล เพื่อให้พนักงานที่อยู่ตามไซต์งานซึ่งอาจไม่ได้ใช้คอมพิวเตอร์สามารถติดต่อและแจ้งลาได้ง่ายขึ้นผ่านทางแอพพลิเคชั่นบนสมาร์ทโฟน เป็นต้น</em>” คุณชลดรงค์ กล่าว\r\n\r\n&nbsp;\r\n<h3><strong>ada จากบริการในองค์กร สู่ธุรกิจความเชื่อมั่นในตลาด</strong></h3>\r\n&nbsp;\r\n\r\nความสำเร็จในด้านการประยุกต์ใช้ในธุรกิจอย่างจริงจัง โดย ada ใช้เวลาในการพัฒนาตั้งแต่เป็น Innovation ด้วยการรวบรวมความต้องการจากผู้ใช้เป็นเวลา 1 ปี และนำมาวิเคราะห์ระบบเพิ่มเติม จนส่งให้ถึงมือผู้ใช้ในอุตสาหกรรมยานยนต์ สำหรับใช้ในการค้นหาหรือจองที่นั่งรถรับส่งสำหรับพนักงาน\r\n\r\n&nbsp;\r\n\r\nซึ่งสามารถรายงานต้นทาง-ปลายทาง ของรถแต่ละคัน เพื่อรองรับพนักงานที่เดินทางไปมาจำนวนมาก โดยใช้พื้นฐานจากระบบของ ada และนำไปประยุกต์ใช้ ด้วยการเพิ่มฟีเจอร์ให้เหมาะสมกับการใช้งาน เช่น การร่วมมือกับผู้พัฒนาในด้านซอฟต์แวร์นำทาง GPS มาใช้ร่วมกัน เพื่อระบุตำแหน่งการเดินรถแต่ละคัน พร้อมการกำหนดเส้นทางในการเดินทาง\r\n\r\n&nbsp;\r\n\r\nนอกจากนี้ ada ยังมองไปถึงกลุ่มเป้าหมายอื่นๆ เช่น องค์กรที่มีพนักงาน 100-500 คน หรือมากกว่า ที่ต้องการเพิ่มศักยภาพในระบบติดต่อสื่อสารภายในองค์กร\r\n\r\n&nbsp;\r\n<h3><strong>เดินหน้าสู่เป้าหมายด้วยความเชี่ยวชาญ</strong></h3>\r\n&nbsp;\r\n\r\nคุณชัยวุฒิ เสริมข้อมูลเพิ่มเติมในจุดแข็งของ ada ด้วยทีมงานที่มีความเชี่ยวชาญในระบบไอทีที่มีมายาวนาน พร้อมข้อมูลที่มีการรวบรวมจากการใช้งานจริงของผู้ใช้ในองค์กร จึงทำให้สามารถวิเคราะห์ความต้องการของลูกค้าได้ตรงจุด\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-27559 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/08/guide.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nเมื่อรวมกับทีมที่มีประสบการณ์ในการพัฒนาด้านโมบายแอพพลิเคชั่น จึงสามารถจัดการผสมผสานบริการได้อย่างลงตัว ซึ่งต้องยอมรับว่าการรวมทีมที่มากด้วยประสบการณ์เช่นนี้ จะรองรับความต้องการของลูกค้าได้ในทุกด้าน\r\n\r\n&nbsp;\r\n\r\nนอกจากนี้ยังกล่าวถึงปัจจัยที่ทำให้เกิดความสำเร็จ “การยอมรับ” จากคนในองค์กร ถือเป็นหัวใจสำคัญในการพัฒนา ada นำข้อมูลความต้องการที่ได้จากความคิดเห็นของคนในองค์กรซึ่งเกิดจากการใช้งานจริง จนสามารถนำมาต่อยอดให้เกิดการพัฒนา และการผลักดันสู่การเปลี่ยนแปลงในองค์กร\r\n\r\n&nbsp;\r\n\r\nเพื่อให้สามารถนำมาใช้ปรับปรุงแอพพลิเคชั่น และนำไปใช้ร่วมกับองค์กรอื่นได้ โดยยังเน้นไปที่ตลาดองค์กรขนาดใหญ่เช่นเดียวกับแนวทางของ G-ABLE ที่เคยประสบความสำเร็จมาแล้วใน G-Approval ซึ่งเป็นแอพพลิเคชั่น ที่ช่วยให้ผู้บริหาร สามารถเข้ามาตรวจเช็ค ให้ความเห็นและอนุมัติงานของหน่วยงานต่างๆ ได้สะดวกยิ่งขึ้น\r\n\r\n&nbsp;\r\n\r\nอีกทั้งพบว่าคู่แข่งในธุรกิจลักษณะเดียวกันในตลาดยังไม่มากนัก จึงมีช่องทางขยายสู่เส้นทางตลาดองค์กรได้รวดเร็วยิ่งขึ้น ด้วยกลยุทธ์สำคัญคือ การสร้าง Reference Site แล้วต่อยอดเทคโนโลยีให้เข้าถึงกลุ่มผู้ใช้ โดยมุ่งเป้าในการเจาะกลุ่มตลาดอื่นๆ  ที่ต้องการพัฒนาระบบสื่อสารองค์กรในอนาคต\r\n\r\n&nbsp;\r\n<h3><strong>เดินหน้าเสริมเทคโนโลยีสื่อสารให้ครบถ้วน </strong><strong>เพื่อสร้างโซเชียลมีเดียให้องค์กร</strong></h3>\r\n&nbsp;\r\n\r\nเพื่อตอบโจทย์ลูกค้าในอนาคต แผนในการพัฒนาขั้นที่สอง จึงเป็นการเสริมเทคโนโลยีใหม่เข้าไปใน ada ไม่ว่าจะเป็นระบบ <a href=\"https://www.egov.go.th/th/e-government-service/383/\">VoIP </a>ซึ่งเป็นการโทรฟรีแบบไม่มีค่าใช้จ่าย และระบบงานของแต่ละบุคคล เช่น ตารางงานในแต่ละหน่วยงานและการแชร์ข้อมูลข่าวสารในองค์กร\r\n\r\n&nbsp;\r\n\r\nเป้าหมายคือ การสร้างโซเชียลมีเดียให้องค์กร ด้วยการรวมทุกสิ่งให้เป็นบริการแบบครบวงจร โดยองค์กรสามารถสื่อสารหรือแจ้งข้อมูลทุกอย่างได้ในแอพนี้ เปรียบเสมือนการย่อระบบ Intranet มาอยู่ในรูปแบบของโมบายแอพพลิเคชั่น เพื่อให้เข้าถึงพนักงานทุกคนในองค์กร\r\n\r\n&nbsp;\r\n<h3><strong>ความสำเร็จที่เหนือความคาดหมาย</strong></h3>\r\n&nbsp;\r\n\r\nด้วยตัวเลขที่มากกว่า 50% จากปริมาณของพนักงานที่ใช้แอพ ada มากกว่า 1,200 คน จากพนักงาน 2 พันกว่าคน ในกลุ่ม CDG &amp; G-ABLE ทั่วประเทศ จึงสร้างความเชื่อมั่นให้กับผู้ใช้ และทีมพัฒนายังสามารถต่อยอดจากแนวคิดและข้อเสนอแนะ จากการใช้งานจริงของกลุ่มผู้ใช้โดยตรง\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nซึ่งมั่นใจว่าเดินมาถูกทาง และสิ่งที่ต้องทำต่อไป คือ การพัฒนาให้ถูกใจผู้ใช้มากขึ้น ด้วยการนำเทคโนโลยีอื่นมาเป็นส่วนเสริม\r\n\r\n&nbsp;\r\n<h3><strong>เทคโนโลยีไม่ใช่อุปสรรค</strong></h3>\r\n&nbsp;\r\n\r\n<strong>คุณชลดรงค์ </strong>กล่าวว่า สิ่งที่อาจส่งผลต่อการพัฒนา ada ไม่ใช่เทคโนโลยี แต่เป็นเรื่องของภาษาที่ใช้ในการสื่อสารกับระบบ iOS และ Android ทั้งเรื่องของขนาดหน้าจอ ความเข้ากันได้ จึงอาจต้องใช้เวลาในการปรับปรุงให้เข้ากับข้อมูลความต้องการจากผู้ใช้ที่หลั่งไหลเข้ามา จึงต้องวางระบบการทำงานให้เหมาะสม\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-27296 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/08/cooperate-1.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nเพื่อเป็นแนวทางในการพัฒนาให้เชื่อมโยงข้อมูลในระบบอื่นๆ ขององค์กรและภายนอก ที่สำคัญคือ การผลักดันให้พนักงานเข้ามาสู่ระบบเพื่อใช้งาน และต้องสามารถดึงออกมาจากระบบสนทนาพื้นฐาน เช่น การนำข้อมูลของพนักงานอื่นๆ มารวมกันในแอพ และสร้างระบบร่วมเพื่อให้พนักงานสามารถติดต่อกันง่ายขึ้น อีกทั้งมีการป้องกันข้อมูลรั่วไหลด้วยการเข้ารหัส และให้ความเป็นส่วนตัวอีกด้วย\r\n\r\n&nbsp;\r\n\r\n<strong>อีกหนึ่งความสำเร็จในการส่งเสริมการเป็นองค์กรนวัตกรรม ทีมงาน </strong><strong>ada เริ่มต้นจากทีมผู้ดูแลระบบไอทีกลางของบริษัท และนักพัฒนาซอฟต์แวร์โมบายแอพพลิเคชั่นของ </strong><strong>G-ABLE </strong><strong>ก้าวสู่การนำเสนอโครงการ ด้วยไอเดียที่โดดเด่นในการประกวด </strong><strong>Innovation Award</strong> <strong>จนเป็นต้นแบบนำไปพัฒนาแอพพลิชั่นที่ตอบโจทย์ธุรกิจ นับว่าประสบความสำเร็จอย่างน่าชื่นชม </strong>",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "advanced-technologies",
          "title": "Advanced technologies"
        },
        {
          "domain": "portfolio_category",
          "slug": "cloud-applications",
          "title": "Cloud Applications"
        },
        {
          "domain": "portfolio_category",
          "slug": "digital-marketing",
          "title": "Digital Marketing"
        },
        {
          "domain": "portfolio_category",
          "slug": "digital-transformation",
          "title": "Digital Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "enterprise-communication",
          "title": "Enterprise Communication"
        },
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        },
        {
          "domain": "portfolio_category",
          "slug": "iot-internet-of-things",
          "title": "IoT (Internet of Things)"
        },
        {
          "domain": "portfolio_category",
          "slug": "solutions",
          "title": "Solutions"
        },
        {
          "domain": "portfolio_category",
          "slug": "telecommunication",
          "title": "Telecommunication"
        },
        {
          "domain": "portfolio_category",
          "slug": "thinking",
          "title": "Thinking"
        }
      ]
    },
    {
      "title": "พลิกโฉมบริการงานทะเบียน ม.เกษตรศาสตร์ ด้วย Student One Stop Service",
      "description": "<em>“อาคารระพีสาคริก”</em> ที่ทำงานแห่งใหม่ของ <a href=\"http://registrar.ku.ac.th/\">สำนักทะเบียนและประมวลผล</a> นำมาสู่การเปลี่ยนแปลงครั้งสำคัญ ที่พลิกประวัติศาสตร์งานบริการนิสิตของ <a href=\"http://www.ku.ac.th/\">มหาวิทยาลัยเกษตรศาสตร์</a> อีกทั้งยังเป็นการวางรากฐานงานทะเบียนประวัตินิสิต\r\n\r\n&nbsp;\r\n\r\nซึ่งเปรียบเป็นหัวใจของงานในมหาวิทยาลัย ที่สามารถนำไปสร้างเป็นจุดเริ่มต้นของการพัฒนาในส่วนงานต่างๆ ต่อไป\r\n\r\n&nbsp;\r\n\r\nโครงการพัฒนาระบบบริการนิสิตแบบเบ็ดเสร็จ หรือ <strong>One Stop Student Services (OSS)</strong> เป็นการเปลี่ยนภาพลักษณ์และยกระดับ\r\nงานบริการนิสิตให้กับสำนักทะเบียนและประมวลผล โดยสามารถให้บริการด้านงานทะเบียนนิสิตได้อย่างรวดเร็วและมีประสิทธิภาพยิ่งขึ้น\r\n\r\n<strong> </strong>\r\n<h2><strong>OSS </strong><strong>ประสานประโยชน์ </strong><strong>3 ด้าน</strong></h2>\r\n&nbsp;\r\n<h3><strong>นิสิต-บุคลากร-บริหาร</strong></h3>\r\n&nbsp;\r\n\r\n<strong>อาจารย์สหัส ภัทรฐิตินันท์</strong> ผู้อำนวยการสำนักทะเบียนและประมวลผล มหาวิทยาลัยเกษตรศาสตร์ กล่าวว่า <em>สำนักทะเบียนและประมวลผล</em> ต้องการปรับปรุงงานบริการนิสิตให้เป็นระบบเดียวกันทั้งหมด เพื่ออำนวยความสะดวกให้แก่นิสิต ด้วยความรวดเร็ว ถูกต้อง สามารถ ติดตามการดำเนินงานงานได้ และก่อให้เกิดประโยชน์แก่นิสิต\r\n\r\n&nbsp;\r\n\r\nทั้งนี้ยังก่อให้เกิดประโยชน์กับงานด้านบุคลากรและด้านการบริหารงานโดยด้านบุคลากร OSS ช่วยเพิ่มประสิทธิภาพการทำงานของบุคลากร\r\n\r\n&nbsp;\r\n\r\nโดยสามารถตรวจสอบปัญหาต่างๆ ของเอกสารได้ทุกขั้นตอน สามารถติดตามขั้นตอนต่างๆ ของเอกสารได้ (Flow) เพื่อให้ทราบว่า อยู่ในขั้นตอนใด และสามารถคาดการณ์เวลาดำเนินการแล้วเสร็จได้ และประโยชน์ด้านการบริหารงาน\r\n\r\n&nbsp;\r\n\r\nโดยสามารถวัดผลการปฏิบัติงานของบุคลากรรายบุคคล ติดตามการทำงาน ไม่เกิดปัญหางานตกค้าง สูญหาย ทำให้บุคลากรสามารถปฏิบัติงานได้ง่ายยิ่งขึ้น\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28432 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/3connect-1.jpg\" alt=\"\" width=\"720\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nผู้อำนวยการสำนักทะเบียนและประมวลผล กล่าว\r\n\r\n&nbsp;\r\n\r\nโดยสรุป OSS ทำให้เกิดประโยชน์ขึ้นใน 3 ส่วน คือ นิสิต บุคลากร และผู้บริหาร รวมทั้งยังเป็นจุดเริ่มต้นที่จะใช้ในการพัฒนาต่อเพื่อใช้ในหน่วยงานอื่นๆ ด้วย\r\n\r\n&nbsp;\r\n<h3><strong>จุดประกายฝัน “สารสนเทศทั้งระบบ” ในมหาวิทยาลัย</strong></h3>\r\n&nbsp;\r\n\r\nนอกจากระบบทะเบียนประวัตินิสิตที่สำนักทะเบียนและประมวลผล ได้รับประโยชน์ ท่านผู้อำนวยการ ยังมองไปไกลกว่านั้น ด้วยเพราะจุดนี้เป็นการวางรากฐานของการพัฒนาระบบงานในภาพรวมของมหาวิทยาลัย\r\n\r\n&nbsp;\r\n\r\nเมื่อมี “ข้อมูล (Data)” ของนิสิตซึ่งเป็นหัวใจของทุกระบบมาเป็นจุดเริ่มต้นแล้ว จากนี้จะทำให้เกิดการนำไปใช้ต่อยอดได้ไม่ยาก ซึ่งสำนักทะเบียนและประมวลผล มองว่าสามารถนำไปสู่แผนแม่บทสารสนเทศของมหาวิทยาลัย\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nคุณสหัส กล่าว\r\n\r\n&nbsp;\r\n\r\n<strong>ผศ.ดร.จเร เลิศสุดวิชัย</strong> รองผู้อำนวยการ สำนักทะเบียนและประมวลผล มหาวิทยาลัยเกษตรศาสตร์ เสริมว่า ช่วงระยะเวลา 1 ปีที่ผ่านมาเราใช้ OSS พิสูจน์ให้เห็นความสำเร็จตามโจทย์ที่ตั้งไว้ กระทั่งหน่วยงานอื่นสนใจที่จะนำมาใช้ เช่น กองกิจการนิสิต รวมทั้งฝ่ายทะเบียนของวิทยาเขตอีกหลายแห่งขอเข้าร่วมใช้งานด้วย\r\n\r\n&nbsp;\r\n\r\nหากกล่าวถึงบรรยากาศที่เปลี่ยนไปซึ่งเห็นได้ชัดคือ ระบบคิว ปัจจุบันมีลักษณะคล้ายกับธนาคาร พลิกโฉมจากบรรยากาศเดิมๆ ที่นิสิตต้องนั่งรอเรียกชื่อท่ามกลางคนจำนวนมาก ในภาวะอากาศที่ร้อนอบอ้าว โดยไม่รู้เลยว่า เมื่อไรจะถึงคิวตน อีกทั้งมีการลัดคิว และนี่เป็นตัวอย่างที่เห็นบรรยากาศของการเปลี่ยนแปลงอย่างชัดเจน\r\n\r\n&nbsp;\r\n\r\nอีกตัวอย่างหนึ่ง การทำบัตรนิสิต ลดเวลาลงมาก จากที่ต้องทำยื่นคำร้องแล้วรออีกหลายวันกว่าจะกลับมารับบัตร เหลือระยะเวลาการทำบัตรเพียงไม่กี่นาทีเท่านั้น\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-26884 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/07/contract.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nผศ.ดร.จเร กล่าวพร้อมกับ ย้ำว่า ทั้งนี้ทั้งนั้น เรายังเรียกใช้ข้อมูลจากในระบบเดิมที่ดูแลโดยสำนักบริการคอมพิวเตอร์ ซึ่งเราได้พัฒนาระบบ OSS เข้าไปเชื่อมต่อ\r\n\r\n&nbsp;\r\n<h3><strong>ความท้าทายมาพร้อมตัวเลือก</strong></h3>\r\nสิ่งที่ยากที่สุดคือความท้าทาย ที่ ผศ.ดร.จเร ในฐานะผู้รับมอบหมายจากผู้อำนวยการสำนักทะเบียนและประมวลผล ให้ดำเนินการ “เรื่องบุคลากร” คือปัจจัยแรก ถ้าไม่เกิดการยอมรับ ไม่มาจากเป้าหมายร่วมกัน แทบจะไม่มีโอกาสประสบความสำเร็จ\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-27283 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/08/step-narrow-1-1.jpg\" alt=\"\" width=\"750\" height=\"375\" />\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nผศ.ดร.จเร กล่าว\r\n\r\n&nbsp;\r\n\r\nหลังจากทีมพร้อม เป้าหมายพร้อม ได้ออกไปศึกษาดูงานเกี่ยวกับระบบของมหาวิทยาลัยหลายแห่ง และแล้วก็มาถึงจุดที่จะต้องเลือก\r\n\r\n&nbsp;\r\n\r\nผศ.ดร.จเร บอกว่า มีเพียงสองทางเลือกเท่านั้น ทางแรกคือ ใช้ซอฟต์แวร์สำเร็จรูป ทางที่สองคือ ใช้ Customized Software ด้วยการว่าจ้างบริษัทผู้วางระบบมาทำการพัฒนา แต่ด้วยรูปแบบในการทำงานที่ต้องการ ไม่มีความสอดคล้องกับซอฟต์แวร์สำเร็จรูปกว่า 50% ซึ่งจะต้องมีการ Customize ฟังก์ชั่นต่างๆ เพิ่มขึ้น เราจึงตัดสินใจเลือก Customized Software เพราะเป็นทางเลือกที่เหมาะสมและตอบโจทย์กับความต้องการและระบบของมหาวิทยาลัยมากกว่า\r\n\r\n&nbsp;\r\n\r\nจากนั้นสำนักทะเบียนและประมวลผล ได้สรรหา และเปรียบเทียบบริษัทผู้พัฒนา ซึ่งในที่สุดเลือก Optimus  Soft ในเครือ <a href=\"https://www.g-able.com/\">G-ABLE</a>\r\n\r\n&nbsp;\r\n<h3><strong>“บริการ” ข้อได้เปรียบสู่การตัดสินใจเลือก </strong><strong>Optimus Soft</strong></h3>\r\n&nbsp;\r\n\r\nตัวอย่างความสำเร็จของ G-ABLE และ Optimus Soft ที่พัฒนาระบบให้กับ มหาวิทยาลัยเกษตรศาสตร์เป็นเพียงส่วนหนึ่งแต่ไม่ใช่ทั้งหมด เหตุผลหลักคือ “บริการ” ผู้อำนวยการสำนักทะเบียนและประมวลผล บอกว่า บริการเป็นเรื่องที่สำคัญมาก Optimus Soft ได้เปรียบเรื่องการซัพพอร์ตด้านเทคนิคที่ช่วยเราปรับระบบให้ได้ตามที่ต้องการ\r\n\r\n&nbsp;\r\n\r\nขณะที่ ผศ.ดร.จเร เสริมความประทับใจ และกล่าวถึงจุดแข็งว่า ตอนที่ Optimus Soft เข้ามาเก็บ Requirement ก่อนพัฒนาระบบ มีผู้เชี่ยวชาญด้าน Business Analytics ซึ่งเข้าใจ Process ของงานทั้งหมด มีการแนะนำให้คำปรึกษาการออกแบบระบบ ทำให้การพัฒนาระบบเป็นไปอย่างถูกต้อง ตรงกับโจทย์ที่ต้องการ ซึ่งต้องยอมรับว่าทีมเทคนิคของ Optimus Soft มีประสบการณ์ และพร้อมที่จะซัพพอร์ตทุกด้าน\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nผศ.ดร.จเร กล่าว\r\n\r\n&nbsp;\r\n\r\nหนึ่งปีที่ใช้ระบบ OSS พบว่า พลิกโฉมบริการงานทะเบียนและประมวลผล จากการพัฒนาระบบงานไปแล้ว 34 คำร้อง เช่น ลงทะเบียนเรียน, ขอทำบัตรนิสิต, ขอทรานสคริปต์ ฯลฯ จะทำการพัฒนาเพิ่มอีก 5 คำร้องให้สมบูรณ์ภายในปี 2560\r\n\r\n&nbsp;\r\n\r\n<strong>โดยเป้าหมายใหญ่ของ สำนักทะเบียนและประมวลผล ต่อการพัฒนาระบบ </strong><strong>OSS คิด</strong><strong>จากจุดเริ่มต้นที่ต้องการให้เกิดการพัฒนาระบบสารสนเทศในภาพใหญ่ของมหาวิทยาลัยฯต่อไป</strong>\r\n\r\n&nbsp;\r\n<h3><strong>เปิดใจทีมบ่มเพาะ </strong><strong>OSS ส่งต่อการใช้งานให้</strong></h3>\r\nหลังจากผ่านร้อนผ่านหนาว คลุกคลีอยู่กับการร่วมกันคิดและวางแผนกระบวนการต่างๆ ของระบบ OSS มาโดยตลอด มีความภูมิใจ และบอกเป็นเสียงเดียวกันว่า “คุณภาพบริการดีขึ้น”\r\n\r\n&nbsp;\r\n\r\n<strong>นางสาววิรงรอง พัวประเสริฐ </strong>\r\n\r\n\r\n\r\n&nbsp;\r\n\r\n<strong>นางสาววิภา กองเป็ง</strong>\r\n\r\n\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n<strong>นางสาวธนพร มีโพธิ์</strong>\r\n\r\n\r\n\r\n&nbsp;\r\n\r\n<strong>นางสาวพรรณศมน คำสวน</strong>\r\n\r\n\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n<strong>นายรุ่งโรจน์ บุสสา</strong>\r\n\r\n",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "data-center-transformation",
          "title": "Data Center Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "digital-transformation",
          "title": "Digital Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "education",
          "title": "Education"
        },
        {
          "domain": "portfolio_category",
          "slug": "enterprise-business",
          "title": "Enterprise Business"
        },
        {
          "domain": "portfolio_category",
          "slug": "enterprise-communication",
          "title": "Enterprise Communication"
        },
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        },
        {
          "domain": "portfolio_category",
          "slug": "iot-internet-of-things",
          "title": "IoT (Internet of Things)"
        },
        {
          "domain": "portfolio_category",
          "slug": "thailand-4-0",
          "title": "Thailand 4.0"
        },
        {
          "domain": "portfolio_category",
          "slug": "thinking",
          "title": "Thinking"
        }
      ]
    },
    {
      "title": "กรุงเทพประกันภัยยกระดับระบบข้อมูล หนุน ECM พร้อมรับ Big Data",
      "description": "68 ปี แห่งการดำเนินธุรกิจประกันของ “<a href=\"http://www.bangkokinsurance.com/\">กรุงเทพประกันภัย</a>” ที่เติบโตอย่างมั่นคง ซึ่งวันนี้เป็นที่ยอมรับจากคนทั่วไป\r\n\r\n&nbsp;\r\n\r\nโดยมีรางวัลอันทรงเกียรติมากมายเป็นเครื่องการันตี และที่เป็นเกียรติประวัติสูงสุด ด้วยพระมหากรุณาธิคุณล้นเกล้าล้นกระหม่อมอย่างหาที่สุดมิได้ ที่พระบาทสมเด็จพระเจ้าอยู่หัว ทรงพระกรุณาโปรดเกล้าฯ พระราชทานตราตั้งให้แก่บริษัทฯ เมื่อวันที่ 26 เมษายน 2547\r\n\r\n&nbsp;\r\n\r\nซึ่งเปรียบประดุจเอกสารรับรองว่า บริษัทได้ประกอบธุรกิจการค้าโดยซื่อสัตย์ สุจริต ตั้งอยู่ในศีลธรรม มีหลักฐานมั่นคง และเป็นที่เชื่อถือแก่มหาชนทั้งหลาย โดยกรุงเทพประกันภัยมุ่งเน้นการบริหารจัดการด้วยมาตรฐานสากล นำเสนอบริการที่เป็นเลิศ พร้อมทั้งมุ่งพัฒนาเทคโนโลยีที่ทันสมัย\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28443 size-large\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/Bkkins.svg-1-1024x216.png\" alt=\"\" width=\"1024\" height=\"216\" />\r\n\r\n&nbsp;\r\n\r\nสิ่งสำคัญของนโยบายการดำเนินธุรกิจ คือ “ กรุงเทพประกันภัย แคร์คุณทุกย่างก้าว ” ซึ่งเป็นสโลแกนที่สื่อถึงความพึงพอใจสูงสุดของลูกค้าคือเป้าหมายสำคัญของบริษัทฯ สำหรับการพัฒนาองค์กร กรุงเทพประกันภัยได้เลือกสรรแนวทาง\r\n\r\nที่ดีที่สุดเพื่อมอบสิ่งที่ดีที่สุดให้กับลูกค้า โดยเฉพาะด้านเทคโนโลยี สารสนเทศซึ่งเป็นหัวใจในงานบริการลูกค้า และเป็นประโยชน์ต่อการบริหารจัดการ\r\n\r\n&nbsp;\r\n\r\n<strong>ดร.อภิสิทธิ์ อนันตนาถรัตน</strong> ผู้ช่วยกรรมการผู้อำนวยการใหญ่ บริษัท กรุงเทพประกันภัย จำกัด (มหาชน) กล่าวว่า สำหรับการลงทุนด้านเทคโนโลยีสารสนเทศ เราได้เห็นถึงความสำคัญของการนำระบบไอทีมาขับเคลื่อนธุรกิจเพื่อเพิ่มประสิทธิภาพและการบริการลูกค้า-คู่ค้าที่ดี\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28441 size-large\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/ดร.อภิสิทธิ์-1-1024x683.jpg\" alt=\"\" width=\"1024\" height=\"683\" />\r\n\r\n&nbsp;\r\n\r\nโดยได้ดำเนินการปรับปรุง Business Process และจัดตั้ง Corporate Contact Center เพื่อเพิ่มบริการความพึงพอใจของลูกค้าในแต่ละ ช่องทางการขาย และพัฒนา Mobile Application ในการซื้อประกันภัย รวมถึงการ Claim\r\n\r\n&nbsp;\r\n\r\nนอกจากนี้เรายังได้นำ ระบบ <a href=\"http://www.bangkokinsurance.com/BKItelematics/\">Telematics </a>มาใช้ เพื่อศึกษาพฤติกรรมการขับขี่ของลูกค้า ซึ่งลูกค้าสามารถนำมาปรับ พฤติกรรมการขับขี่ให้เกิดความปลอดภัยต่อตนเองและผู้ใช้รถใช้ถนน อื่นๆ ช่วยลดสถิติในการเกิดอุบัติเหตุและความสูญเสียได้อีกทางหนึ่ง\r\n\r\n&nbsp;\r\n\r\n<strong>Enterprise Content Management </strong><strong>เพิ่มประสิทธิภาพข้อมูล-รับแผน DRP &amp; BCP</strong>\r\n\r\n&nbsp;\r\n\r\nอีกหนึ่งโครงการเพื่อพัฒนาระบบการบริหารจัดการข้อมูลองค์กรนั่นคือโครงการ <a href=\"https://www.g-able.com/solutions/enterprise-business-solutions/\"><strong>Enterprise Content Management</strong></a> (ECM) ซึ่งอิมพลีเมนต์และพร้อมใช้งานแล้วนั้น เป็นโครงการที่ตอบโจทย์การขยายตัวของธุรกิจ ซึ่งเมื่อธุรกิจเติบโตย่อมมีเอกสารและข้อมูลที่เพิ่มขึ้น จึงจำเป็นต้องมีระบบที่มีประสิทธิภาพสูง รวดเร็ว รองรับงานที่มีความซับซ้อนและปริมาณมาก\r\n\r\n&nbsp;\r\n\r\nดร.อภิสิทธิ์ เล็งเห็นว่า ระบบบริหารข้อมูล หรือ <strong>Content Management System</strong> เดิมที่กรุงเทพประกันภัยใช้อยู่นั้น ยังไม่สามารถ ตอบสนองความต้องการดังกล่าวได้อย่างเต็มที่ รวมทั้งสิ่งสำคัญที่ยัง ต้องตระหนักถึง 2 ประการคือ\r\n\r\n&nbsp;\r\n\r\nแผนกู้คืนข้อมูลเมื่อเกิดภัยพิบัติหรือ <strong>Disaster Recovery Plan</strong> และ แผนความต่อเนื่องในการดำเนินธุรกิจ เมื่อเกิดภาวะวิกฤต หรือ <strong>Business Continuity Plan</strong>\r\n\r\n&nbsp;\r\n\r\nทั้งสองแผนจำเป็นต้องตอบสนองต่อการดำเนินธุรกิจได้อย่างไม่มีข้อบกพร่องใดๆ เมื่อเกิดเหตุการณ์ที่ไม่คาดคิด ซึ่ง “ ข้อมูลที่มีประสิทธิภาพ ” เป็นส่วนสำคัญของแผนดังกล่าว\r\n\r\n&nbsp;\r\n\r\n“ <em>ECM เป็นระบบที่มีความสำคัญที่จะต้องสามารถทำงานให้สอดคล้อง รับกับแผน DRP และ BCP เมื่อเกิดภาวะวิกฤต เพราะ ECM เป็นระบบเก็บข้อมูล และภาพทั้งหมดขององค์กร และมีการ Replicate Data ไปที่ฝั่ง DR Site อีกทั้งมีระบบที่มีการอินทิเกรตระบบหลัก ๆ ขององค์กร</em> ”\r\n\r\n&nbsp;\r\n<h3><strong>กรุงเทพประกันภัยเลือก “ ECM Solution ”</strong></h3>\r\n&nbsp;\r\n\r\nจากความต้องการของกรุงเทพประกันภัยที่กำเนิดโครงการ ECM ขึ้นมีเป้าหมายเพื่อให้พนักงานสามารถค้นหาข้อมูลเอกสารและภาพรวมทั้งสามารถแก้ไขได้ นอกจากนี้ยังต้องการให้ใช้งานบนเว็บ และ อุปกรณ์พกพาได้โดยมีเงื่อนไขเพื่อจัดเก็บลง <a href=\"https://www.oracle.com/middleware/webcenter/content/index.html\">Oracle WebCenter Content</a>\r\n\r\n&nbsp;\r\n\r\nโดยจะต้องอินทิเกรตกับระบบ Core Application ของบริษัท ควบคู่ไปกับการพัฒนาระบบบริหารการจัดการเอกสาร ( Document Administration System ) สำหรับหน่วยงานต่างๆ และสามารถ ตอบสนองระบบงานได้ภายใต้ข้อกำหนดของ DRP และ BCP ขององค์กร\r\n\r\n&nbsp;\r\n\r\nความต้องการถูกส่งผ่านมายังผู้พัฒนาและวางระบบ ซึ่งจีเอเบิลได้รับ ความไว้วางใจให้รับผิดชอบโครงการนี้ด้วยการอิมพลีเมนต์ ECM Solution ที่จะเป็นซอฟต์แวร์ตัวกลางในการอินทิเกรตระบบเดิมเข้าสู่ Oracle WebCenter Content\r\n\r\n&nbsp;\r\n\r\nโดยเริ่มจากกรุงเทพประกันภัยทำการสรุป Requirement ทั้งหมดให้กับจีเอเบิล เพื่อศึกษาข้อมูลก่อนเริ่มโครงการ จากนั้นได้ทำการสรุป Requirement ร่วมกันเพื่อกำหนดแนวทางการดำเนินการ ผู้ที่มีหน้าที่รับผิดชอบในแต่ละขั้นตอน และ ระยะเวลาการดดำเนินโครงการในแต่ละขั้นตอนให้เหมาะสม ขณะเดียวกันในระหว่างดำเนินการได้มีการ Check Point เพื่อมอนิเตอร์ถึงควาก้าวหน้าของโครงการ และติดตามปัญหาที่เกิดขึ้น\r\n\r\n&nbsp;\r\n\r\nซึ่งจะเป็นประโยชน์ต่อการแก้ไขปัญหาต่าง ๆ “ ECM Solution ทำให้ยูเซอร์สามารถใช้งานสำหรับการดูข้อมูลเอกสาร และรูปภาพ สามารถทำการแก้ไข ตลอดจนการนำเข้า ผ่านทางระบบ Core Application, CRM และ BPM ของบริษัท ทั้งในรูปแบบของเว็บ และอุปกรณ์พกพาเพื่อจัดเก็บลง Oracle WebCenter Content นอกจากนี้ยังรองรับกับการนำเข้าข้อมูลจากบริษัทคู่ค้าต่างๆ ผ่านทาง Email, Excel, XML และ WebService ด้วย” ดร.อภิสิทธิ์ กล่าว\r\n\r\n&nbsp;\r\n<h3><strong>อุปสรรค-ปัญหา-ยาก คือความท้าทาย</strong></h3>\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-25482 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/06/Start-from-beginning.jpg\" alt=\"Start-from-beginning\" width=\"700\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nสิ่งที่เป็นอุปสรรค และท้าทายที่สุด คือช่วงของการอิมพลีเมนต์ระบบ ECM Solution ในขั้นการ Migrate ข้อมูลเอกสารและรูปภาพ จากระบบคอนเทนต์เดิมเข้าสู่ Oracle WebCenter Content ซึ่งทำได้ยาก\r\n\r\n&nbsp;\r\n\r\nเนื่องจากโครงสร้างในการจัดเก็บมีความแตกต่างกัน รวมไปถึงปริมาณข้อมูลที่มีจำนวนมาก ทำให้การ Migrate ข้อมูลทั้งระบบไม่สามารถดำเนินการให้เสร็จทันตามแผนงาน ดังนั้นจึงเกิดแนวทางในการแก้ปัญหาโดยแบ่งการ Migrate ข้อมูล ออกเป็น 2 ส่วน ส่วนแรกทำการ Migrate ข้อมูลล่าสุดย้อนหลัง 2 ปีเข้าสู่ระบบ ส่วนที่สอง คือทยอย Migrate ข้อมูลส่วนที่เหลือเข้าสู่ระบบ\r\n\r\n&nbsp;\r\n\r\n“<em> หลังจาก Go Live ระบบแล้ว ได้ทำการปรับ UI ของระบบ Oracle WebCenter Content ให้สามารถดึงข้อมูลจากระบบคอนเทนต์เดิมได้ ในกรณีที่ยังไม่ได้ Migrate ข้อมูล เพื่อให้การทำงานของยูสเซอร์เป็น ไปโดยสะดวก ไม่ต้องกลับไปดูข้อมูลที่ระบบเดิม ซึ่งจีเอเบิลได้ช่วย พัฒนาให้ระบบมีความยืดหย่นุ และช่วยให้ยูสเซอร์ของเราทำงานง่าย แม้ข้อมูลบางส่วนจะยังไม่ Migrate โดยทีมของจีเอเบิลมีความทุ่มเท และกระตือรือร้นในการแก้ไขปัญหาต่างๆ รวมทั้งมีความชำนาญใน ตัวซอฟต์แวร์ด้วย</em>” ดร.อภิสิทธิ์ เสริม\r\n\r\n&nbsp;\r\n\r\nทั้งนี้ทั้งนั้นความยากของการอิมพลีเมนต์โครงการ ECM คือ การออกแบบ Meta Data และ Document Type, การออกแบบ Folder Structure, การออกแบบ Role Group และ Permission เพื่อให้รองรับกับประเภทเอกสารต่างๆ ทั้งหมด รวมไปถึงสิทธิ์ในการ เข้าถึงข้อมูลเอกสารประเภทนั้นๆ ซึ่งจะต้องออกแบบอย่างเหมาะสม มิฉะนั้นจะส่งผลถึงการดำเนินการ (Performance) ของระบบ รวมถึง การจัดการระบบในภายหลัง\r\n\r\n&nbsp;\r\n\r\nดังนั้นจึงต้องแจกแจงประเภท และ ความสัมพันธ์ของเอกสารทั้งหมดอย่างชัดเจน และต้องทำการจัดแบ่ง กลุ่มของยูสเซอร์ รวมทั้งการกำหนดสิทธิ์การใช้งาน เตรียมพร้อมด้าน Big Data จากข้อมูลจำนวนมากที่เกิดขึ้นในการดำเนินธุรกิจของกรุงเทพประกันภัย อาจจะยังไม่ใช่ Big Data ในวันนี้ แต่ทว่าในอนาคตอันใกล้คงจะกลาย เป็น Big Data\r\n\r\n&nbsp;\r\n\r\nดังนั้นในขณะนี้กรุงเทพประกันภัยอยู่ระหว่างศึกษา แนวทางในการก้าวสู่ Big Data ตลอดจนการอิมพลีเมนต์ในอนาคต และสิ่งที่ขาดไม่ได้คือการใช้ Analytics Tool เพื่อให้เป็นประโยชน์ต่อ การ Claim และ Underwriting ปัจจุบันนี้กรุงเทพประกันภัยมีทีม MIS ที่ทำหน้าที่ดำเนินการด้าน Data Warehouse ซึ่งขณะนี้ได้นำ Data มาแสดงผลผ่าน Business Intelligence ดังนั้นการจะก้าวสู่ Big Data Analytics คงไม่ใช่เรื่อง ที่ต้องเริ่มต้นใหม่ แต่อาจจะต้องศึกษาวิธีการที่จะก้าวสู่ Big Data ให้ เป็นประโยชน์ต่อองค์กรให้มากที่สุดคือประเด็นสำคัญ",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "advanced-technologies",
          "title": "Advanced technologies"
        },
        {
          "domain": "portfolio_category",
          "slug": "big-data-and-analytics",
          "title": "Big Data and Analytics"
        },
        {
          "domain": "portfolio_category",
          "slug": "data-center-transformation",
          "title": "Data Center Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "digital-transformation",
          "title": "Digital Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "fsi-financial",
          "title": "FSI (Financial)"
        },
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        }
      ]
    },
    {
      "title": "Coffee Today พร้อมเสิร์ฟผ่านจอด้วย แอป Cafe Roamer",
      "description": "15 ปีบนเส้นทางธุรกิจกาแฟ “<a href=\"https://www.facebook.com/coffeetodaythailand/\">Coffee Today</a>” ที่เริ่มต้นจากตลาดต่างจังหวัด ก่อนที่จะขยายมายังกรุงเทพฯ จนถึงวันนี้มีกว่า 200 สาขา โดยในจำนวนนั้นเป็นแฟรนไชส์กว่า 170 และจะขยายตัวเพิ่มขึ้นอีกไม่น้อยในรูปแบบไลเซนส์ที่ขายให้กับผู้ประกอบการต่างประเทศ เช่น กัมพูชา ซึ่งปัจจุบันมีสาขาอยู่กว่า 10 แห่ง อีกทั้งยังเตรียมจะขยายตลาดไปยังประเทศลาว สิงคโปร์ และมาเลเซีย\r\n\r\n&nbsp;\r\n\r\n<strong>Coffee Today</strong> จัดได้ว่าเป็นธุรกิจกาแฟสัญชาติไทยที่เติบโตได้อย่างรวดเร็วรายหนึ่งจากจุดนี้พลิกมามองอีกมุมหนึ่งด้านเทคโนโลยี Coffee Today กำลังวางบทบาทใหม่ให้เป็นมากกว่าร้านกาแฟทั่วไปกลายเป็นร้านกาแฟบนมือถือ ซึ่งในที่นี้ได้ถ่ายทอดแนวคิดมุมมองการบริหาร และการนำเทคโนโลยีมาใช้เอาไว้\r\n\r\n&nbsp;\r\n\r\n<strong>คุณวริศ มุกดาสนิท</strong> กรรมการผู้จัดการบริษัทคอฟฟี่ ทูเดย์ จำกัด เล่าย้อนอดีตถึงจุดเริ่มต้นธุรกิจกาแฟตั้งแต่รุ่นคุณพ่อ “คุณสาธิต มุกดาสนิท” ว่า ในระหว่างมองหาธุรกิจใหม่จากที่เป็นตัวแทนจำหน่ายเครื่องดื่มแอลกอฮอล์อยู่ดั้งเดิม ก็ได้ “ตกหลุมรักกาแฟ”\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28482 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/coffeetoday-1.jpg\" alt=\"\" width=\"720\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nจึงได้ศึกษาหาความรู้ กระทั่งซื้อเครื่องมาชงชิมเอง จนได้สูตรตามที่ต้องการ รสชาติเหมาะกับคนไทย จากนั้นราวปี 2544 ได้ทำการเปิดร้านกาแฟร้านแรกในห้างสรรพสินค้าที่ อ.แกลง จ.ระยอง ทำทุกอย่างเองตั้งแต่ออกแบบตกแต่ง ชงเองขายเอง ในชื่อ “กาแฟดอยตุง” มีที่มาจากการนำเมล็ดกาแฟมาจากดอยตุง\r\n\r\n&nbsp;\r\n<h3><strong>ที่มาของชื่อ Coffee Today</strong></h3>\r\n&nbsp;\r\n\r\nจากร้านกาแฟในอำเภอแกลง คุณพ่อได้ขยับขยายไปเปิดร้านในตัวจังหวัดที่ห้างแหลมทอง โดยวางกลยุทธ์ รสชาติคนไทย ราคาเหมาะสม ซึ่งทำให้ประสบความสำเร็จขยายสาขาไปได้กว่า 10 แห่งภายในปีเดียว จนกระทั่งมีคนอยากทำร้านกาแฟกับคุณพ่อ จึงเป็นที่มาทำให้เราได้ศึกษาการทำแฟรนไชส์ และเริ่มขึ้นอย่างจริงจังในปีที่ 2-3 ของกาแฟดอยตุง\r\n\r\n&nbsp;\r\n\r\nพลิกผันอีกครั้งเมื่อตัดสินใจขยายธุรกิจเข้าสู่เมืองกรุง หลังจากที่รุ่งเรืองในระยองอย่างมาก โดยเปิดร้านแรกที่ห้างสรรพสินค้าฟิวเจอร์พาร์ค รังสิต ธุรกิจไปได้ดี แต่แล้วเหตุการณ์ไม่คาดคิดก็เกิดขึ้น “เราถูกขอชื่อคืน” นั่นจึงเป็นจุดเริ่มต้นที่มาของชื่อ Coffee Today\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28483 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/coffeetoday2-1.jpg\" alt=\"\" width=\"720\" height=\"192\" />\r\n\r\n&nbsp;\r\n\r\nคุณวริศ เล่าที่มาของชื่อว่า “คุณพ่ออยากให้ชื่อเป็นภาษาอังกฤษแต่เข้าใจง่าย คนไทยอ่านได้ จึงให้พนักงานช่วยกันตั้งชื่อ ซึ่งชื่อนี้ยังมีความหมายดื่มได้ทุกวัน”\r\n\r\n&nbsp;\r\n<h3><strong>“ร้านกาแฟสดกับโซนไอที” จับมือกันบููม</strong></h3>\r\n&nbsp;\r\n\r\nCoffee Today ขยายสาขาเกาะไปกับการขยายตัวของไอทีในยุคบูมที่ในขณะนั้นแทบทุกห้างเริ่มรุกเปิดโซนไอที โดยมีร้านกาแฟสดผูกเกี่ยวไปด้วย ดังนั้นลูกค้าของ Coffee Today ส่วนใหญ่จึงเป็นคนไอที\r\n\r\n&nbsp;\r\n\r\n“<em>วันนี้เรามีสาขา 33 แห่งมีแฟรนไชส์อีกกว่า 170 ร้าน ความสำเร็จของแฟรนไชส์ เราใช้กลยุทธ์ครอบครัวกาแฟ คือ มองว่าคนที่จะมาร่วมทำธุรกิจเป็นส่วนหนึ่งของครอบครัว ซึ่งเราต้องดูแลอย่างดี ให้คำปรึกษาตั้งแต่ประเมินทำเล คุยกันให้เข้าใจในธรรมชาติของธุรกิจ โดยไม่ได้คิดว่าต้องการจะขายแฟรนไชส์เพียงอย่างเดียวไม่สนใจว่าจะสำเร็จหรือไม่ แต่ด้วยความที่เราเน้นแบรนด์ จึงไม่อยากให้เปิดได้ไม่นานก็ต้องปิดไป</em>”\r\n\r\n&nbsp;\r\n\r\nในการดำเนินธุรกิจ “คุณพ่อสาธิต” ผู้ก่อตั้งธุรกิจกาแฟสดที่จัดว่าเป็นรายแรกๆ ของคนไทย ได้ให้คำขวัญของ Coffee Today ไว้ว่า “รินหัวใจใส่กาแฟ” หรือ “Pull your heart to your cup”\r\n\r\n&nbsp;\r\n<h3><strong>Coffee Today ร้านกาแฟบนมือถือ</strong></h3>\r\n&nbsp;\r\n\r\nเมื่อมาถึงยุคของ คุณวริศ ซึ่งเป็นรุ่นที่สองในการบริหาร ได้พุ่งเป้าไปที่การต่อยอดด้านมาตรฐานการให้บริการเป็นอันดับต้นๆ โดยได้นำระบบเข้ามาใช้ในจุดต่างๆ อาทิ การนำเทคโนโลยีมาช่วยด้านการบริหารจัดการ ด้วยการทำ e-Document, การเชื่อมข้อมูลระหว่างสาขาเพื่อลดปัญหาและเพิ่มประสิทธิภาพการทำงาน รวมทั้งมองหาแอปเพื่อจับร้านกาแฟใส่ไว้บนมือถือ\r\n\r\n&nbsp;\r\n\r\nกระทั่งได้พบกับ <a href=\"https://www.facebook.com/CafeRoamer/?hc_ref=ART8xRjsdkhM2QKJAErVteAM_FH3VVX9E_8KXAC17oBMV3w_D9SpKHfYAiVJE1iIqlg\">Cafe Roamer</a> แอปพลิเคชันจาก G-ABLE ที่ค่อนข้างถูกใจและตัดสินใจได้ทันทีกับการเริ่มต้นทดลองใช้ระบบ\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28496 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/caferoamer-1.jpg\" alt=\"\" width=\"640\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\n“<em>เราใช้เวลา 2 เดือนกับการลงระบบ ทดลองใช้ โดยเฉพาะงานส่วน Audit เพื่อให้มั่นใจในความปลอดภัยเราทดสอบกัน 2 รอบบิลหรือ 2 เดือน ซึ่งปรากฎว่าใช้ได้ดี และเตรียมขยายระบบ Cafe Roamer เข้าไปการใช้งานหน้าร้าน</em>”\r\n\r\nคุณวริศ กล่าวพร้อมกับย้ำว่า…\r\n\r\n&nbsp;\r\n\r\nในระหว่างการทดลองใช้แอปพลิเคชันนั้นรู้สึกได้ว่าผู้ให้บริการมีความพร้อมในการดูแลในทุกขั้นตอนของการทำงาน มีการหารือพูดคุยเพื่อปรับให้เหมาะสมกับการใช้งานให้ดีที่สุด\r\n\r\n&nbsp;\r\n\r\nสำหรับการขยายไปยังหน้าร้าน จะเริ่มใช้ในช่วงไตรมาสสองของปีนี้ โดยเริ่มจากสาขาในเทสโก้โลตัส 3 สาขา คือ สำนักงานใหญ่ - นวมินทร์, สาขาบางกะปิ และสาขาพระราม 4 ซึ่งการขยายนี้เป็นจุดเริ่มต้นก้าวสู่ตัวเลือกใหม่ของ Coffee Today “ร้านกาแฟบนมือถือ” ด้วยแอป Cafe Roamer\r\n\r\n&nbsp;\r\n\r\n<strong>Cafe Roamer</strong> ร้านกาแฟบนมือถือในแนวคิดของ คุณวริศ คือ ต้องการเข้าถึงลูกค้า ใกล้ชิดกับลูกค้าให้มากที่สุด ซึ่งแอปบนมือถือตอบโจทย์ได้ตรงจุดที่สุด เพราะลูกค้าสามารถสั่งล่วงหน้า สั่งผ่านออนไลน์ รับข้อมูลโปรโมชั่น และสินค้าใหม่ได้\r\n\r\n&nbsp;\r\n\r\nขณะที่ร้านมองว่า Cafe Roamer เป็นเครื่องมือทางการตลาดด้วยการมีระบบที่สามารถเสนอโปรโมชั่นและสินค้าใหม่ให้แก่ลูกค้าได้โดยตรง และที่สำคัญระบบของ Cafe Roamer ทำให้ Coffee Today จัดการกับระบบสมาชิกได้เป็นอย่างดี โดยทำให้มีรายชื่อลูกค้า มีข้อมูลการสั่งสินค้าจากลูกค้า ซึ่งสามารถนำข้อมูลมาทำการตลาดหรือ CRM (Customer Relationship Management) เพื่อเข้าถึงความต้องการของลูกค้าได้ตรงกับความชอบ\r\n\r\n&nbsp;\r\n\r\n“ผมคาดหวังให้ Cafe Roamer เข้ามาใช้แทนที่บัตรสมาชิกแบบเดิมที่เราพยายามทำ ซึ่งที่ผ่านมาทำได้ไม่สมบูรณ์ แต่ Cafe Roamer จะเข้ามาตอบโจทย์ความต้องการในจุดนี้ได้เลย โดยจะทำให้ Coffee Today มีระบบ\r\n\r\n&nbsp;\r\n\r\nสมาชิกแบบอิเล็กทรอนิกส์ที่มีข้อมูลลูกค้าครบถ้วน นำไปต่อยอดพัฒนาการตลาดได้ มีการสะสมแต้มที่เป็นระบบมากขึ้น รวมทั้งข้อมูลจะสามารถเชื่อมโยงระหว่างสาขาได้ด้วย ในขณะที่ด้านงานบริการ Cafe Roamer จะช่วยให้ Coffee Today สามารถบริหารจัดการคิวการสั่งซื้อของลูกค้าได้ โดยสามารถวางแผนเพื่อจัดระบบบริการลูกค้าในช่วงเวลาเร่งด่วนได้ดีขึ้น\r\n\r\n&nbsp;\r\n<h3><strong>“Cafe Roamer” ประทับใจแอป-ประทับใจบริการ</strong></h3>\r\n&nbsp;\r\n\r\nด้วยจุดเด่นของ Cafe Roamer ในมุมมองคุณวริศ คือ มีระบบเติมเงินที่มีความปลอดภัย และมีการรายงานผ่านมือถือทันทีที่เติมเงิน หรือใช้จ่ายทำให้ตอกย้ำความมั่นใจต่อลูกค้า ซึ่งจุดเด่นนี้เองที่ทำให้ Coffee Today เลือก Cafe Roamer ทั้งที่มีแอปตัวเลือกอีกมากมายที่ได้มีการนำเสนอเข้ามา\r\n\r\n&nbsp;\r\n\r\nแต่อย่างไร Coffee Today ก็ยังมีความต้องการเพิ่มเติม นอกจากระบบสมาชิกยังอยากให้มีระบบคูปอง, แจกใบปลิว, โปรโมชั่นหรือการสื่อสารส่งข้อความเป็นข้อมูลด้านการตลาดถึงมือลูกค้าโดยตรง ซึ่งด้วยระบบ Cafe Roamer ไม่ได้เป็นเรื่องยากที่จะพัฒนาต่อยอดต่อไป\r\n\r\n&nbsp;\r\n\r\nจุดนี้จึงจัดว่า เป็นความประทับใจในแอปดังกล่าวสำหรับความประทับใจด้านบริการ ต้องยอมรับว่าทีม G-ABLE มีความเป็นมืออาชีพ มีการประสานงานที่ดี มีการติดตามงาน ให้คำปรึกษาแนะนำ และช่วยปรับแต่งแอปให้เหมาะสมกับความต้องการของ Coffee Today ด้วยความประทับใจทั้งด้านแอปและบริการ ทำให้ Coffee Today รุกสู่การนำเทคโนโลยีมาใช้ทั้งงานหลังบ้านและงานหน้าร้าน ด้านการตลาด การบริการได้เป็นอย่างดี\r\n\r\n&nbsp;\r\n\r\n<strong>คุณวริศ มุกดาสนิท</strong>\r\n<em>ผู้บริหารธุรกิจกาแฟสายพันธุ์ไทยไฟแรง</em>\r\n\r\n&nbsp;\r\n\r\nคุณวริศ เป็นนักบริหารหนุ่มไฟแรงที่เข้ามารับช่วงงานของ Coffee Today ต่อจากคุณพ่อสาธิต ทั้งที่เรียนจบทางด้านวิศวกรรมศาสตร์ สถาปัตยกรรม ซึ่งไม่เกี่ยวข้องกับกาแฟ แต่ด้วยความที่เป็นธุรกิจของครอบครัว บวกกับความชอบกาแฟ ทำให้คุณวริศ “บริหารด้วยหัวใจ” เขาเริ่มต้นจากการศึกษาหาความรู้เรื่องกาแฟ, ธุรกิจกาแฟ, ลงรายละเอียดไปถึงรสชาติกาแฟที่คนไทยชอบ แม้จะเป็นโจทย์ที่ยากสำหรับคนที่เรียนมาอีกด้าน แต่สำหรับคุณวริศแล้ว “เป็นความท้าทาย”\r\n\r\n&nbsp;\r\n\r\nจุดเริ่มต้นของนักบริหารหนุ่มไฟแรง ย้อนไปเมื่อราว 4 ปีที่แล้ว เขาทำทุกอย่างตั้งแต่งานหน้าร้าน ทั้งชง เสิร์ฟ, นำเสนอสินค้า และบริการลูกค้า รวมทั้งคิดโปรโมชั่น\r\n\r\n&nbsp;\r\n\r\n“ผมไม่ได้ทำก็แค่ขับรถส่งของ นอกนั้นผมทำมาหมดแล้ว” การทำงานทุกอย่างทำให้คุณวริศรู้ทุกเรื่อง และที่สำคัญ “รู้จักลูกค้า”\r\n\r\n&nbsp;\r\n\r\nสำหรับคนรุ่นใหม่ที่ก้าวสู่การเป็นผู้บริหาร ซึ่งไม่ใช่เรื่องง่ายหากแต่มาพร้อมกับความท้าทาย ซึ่งคุณวริศมีปรัชญาในการทำงานที่มีความคิด\r\nในแบบผู้บริหารรุ่นใหม่ไฟแรงอีกคนที่น่าจับตามอง เขาชอบการเปลี่ยนแปลง โดยมองว่า…\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nนั่นคือมุมมองของคุณวริศ ผู้บริหารธุรกิจกาแฟสายพันธุ์ไทยไฟแรง\r\n\r\n&nbsp;",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "advanced-technologies",
          "title": "Advanced technologies"
        },
        {
          "domain": "portfolio_category",
          "slug": "cloud-applications",
          "title": "Cloud Applications"
        },
        {
          "domain": "portfolio_category",
          "slug": "digital-marketing",
          "title": "Digital Marketing"
        },
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        },
        {
          "domain": "portfolio_category",
          "slug": "smes-and-startups",
          "title": "SMEs &amp; Startups"
        }
      ]
    },
    {
      "title": "Café Roamer เรายกกาแฟเกรดดีมาไว้บนมือถือ",
      "description": "<em>จากคนที่ไม่ชอบดื่มกาแฟ ก้าวมาสู่การเป็นนักชิมกาแฟระดับโลกที่เป็นชาวไทยคนแรก ซึ่งได้รับประกาศนียบัตร Q-Grader จากสมาคมกาแฟชนิดพิเศษแห่งสหรัฐอเมริกา (SCAA) รวมถึงเป็นคนไทยคนแรกที่ได้รับความเชื่อถือให้นั่งเป็นหนึ่งในกรรมการ International Jury (กรรมการ</em><em>ด้านรสชาติจากหลายประเทศ) Cup of Excellence ในการประกวดเฟ้นหากาแฟที่ดีที่สุดของโลก</em>\r\n\r\n<!--more-->\r\n\r\n&nbsp;\r\n\r\nปัจจุบัน <strong>คุณซาน - ชาตรี ตรีเลิศกุล</strong> เป็นเจ้าของร้านกาแฟ <a href=\"https://www.facebook.com/zanasbean/\">Zana’s Bean Coffee</a> (ซาน่าส์บีนส์ คอฟฟี่) จำนวน 4 สาขา และร้านกาแฟระดับพรีเมี่ยม ที่เฟ้นหากาแฟดีจากทั่วโลกมาคั่วเอง ในชื่อร้าน <a href=\"https://www.facebook.com/pacamaracoffee/\">Pacamara </a>(พาคามาร่า) อีก 4 สาขาในเมืองไทย และอีก1 สาขาโดยให้สิทธิพันธมิตรรายหนึ่งไปเปิดในสิงคโปร์ รวมทั้งเตรียมขยายเพิ่มอีก 1 สาขาที่ทองหล่อ\r\n\r\n&nbsp;\r\n\r\nโดยจะเปิดร่วมไปกับสถาบันสอนความรู้ด้านกาแฟ ซึ่งพร้อมเปิดตัวปี 2559 นี้ เพื่อสร้างความครบวงจรทางธุรกิจที่มีทั้งโรงคั่วกาแฟ ธุรกิจจัดจำหน่ายอุปกรณ์การทำกาแฟ ตลอดจนแบรนด์เมล็ดกาแฟของตัวเอง\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28539 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/pacamara-zaancoffee-1.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\n“<em>ตั้งแต่เด็กไม่เคยสนใจ และไม่ชอบดื่มกาแฟเลย เพราะไม่ชอบรสชาดและกลิ่นสังเคราะห์ของกาแฟสำเร็จรูป จนกระทั่งเมื่อ 15 ปีที่แล้ว ระหว่างใกล้จบการศึกษา มีโอกาสไปเที่ยวต่างประเทศ ก็ได้เห็นว่ามีร้านกาแฟอยู่ทุกหัวระแหงของทุกเมือง มีคนใช้บริการมากมาย ทำให้เกิดความคิดขึ้นมาว่า ทำไมเมืองไทย ยังไม่มีร้านประเภทนี้</em>”\r\n\r\n&nbsp;\r\n\r\nจากนั้นไม่นาน ก็มีกาแฟแบรนด์ดังจากเมืองนอกขยายสาขาเข้ามาประเทศไทย ซึ่งเป็นแบรนด์เดียวกับที่เคยเห็นระหว่างไปเที่ยวครั้งนั้น ประกอบกับเป็นช่วงที่ต้องทำวิทยานิพนธ์ จึงเกิดไอเดียว่าเมื่อเรียนจบ อยากทำธุรกิจของตัวเอง และควรเป็นธุรกิจที่ตัวเองเข้าสู่ตลาดในช่วงต้นๆ เพื่อสะดวกในการทำธุรกิจ\r\n\r\n&nbsp;\r\n\r\nดังนั้น จึงตัดสินใจค้นคว้าข้อมูลเกี่ยวกับธุรกิจการเปิดร้านกาแฟเพื่อทำเป็นผลงานส่งอาจารย์ และหาความรู้ในการออกมาทำธุรกิจนี้หลังจบการศึกษา\r\nประเดิมธุรกิจร้านกาแฟร้านแรก โดยออกแบบจัดสร้างในรูปลักษณ์ “รถเข็น” หนึ่งคัน ตระเวณออกร้านขายตามพื้นที่ออฟฟิศ หรืออีเวนท์ต่างๆ ในลักษณะโมบาย ก่อนที่จะได้พื้นที่ตั้งประจำที่โลตัส สาขาพระราม 3 เป็นเวลา 6 เดือน\r\n\r\n&nbsp;\r\n\r\nซึ่งแม้ไม่ประสบความสำเร็จตามที่คาดหวัง แต่ก็ได้เรียนรู้ครั้งสำคัญ เกี่ยวกับพฤติกรรมผู้บริโภค ให้เข้าใจว่า “คนซื้อกาแฟเพราะอะไร” จนนำมาสู่การตีโจทย์ว่า ทำไมร้านนั้นคนเยอะ แต่ของเราคนไม่เยอะตาม และต่อยอดสู่ความท้าทายใหม่ด้วยการเปิดเป็น “ร้าน” แห่งแรก ที่อาคารปัญจธานี เมื่อปี 2542 โดยลงทุนเพิ่มเติมออกแบบเป็นมุมกาแฟ และขยายสาขาต่อเนื่องถึงปัจจุบัน\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28552 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/coffeeshop-1.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nด้วยเป้าหมายตั้งแต่เริ่มก่อตั้งธุรกิจที่วาง positioning ตัวเองไว้เป็น “ร้านกาแฟหัวก้าวหน้า” ที่ไม่เคยเดินตามแนวทางของ chain กาแฟแบรนด์ใหญ่ๆ อย่างที่ผู้ประกอบการร้านกาแฟส่วนใหญ่เลือกทำ ดังนั้น จึงมุ่งพัฒนาเอกลักษณ์ของร้าน Zana’s Bean Coffee และ Pacamara อย่างต่อเนื่องเพื่อสร้างความโดดเด่น ทั้งการคัดสรรวัตถุดิบคุณภาพ การพัฒนาเมนู\r\n\r\n&nbsp;\r\n\r\nจนล่าสุดคือ การนำเทคโนโลยีมาเป็นเครื่องมือช่วยในงานบริหารจัดการทั้งในส่วนของตัวร้าน และการ “เสิร์ฟ” กาแฟดีถึงมือผู้บริโภคได้ง่ายยิ่งขึ้น และยังเป็น “สื่อ” ในการสร้างให้ลูกค้าเข้าถึงและรู้จักกาแฟดีได้ในวงกว้างกว่าเดิม ตอบโจทย์ความคาดหวังในฐานะนักชิมกาแฟระดับโลก ที่ต้องการพัฒนาวงการการดื่มกาแฟในประเทศไทย ในรูปแบบที่มีคุณภาพมากขึ้น\r\n\r\n&nbsp;\r\n\r\nโดยนำเอาความคิดเห็นและข้อเสนอของลูกค้ามาเป็นโจทย์ในการทำงานร่วมกับบริษัท จีเอเบิล จำกัด พัฒนาโปรแกรมด้าน Customer Loyalty มุ่งเอื้ออำนวยความสะดวกให้ผู้ซื้อ ผู้ขาย หาโอกาสช่องทางการจัดจำหน่ายมากขึ้น\r\n\r\n&nbsp;\r\n<h4>จนออกมาเป็นแอปพลิเคชัน <a href=\"https://www.facebook.com/CafeRoamer/?hc_ref=ART8xRjsdkhM2QKJAErVteAM_FH3VVX9E_8KXAC17oBMV3w_D9SpKHfYAiVJE1iIqlg\">Café Roamer</a> ภายใต้แนวคิดว่า “ด้วยเทคโนโลยี Smart Application เมนูโปรดของคุณพร้อมบริการถึงที่สะดวกเพียงปลายนิ้ว ให้คุณใช้นาทีผ่อนคลายอย่างคุ้มค่า\"</h4>\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28496 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/caferoamer-1.jpg\" alt=\"\" width=\"640\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\n“<em>เรามีแนวคิดที่จะค่อยๆ ปรับรูปแบบร้าน Zana’s Bean Coffee ให้เป็นร้านกาแฟชุมชน ที่มีความทันสมัย โดยจะมีความ flexible เมนูหลากหลาย</em>\r\n<em> ราคาไม่สูง ดังนั้น การเอาแอปฯ มาช่วยจะขับเคลื่อนความคาดหวังได้ดีขึ้นอย่างแน่นอน เพราะในแง่ความเป็น mass ที่นำเสนอเครื่องดื่มที่แตกต่างจากกาแฟเจ้าอื่น ถ้าลูกค้าได้มีโอกาสได้ลอง ได้เข้าใจมากขึ้นก็จะเรียนรู้ได้มากขึ้น</em>”\r\n\r\n&nbsp;\r\n\r\nปัจจุบันเปิดให้ลูกค้า Zana’s Bean Coffee สาขาอาคารปัญจธานี และธนาคารแห่งประเทศไทยทั้ง 2 สาขา เข้าไปดาวน์โหลดแอป <a href=\"https://www.facebook.com/CafeRoamer/?hc_ref=ART8xRjsdkhM2QKJAErVteAM_FH3VVX9E_8KXAC17oBMV3w_D9SpKHfYAiVJE1iIqlg\">Café Roamer</a> และ QRCode ได้ที่<a href=\"http://www.caferoamer.com/download.html\">เว็บไซต์</a>  รองรับทั้งระบบปฏิบัติการ Android และ iOS และในเร็วๆ นี้จะขยายผ่านช่องทาง <a href=\"https://play.google.com/store/apps/details?id=com.gable.caferoamer.zana\">App Store</a> รวมถึงครอบคลุมจำนวนสาขาอื่นของร้านด้วย\r\n\r\n&nbsp;\r\n\r\nทั้งนี้ เมื่อเข้าไปทำการดาวน์โหลดจะมีเมนูพร้อมภาพสกรีนช็อต แนะนำการลงทะเบียน ตลอดจนคำแนะนำในการใช้งานทุกขั้นตอน โดยแอปฯ นี้ สามารถใช้งานเสมือนเป็น e-wallet โดยลูกค้าที่ลงทะเบียนและได้รับรหัสยืนยันสมาชิกแล้ว จะสามารถเติมเงินเข้าระบบเพื่อใช้จ่ายได้ผ่านเคาท์เตอร์ของ Zana’s Bean สาขาที่ใช้บริการประจำ โดยมีเงื่อนไขการเติมเงิน ขั้นต่ำ 200 บาท เพื่ออำนวยความสะดวกในการเลือกสั่งเมนูล่วงหน้า โดยเข้าไปดูรายการทั้งหมดจากที่หน้าเมนูในแอปฯ สามารถเลือกสถานที่จัดส่ง หรือมารับที่หน้าร้านได้\r\n\r\n&nbsp;\r\n\r\n“<em>ที่ผ่านมา ร้านกาแฟแทบทุกรายใช้แอปฯ ลักษณะนี้ เฉพาะในเรื่องการสะสมแต้มและบัตรสมาชิกเป็นหลัก แต่เรามองไกลกว่านั้น คือ การสร้างกิจกรรมสื่อสารระหว่างร้านค้ากับลูกค้าผ่านแอปฯ การสั่งซื้อผ่านช่องทางนี้ จะได้ราคาโปรโมชั่นพิเศษ ได้สิทธิพิเศษมากกว่าซื้อแบบทั่วไป สอดคล้องกับปรัชญาการทำธุรกิจของเราคือ มอบสิ่งที่มากกว่าความคาดหวัง ลูกค้าจึงเปลี่ยนแบรนด์ไปลองที่อื่นน้อยลง</em>”\r\n\r\n&nbsp;\r\n\r\nคุณซาน เสริมว่า พฤติกรรมลูกค้า Zana’s Bean คือ ไม่อยากรอ ดังนั้นเมื่อใช้แอปฯ ในการชำระเงินได้ง่ายชึ้น ลูกค้าก็มี loyalty มากขึ้น เพราะส่วนหนึ่งคือ ลูกค้าเคยชินกับการทำกิจกรรมต่างๆ ผ่านสมาร์ทโฟนที่อยู่ติดมืออยู่แล้ว ผนวกกับมียอดเงินอยู่ในบัตร การตัดสินใจจึงง่ายขึ้น\r\n\r\n&nbsp;\r\n\r\nพร้อมกันนี้ เปรียบเทียบสถานการณ์ก่อน และหลังการนำแอปฯ Café Roamer เข้ามาใช้เมื่อราว 2 ปีที่ผ่านมาว่า ประโยชน์ที่เห็นได้ชัด คือ ทำให้\r\nลูกค้ามี loyalty มากขึ้น, การบริหารจัดการช่วงเวลาที่เป็น peak hour และ off-peak, การบริหารจัดการคิวของลูกค้า, ช่วยจัดการเรื่องการทุจริตในการรับเงินสด ทำให้ยอดเงินเข้ามาเต็มเม็ดเต็มหน่วย, ทำให้ร้านค้าสามารถรู้โปรไฟล์ข้อมูล การซื้อของลูกค้า เช่น เมนูที่ขายดี ทำให้สามารถนำข้อมูลไปปรับปรุงพัฒนาเรื่องของการจัดการสต็อกได้มากขึ้น\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28551 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/coffeecup-1.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nขณะที่ ในส่วนของการเป็นเครื่องมือช่วยบริหารจัดการ สิ่งที่ผู้ประกอบการร้านกาแฟจะได้รับ คือ การรู้ช่วงเวลา และสร้างช่วงเวลาที่เป็นจุดบอดของร้านค้า โดยจากประสบการณ์ที่สัมผัสโดยตรง ก็คือ การปิดจุดอ่อนเรื่อง “พื้นที่” สำหรับร้านค้าหรือสาขาตั้งอยู่ในทำเลที่เป็นรอง\r\n\r\n&nbsp;\r\n\r\nโดยทำให้มีความโดดเด่นมากขึ้น เนื่องจากลูกค้าสามารถสื่อสารและเข้าถึงผ่านโซเชียลได้มากขึ้น เช่นเดียวกับร้านค้าก็สามารถโปรโมทร้านผ่านช่องทางเดียวกันนี้ได้มากขึ้น “ทำให้ในอนาคต เรื่องทำเลที่เป็นรองจะหมดไป ทำให้เราได้ลูกค้าขยายรัศมพื้นที่ครอบคลุมจากลูกค้าทั่วไปของธุรกิจนี้ จะไม่เกนิ รัศมี 50-100 เมตรจากตำแหน่งที่ตั้ง โดยจะขยายกว้างออกไปอีก เพราะเป็นลูกค้าที่ใช้บริการแบบกึ่ง drive-through มากขึ้นด้วย\r\n\r\n&nbsp;\r\n\r\nทางด้านการบริหารจัดการช่วงเวลานั้น ก็สามารถใช้เรื่องโปรโมชั่น มาจัดการเรื่องช่วงเวลา off-peak ได้ ในช่วง peak พนักงานเราก็สามารถทุ่มเทเวลาในการให้บริการ แต่ช่วง off-peak เราก็สามารถสร้างยอดขายจากตัวแอปฯ ได้\r\n\r\n&nbsp;\r\n\r\n“<em>ในอนาคต อยากให้มีการติดต่อสื่อสารระหว่างผู้ที่มีแอคเคาน์อยู่ในแอปฯ กับทางร้านทำได้มากขึ้น ตลอดจนการตลาดผ่านแอปฯ ครอบคลุมยิ่งขึ้นให้เราอัพเดทข้อมูลโดยการ push แคมเปญตลาดต่างๆ เข้าไปที่ตัวแอปฯ ได้มากขึ้น, การสะสมแต้มที่สามารถวัดสถิติได้ เพื่อที่สามารถนำข้อมูลมาทำกิจกรรมโปรโมชั่นให้กับลูกค้าได้ดียิ่งขึ้นตามคะแนนสะสม</em>” คุณซาน กล่าวปิดท้าย",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "advanced-technologies",
          "title": "Advanced technologies"
        },
        {
          "domain": "portfolio_category",
          "slug": "cloud-applications",
          "title": "Cloud Applications"
        },
        {
          "domain": "portfolio_category",
          "slug": "digital-marketing",
          "title": "Digital Marketing"
        },
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        },
        {
          "domain": "portfolio_category",
          "slug": "smes-and-startups",
          "title": "SMEs &amp; Startups"
        }
      ]
    },
    {
      "title": "G-ABLE ยกระดับความปลอดภัย ด้วยมาตรฐาน ISO 27001 : 2013 ตอบโจทย์ลูกค้าทั่วโลก",
      "description": "ในโลกของธุรกิจ ข้อมูลถือเป็นส่วนสำคัญ อย่างยิ่งต่อการแข่งขันในปัจจุบัน เพราะเป็นเสมือนรากฐาน<!--more-->ต่อการพัฒนาแนวทางและ ทิศทางธุรกิจในอนาคต\r\n\r\n&nbsp;\r\n\r\nองค์กรต่างๆ จึงให้ ความสำคัญต่อความปลอดภัยในข้อมูลมากขึ้น และเพื่อสร้างความเชื่อมั่นให้กับกลุ่มธุรกิจ ทั้งในและต่างประเทศ\r\n\r\n&nbsp;\r\n\r\n<strong>\"</strong> <strong>G-ABLE พร้อมแล้ว เพื่อก้าวสู่ ISO/ IEC 27001 : 2013 \" </strong> มาตรฐานด้านความมั่นคงปลอดภัยของข้อมูล สารสนเทศ ตอกย้ำคุณภาพการให้บริการ ด้านข้อมูลและสร้างความเชื่อมั่น เพิ่มเติมจาก มาตรฐานความปลอดภัยอื่นๆ ในระดับสากล ที่ทาง G-ABLE ให้ความสำคัญในการรองรับ การให้บริการแก่กลุ่มธุรกิจในตลาดโลก\r\n\r\n&nbsp;\r\n\r\nโดยสร้างความแข็งแกร่งในมาตรฐานความปลอดภัยที่มีอยู่เดิม ซึ่งตลอดเวลาที่ผ่านมา G-ABLE ให้ความสำคัญด้านความปลอดภัย ข้อมูลลูกค้าต่อเนื่องมาโดยตลอด เห็นได้จากการเข้าสู่มาตรฐาน ต่างๆ และผ่านการตรวจสอบที่เข้มงวดในช่วงหลายปีที่ผ่านมา\r\n\r\n&nbsp;\r\n\r\nจึงสามารถต่อยอดสู่มาตรฐาน <a href=\"https://www.iso.org/standard/54534.html\">ISO/ IEC 27001 : 2013</a> เพื่อขยายฐาน สู่การให้บริการระดับโลก เป้าหมายสำคัญคือ เพิ่มความเชื่อมั่นให้กับ คู่ค้าในธุรกิจ กับการแข่งขันด้านการให้บริการข้อมูลในตลาดโลก ตอบโจทย์ความต้องการของลูกค้าได้ตรงตามวัตถุประสงค์\r\n\r\n&nbsp;\r\n\r\n<img class=\"wp-image-18501 size-full aligncenter\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/01/K.Pongthep.jpg\" alt=\"\" width=\"468\" height=\"380\" />\r\n\r\n<strong>คุณพงศ์เทพ วัฒนศิริสุข</strong> ผู้อำนวยการอาวุโส ฝ่ายงานบริหาร โครงการ บริษัท\r\n\r\nจีเอเบิล จำกัด กล่าวว่า\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n<h3><strong>G-ABLE ย้ำชัด ISO/ IEC 27001 : 2013 (ISMS)</strong></h3>\r\n<h3><strong>สำคัญต่อข้อมูล</strong></h3>\r\n&nbsp;\r\n\r\nปัจจุบันมีกฏหมายเกี่ยวกับ<a href=\"https://ictlawcenter.etda.or.th/de_laws/detail/de-laws-data-privacy-act\">การคุ้มครองข้อมูลส่วนบุคคล</a> (Data Privacy Law) มากขึ้น เช่นเดียวกับกฏหมายเกี่ยวกับการกระทำความผิดด้านคอมพิวเตอร์ “<a href=\"http://www.finearts.go.th/chantaburilibrary/plugins/2012-11-27-14-10-05/%E0%B8%9E%E0%B8%A3%E0%B8%9A/item/%E0%B8%9E%E0%B8%A3%E0%B8%B0%E0%B8%A3%E0%B8%B2%E0%B8%8A%E0%B8%9A%E0%B8%B1%E0%B8%8D%E0%B8%8D%E0%B8%B1%E0%B8%95%E0%B8%B4%E0%B8%A7%E0%B9%88%E0%B8%B2%E0%B8%94%E0%B9%89%E0%B8%A7%E0%B8%A2%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%81%E0%B8%A3%E0%B8%B0%E0%B8%97%E0%B8%B3%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1%E0%B8%9C%E0%B8%B4%E0%B8%94%E0%B9%80%E0%B8%81%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%A7%E0%B8%81%E0%B8%B1%E0%B8%9A%E0%B8%84%E0%B8%AD%E0%B8%A1%E0%B8%9E%E0%B8%B4%E0%B8%A7%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8C-%E0%B8%9E%E0%B8%A8-2550.html\">พรบ.ว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์</a>” ซึ่งมีการเพิ่มบทลงโทษที่มากขึ้น\r\n\r\n&nbsp;\r\n\r\nจึงชี้ให้เห็นถึงความใส่ใจขององค์กรต่อความปลอดภัยข้อมูล ดังนั้น องค์กรที่มีความเกี่ยวข้องกับข้อมูลของลูกค้า อย่างเช่น บริษัท ด้านไอที บริษัทที่ปรึกษา สื่อสารมวลชน Banking, Finance, Security, Insurance, Telecom, Marketing หรือ Advertisement ก็เข้าข่ายในมาตรฐาน ISO/ IEC 27001 ด้วยกันทั้งสิ้น\r\n\r\n&nbsp;\r\n\r\nอย่างไรก็ดี ขึ้นอยู่กับปัจจัยหลายด้าน เพื่อที่จะให้ผ่านการรับรอง ต้องมองถึงความพร้อมในด้านบุคลากร การดูแลและการพัฒนาอย่างต่อเนื่อง เพราะมาตรฐานดังกล่าว จะมีการตรวจสอบซ้ำในทุกปีอีกด้วย\r\n\r\n&nbsp;\r\n\r\nไม่ว่าจะเป็นการตรวจสอบพื้นฐานหรือหลังจากมาตรฐานมีการเปลี่ยน เวอร์ชั่นก็ตาม ISO/ IEC 27001 จึงถือเป็นมาตรฐานที่องค์กรต่างๆ ควรยึดถือเพื่อความปลอดภัย แต่จะขอการรับรองหรือไม่ ก็ขึ้นอยู่กับ ความพร้อมขององค์กรแต่ละแห่ง\r\n\r\n&nbsp;\r\n\r\n<strong>ยึดหลัก CIA สร้างความเชื่อมั่น</strong> หากองค์กรสามารถดำเนินธุรกิจได้อย่างต่อเนื่องและมีข้อมูลที่พร้อม สำหรับการใช้งาน เกิดความปลอดภัย ย่อมส่งผลให้เกิดความมั่นคง ต่อธุรกิจ ดังนั้นความสำคัญในการจัดการข้อมูลตามมาตรฐาน ISO/ IEC 27001 : 2013 จึงต้องอาศัยหลักการสำคัญ เพื่อให้บรรลุผลตาม เงื่อนไขที่เรียกว่า CIA ซึ่งประกอบไปด้วย\r\n\r\n&nbsp;\r\n\r\n<img class=\"aligncenter wp-image-28826 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/ciatriad-1.jpg\" alt=\"\" width=\"320\" height=\"289\" />\r\n\r\n&nbsp;\r\n\r\n<strong>C : Confidentiality</strong> เป็นการสร้างความมั่นใจให้กับผู้ใช้ ในการเข้าถึง ข้อมูลสำคัญตามสิทธิ์สำหรับผู้ที่ได้รับอนุญาตเท่านั้น มีการกำหนด รูปแบบการเข้าถึงให้ชัดเจน เช่น ข้อมูลสำคัญมากน้อยเพียงใด เผยแพร่ได้เฉพาะแผนกหรือตัวบุคคล โดยจัดสรรเป็นระดับผู้ใช้ที่ต่างกัน ออกไป\r\n\r\n&nbsp;\r\n\r\n<strong>I : Integrity</strong> ข้อมูลมีความถูกต้อง ครบถ้วนและสมบูรณ์ แม้จะ หลากหลายที่มา ก็ต้องถูกปรับให้ข้อมูลถูกต้องเพียงหนึ่งเดียว รวมถึง มีการ Tag หรือยืนยันตัวตนของผู้ที่เข้าถึงข้อมูลในแต่ละครั้งได้อีกด้วย ทุกข้อมูลจะถูกตรวจสอบเส้นทางและป้องกันการแก้ไขไฟล์โดยผู้ที่ ไม่ได้รับอนุญาต เพื่อให้มั่นใจว่าข้อมูลที่ถูกจัดเก็บเอาไว้เหล่านั้นมี ความถูกต้องและเป็นความลับอย่างแท้จริง\r\n\r\n&nbsp;\r\n\r\n<strong>A : Availability</strong> ความพร้อมในการใช้งาน ข้อมูลต้องพร้อมสำหรับการ ใช้งานได้เสมอ แม้จะอยู่ ณ ที่ใดก็ตาม ข้อมูลมีการสำรองเอาไว้ เมื่อเกิดภัยพิบัติหรือเหตุการณ์ที่ไม่คาดฝัน สู่เป้าหมายได้รับการรับรองในเวลาอันสั้น ด้วยวิสัยทัศน์จากผู้บริหารได้ย้ำชัดถึงเป้าหมายสำคัญในการยกระดับ G-ABLE ให้เข้าสู่คู่ค้าทั่วโลก และมีมาตรฐานรองรับ ISO/ IEC 27001 จึงมีการวางแผน เตรียมความพร้อม เพื่อไปให้ถึงเป้าหมายในระยะ เวลาอันรวดเร็ว\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nคุณพงศ์เทพ กล่าว\r\n\r\n&nbsp;\r\n\r\nนอกจากนี้ในปี 2017 มีแนวความคิดที่จะเข้าสู่การรับรองมาตรฐาน <a href=\"https://www.iso.org/standard/51986.html\"><strong>ISO 20000 ITMS (Information Technology Service Management)</strong></a> ซึ่งเป็นมาตรฐานสากลด้านการบริหารบริการไอทีโดยเฉพาะ\r\n\r\n&nbsp;\r\n<h3><strong>ยกระดับ-สร้างความเชื่อมั่น-เสริมศักยภาพ ให้กับองค์กร</strong></h3>\r\n&nbsp;\r\n\r\nการพัฒนาเพื่อให้เกิดการเปลี่ยนแปลงไปสู่เป้าหมาย ในการเข้าสู่ มาตรฐาน ISO/ IEC 27001 ไม่เพียงส่งผลดีต่อกลุ่มธุรกิจที่เป็นลูกค้า ในแง่ของความปลอดภัยเท่านั้น แต่ยังยกระดับภาพลักษณ์ให้ G-ABLE กลายเป็นองค์กรที่มีมาตรฐานเทียบเท่าระดับสากล\r\n\r\n&nbsp;\r\n\r\nด้วยการผ่านการรับรองมาตรฐานสำคัญมาอย่างต่อเนื่อง และเพื่อเป็นการสร้างความเชื่อมั่นต่อคู่ค้า นอกจากนี้ G-ABLE ยังมีการเตรียมความพร้อม เพื่อรับมือกับปัญหา ที่อาจเกิดขึ้น\r\n\r\n&nbsp;\r\n\r\nไม่ว่าจะเป็น Treatment Plan แต่เมื่อไม่เคยเกิดปัญหาจริง เช่น ประท้วง น้ำท่วม หรือภัยพิบัติ จึงต้องนำสิ่งเหล่านั้นมาจำลอง และสร้างเป็นแผนการรับมือในการแก้ไขปัญหาให้กับลูกค้าเมื่อเกิดสถานการณ์ฉุกเฉินขึ้นจริง\r\n\r\n&nbsp;\r\n\r\nพร้อมกับเขียนเป็นกระบวนการ ขั้นตอน ตามข้อกฏหมาย แล้วนำมาประเมินหาทางออก ดังนั้นการทำแผน ร่วมกันในแต่ละภาคส่วนจึงต้องสอดคล้องกัน เพื่อทำให้การทำงาน บรรลุสู่เป้าหมายเป็นผลสำเร็จ\r\n\r\n&nbsp;\r\n<h3><strong>สร้างแพลตฟอร์มสู่มาตรฐานเดียว ลดความซับซ้อน</strong></h3>\r\n&nbsp;\r\n\r\nกุญแจสู่ความสำเร็จประการสำคัญคือ การปรับรูปแบบงานเอกสาร และข้อมูลภายในองค์กรให้เป็นแพลตฟอร์มเดียวกัน ซึ่งจะต้องผ่าน การปรับปรุง พัฒนาวิธีการทำงานของหน่วยงานต่างๆ ในองค์กร เพื่อทำให้เกิดความสะดวกและทำงานได้ง่ายขึ้น\r\n\r\n&nbsp;\r\n\r\nด้วยการสร้างเครื่องมือ ที่เป็นมาตรฐาน รวมถึงกระบวนการต่างๆ ให้เป็นแบบสากล คุณพงศ์เทพ กล่าวว่า\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n<h3><strong>G-ABLE พร้อมแล้ว ด้วยการให้บริการ บนมาตรฐานระดับโลก ISO/ IEC 27001 </strong></h3>\r\n&nbsp;\r\n\r\nการได้รับการรับรองมาตรฐาน ISO/ IEC 27001 ที่ทั่วโลกเชื่อมั่น เป็นสิ่งสำคัญที่ทำให้ G-ABLE ได้รับความเชื่อใจจากลูกค้า ในการทำงานเทียบเท่าระดับสากล และเป็นอีกหนึ่งปัจจัยที่ทำให้ G-ABLE มีคุณสมบัติตามข้อกำหนดของบางหน่วยงานที่ให้ความสำคัญกับ ระบบความปลอดภัยสารสนเทศ เช่น ธนาคารแห่งประเทศไทย เป็นต้น อีกทั้งยังเพิ่มมิติแห่งความปลอดภัยในฐานะผู้ให้บริการอีกด้วย",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "digital-marketing",
          "title": "Digital Marketing"
        },
        {
          "domain": "portfolio_category",
          "slug": "energy-industrial",
          "title": "Energy &amp; Industrial"
        },
        {
          "domain": "portfolio_category",
          "slug": "fsi-financial",
          "title": "FSI (Financial)"
        },
        {
          "domain": "portfolio_category",
          "slug": "solutions",
          "title": "Solutions"
        }
      ]
    },
    {
      "title": "Porto Chino ตอบไลฟ์สไตล์ \"วันว่าง-วันพักผ่อน\" ลงตัว เลือกซอฟต์แวร์ SPACE จาก Optimus Soft",
      "description": "ก้าวสู่การเปลี่ยนผ่านบนเส้นทางธุรกิจใหม่สำหรับ <a href=\"https://dl.co.th/th/home\">ดี.แลนด์ พร็อพเพอร์ตี้</a> บริษัทผู้พัฒนาอสังหาริมทรัพย์<!--more-->ที่เน้นที่อยู่อาศัย ไม่ว่าจะเป็นบ้านเดี่ยว ทาวน์เฮ้าส์ อาคารพาณิชย์ ซึ่งวันหนึ่งได้ขยายธุรกิจไปสู่ห้าง Community Mall นับเป็นอีกหนึ่งความท้าทายของผู้พัฒนาอสังหาริมทรัพย์ รายนี้\r\n\r\n&nbsp;\r\n\r\n<strong>“<a href=\"https://www.facebook.com/portochinomall/\">Porto Chino</a>”</strong> เป็นชื่อห้างสรรพสินค้าขนาดเล็กของ ดี.แลนด์ พร็อพเพอร์ตี้ ที่บุกเบิกธุรกิจขึ้นใหม่ด้วยการวาง Positioning ให้เป็น Lifestyle Mall ท่ามกลางถนนพระราม 2 เส้นทางการเดินทางไปยังสถานที่ท่องเที่ยวหลายแห่ง และเป็นรอยต่อที่เชื่อมจากกรุงเทพฯ ข้ามเขตเข้าเมืองสมุทรสาคร\r\n\r\n<img class=\"size-medium wp-image-28830 aligncenter\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/423533_201541313278833_931058880_n-298x300.jpg\" alt=\"\" width=\"298\" height=\"300\" />\r\n\r\nชื่อนี้มาจากคำว่า “Port of China” หรือ “ท่าจีน” ซึ่งเป็นแม่น้ำสายสำคัญของจังหวัดสมุทรสาคร ถูกวางคอนเซ็ปต์เป็น “The Harbor of Joy” มีเอกลักษณ์โดดเด่นด้วย “เสน่ห์แห่งเมืองท่า” เมืองที่มีการค้าขาย่ผ่านทางเรือมาตั้งแต่อดีตกาล\r\n\r\n&nbsp;\r\n\r\nPorto Chino ให้ความรู้สึกทันสมัย สะดวกสบาย กับการจัดสรรตกแต่งพื้นที่อย่างลงตัว เป็นแลนด์มาร์คแห่งใหม่ของสมุทรสาคร ที่รองรับการใช้ชีวิตและความต้องการของคนในพื้นที่ และนักเดินทาง\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28828 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/813-2-1.jpg\" alt=\"\" width=\"560\" height=\"390\" />\r\n\r\n&nbsp;\r\n\r\n<strong>คุณสุเทพ ปัญญาสาคร</strong> กรรมการผู้จัดการ บริษัท ดี.แลนด์ พร็อพเพอร์ตี้ จำกัด เปิดใจถึง การขับเคลื่อนธุรกิจใหม่ที่ท้าทาย พร้อมกับกล่าวถึงการนำระบบไอทีมาใช้เป็นเครื่องมือในการดำเนินธุรกิจ ซึ่งเป็นสิ่งที่มอบความสะดวกสบายให้กับลูกค้า และพาร์ทเนอร์ สนองความต้องการได้อย่างลงตัว\r\n\r\n&nbsp;\r\n\r\n<strong>Porto Chino ตอบไลฟส์ไตล์ “วันว่าง-วันพักผ่อน”</strong>\r\n\r\n&nbsp;\r\n\r\nจากความท้าทาย พร้อมความตั้งใจ ทำให้ คุณสุเทพ เริ่มต้นโครงการจากการทำวิจัยเพื่อศึกษาพฤติกรรมของกลุ่มเป้าหมาย เมื่อได้ข้อมูลจึงนำมาวางเป็นโจทย์ และนำไปสู่การวางคอนเซ็ปต์ การออกแบบ และก่อสร้าง เป็น Porto Chino\r\n\r\n&nbsp;\r\n\r\nดังที่เห็นคือมีการตกแต่งที่สื่อถึงการประมง เช่น ประภาคาร มีน้ำ และปลา ซึ่งบอกถึงเอกลักษณ์ ในวิถีชีวิตของชุมชน เมืองท่าที่อุดมสมบูรณ์ มีอาชีพหลักด้านการประมง และธุรกิจที่เกี่ยวเนื่องกับประมง คุณสุเทพ เสริมว่า\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28829 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/porto-chino11.jpg\" alt=\"\" width=\"550\" height=\"321\" />\r\n\r\n&nbsp;\r\n\r\nPorto Chino เปิดตัวอย่างเป็นทางการเมื่อเดือนพฤศจิกายน 2555 ซึ่งขณะนี้ย่างก้าวเข้าปีที่ 4 โดยช่วง 3 ปีเศษมานี้ มีการปรับเปลี่ยนบางส่วนราว 10-15% เพราะ Speed หรือความต้องการของลูกค้าในยุคนี้เปลี่ยนเร็วขึ้น จึงต้อง “เปลี่ยน” เพื่อให้ตอบความต้องการ หรือไลฟ์สไตล์ของลูกค้าผู้มาใช้บริการให้มากที่สุด\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n\r\nLifestyle Mall แห่งนี้ยังให้รายละเอียดไปถึง สถานที่จอดรถ หรือแม้แต่ห้องน้ำ เพื่ออำนวยความสะดวกในการใช้บริการของลูกค้า และเป็นที่มาของ Starbucks Drive Thru แห่งแรกของเมืองไทย นั่นเป็นเพราะต้องการให้ตอบโจทย์ของนักเดินทาง ทั้งความสะดวกสบาย และทันสมัย\r\n\r\n&nbsp;\r\n<h3><strong>IT เครื่องมือสำคัญต่อการดำเนินธุรกิจ</strong></h3>\r\n&nbsp;\r\n\r\nตั้งแต่เริ่มต้นโครงการ Porto Chino ได้นำระบบไอทีเข้ามาใช้เป็นเครื่องมือในการดำเนินธุรกิจ เพื่อความคล่องตัว รวดเร็ว ตามแนวคิดของ คุณสุเทพ ที่มองว่า ไอทีเป็นสิ่งสำคัญต่อการทำงานทุกด้าน ช่วยลดข้อผิดพลาด ลดขั้นตอนการทำงาน และเพิ่มประสิทธิภาพการทำงานได้ดียิ่งขึ้น\r\n\r\n&nbsp;\r\n\r\nโดยเฉพาะอย่างยิ่ง ไอทีทำให้ลูกค้า และพาร์ทเนอร์ ได้รับความสะดวกสบาย นับเป็นสิ่งที่ Porto Chino ให้ความสำคัญอันดับแรก\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n<h2>เลือก SPACE</h2>\r\n&nbsp;\r\n<h3><strong>เลือกที่ซอฟต์แวร์-ทีม-บริการ</strong></h3>\r\n&nbsp;\r\n\r\nซอฟต์แวร์ที่เลือกใช้ในวันนั้นเมื่อตอนเริ่มต้นโครงการ อาจจะตอบโจทย์ความต้องการในวันนี้ได้ไม่ทั้งหมด ด้วยเหตุเพราะการปรับเปลี่ยน และการเติบโต ซึ่งเมื่อเวลาผ่านไป Speed ลูกค้าเปลี่ยน Model เปลี่ยน จึงจำเป็นต้องหาซอฟต์แวร์ที่สามารถรองรับกับสถานการณ์ปัจจุบัน\r\n\r\n&nbsp;\r\n\r\nจึงเป็นที่มาให้ Porto Chino เปลี่ยนซอฟต์แวร์มาใช้ <a href=\"https://www.g-able.com/digital-review/space/\">SPACE</a> ในการบริหารจัดการพื้นที่เช่าแบบครบวงจร ซึ่งเป็นซอฟต์แวร์ที่พัฒนาขึ้น โดยบริษัท อ๊อปติมัส ซอฟต์ จำกัด หนึ่งในกลุ่มบริษัท G-ABLE ผู้นำด้านการให้บริการโซลูชั่นและโครงสร้างพื้นฐานด้านไอที\r\n\r\n&nbsp;\r\n\r\nคุณสุเทพ กล่าวถึงปัจจัยหลักในการเลือกซอฟต์แวร์ว่า มีอยู่ 4 เรื่อง ประการแรก ซอฟต์แวร์ SPACE ตอบความต้องการของ Porto Chino ได้ตรงจุดและครบ ประการที่สอง ทีมมีประสบการณ์ และเคยอิมพลีเม้นต์ระบบให้กับลูกค้าที่มีลักษณะธุรกิจเช่นนี้มาแล้ว ประการที่สาม มีความพร้อมในการให้บริการ ประการสุดท้าย มีความรู้ และสามารถ Customize ซอฟต์แวร์ให้ตรงกับความต้องการ\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n<h3><strong>ติดตั้งพร้อมใช้</strong></h3>\r\n&nbsp;\r\n\r\nขณะนี้ Porto Chino อิมพลีเม้นต์ซอฟต์แวร์ SPACE เรียบร้อยแล้วโดยใช้เวลาเพียง 3-4 สัปดาห์เท่านั้น จากนั้นทำการทดสอบการใช้งาน 2-3 เดือนที่ผ่านมา เพื่อให้มั่นใจว่าระบบสามารถทำงานได้ครบถ้วนตามที่ต้องการ\r\n\r\n&nbsp;\r\n\r\nโดยในช่วงแรกใช้คู่ขนานไปกับซอฟต์แวร์เดิม ซึ่งวางวันดีเดย์ไว้ที่เมษายนนี้ จะใช้ SPACE ซอฟต์แวร์ของ Optimus Soft ในการ Run ระบบการบริหารจัดการพื้นที่เช่าทั้งระบบ\r\n\r\n&nbsp;\r\n\r\nนอกจากนี้สิ่งสำคัญอีกประการ คือ ความมั่นใจในการให้บริการที่เชื่อว่า Porto Chino จะได้รับจากทีม Optimus Soft ทั้งในช่วงเริ่มต้นการใช้งาน และในอนาคต ว่าจะอำนวยความสะดวกในยามที่ต้องขยายระบบไปยังสาขาอื่นเมื่อ Porto Chino ถึงเวลาเปิดโครงการใหม่ หรือช่วยเรื่องการ Customize หากต้องมีการปรับโมเดลใดๆ\r\n\r\n&nbsp;\r\n<h3><strong>คิดถึงลูกค้า “คิดเรื่องเล็กเป็นเรื่องใหญ่”</strong></h3>\r\n&nbsp;\r\n\r\nแนวคิดหรือหลักการบริหาร Porto Chino คือ “มองเรื่องเล็กที่สุดเป็นเรื่องใหญ่ที่สุด” ซึ่งคุณสุเทพ ขยายความว่า เรื่องที่จอดรถ หรือห้องน้ำ อาจจะดูเป็นเรื่องเล็กๆ หรือดูเหมือนไม่สำคัญ\r\n\r\n&nbsp;\r\n\r\nแต่เรื่องเล็กๆ เหล่านี้เรามองเป็นเรื่องใหญ่ ด้วยการให้ความสำคัญ โดยคิดถึงว่าถ้าลูกค้าเข้ามาแล้วจอดรถลำบาก ไม่สะดวก เรื่องนี้ก็จะสร้างความไม่ประทับใจให้ลูกค้า และอีกแนวคิดที่เป็นวิสัยทัศน์ คือ คิดถึงลูกค้า ก่อนคิดถึงสินค้า ซึ่งสินค้าจะเป็นอะไรนั้นต้องตอบความต้องการของลูกค้า",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "cloud-applications",
          "title": "Cloud Applications"
        },
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        },
        {
          "domain": "portfolio_category",
          "slug": "real-estate",
          "title": "Real Estate"
        },
        {
          "domain": "portfolio_category",
          "slug": "service",
          "title": "Service"
        },
        {
          "domain": "portfolio_category",
          "slug": "solutions",
          "title": "Solutions"
        }
      ]
    },
    {
      "title": "ก.ล.ต. เลือก Mverge ติดตั้งระบบคลาวด์ เปลี่ยนสู่ยุค Mobile-First, Cloud-First",
      "description": "Mverge ได้รับความไว้วางใจจากสำนักงาน <a href=\"http://www.sec.or.th/TH/Documents/coverpage/king/king.html\">คณะกรรมการกำกับหลักทรัพย์และตลาดหลักทรัพย์</a> (ก.ล.ต.)<!--more--> เป็นผู้ติดตั้ง <a href=\"https://www.office.com/\"><strong>Microsoft Office 365 </strong></a>เชื่อมต่อกับระบบ <a href=\"https://www.microsoft.com/en-us/cloud-platform/enterprise-mobility-security\">Enterprise Mobility Suite</a> (EMS)\r\n\r\n&nbsp;\r\n\r\nเพื่อเพิ่มศักยภาพในการสื่อสาร การส่งต่อข้อมูลที่สะดวกรวดเร็ว ปลอดภัย เพื่อ รองรับแนวคิดการทำงานได้อย่างครอบคลุม เชื่อมต่อข้อมูลภายในให้สามารถทำงานได้แบบ “Working Anywhere From Any Device” เกิดความยืดหยุ่นสำหรับผู้ใช้งานสูงสุด\r\n\r\n&nbsp;\r\n\r\nซึ่งถือเป็น <a href=\"https://www.g-able.com/solutions/cloud-platform-infrastructure/\">ระบบคลาว์เซอร์วิส</a> ที่สร้างความพร้อมใน การปรับตัวสู่ยุค Mobile-First, Cloud-First อย่างเต็มตัว ความก้าวหน้าทางเทคโนโลยีสารสนเทศ มีส่วนช่วยให้การดำเนินงานของตลาดทุนมี ประสิทธิภาพ สะดวกรวดเร็วขึ้น\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28837 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/g-able-กลต-1.jpg\" alt=\"\" width=\"700\" height=\"173\" />\r\n\r\n&nbsp;\r\n\r\nอย่างไรก็ตาม การพึ่งพิงเทคโนโลยีด้านข้อมูล ก็ทำให้เกิดความท้าทายใหม่ต่อตลาดการเงิน รวมทั้งต่อ สำนักงานคณะกรรมการกำกับหลักทรัพย์และ ตลาดหลักทรัพย์ (ก.ล.ต.) ด้วย\r\n\r\n&nbsp;\r\n\r\nไม่ว่าจะเป็น การเผชิญกับความเสี่ยงจากอาชญากรรมทาง คอมพิวเตอร์ การเปลี่ยนแปลงพฤติกรรมของผู้ ใช้ที่ต้องการความยืดหยุ่นในการทำงานนอก สำนักงาน และความจำเป็นที่ต้องรองรับการ ทำงานกับอุปกรณ์พกพาที่หลากหลาย\r\n\r\n&nbsp;\r\n\r\nแต่ด้วย <strong>Microsoft Office 365</strong> ซึ่งทำงานประสานกับ  <strong>Microsoft Enterprise Mobility Suite</strong> (EMS) ทำให้ฝ่ายเทคโนโลยีสารสนเทศและการสื่อสาร มีเครื่องมือสำหรับช่วยในการบริหารจัดการ ผู้ใช้ อุปกรณ์พกพา คอมพิวเตอร์ กำหนดสิทธิ์ในการ เข้าถึงข้อมูลและระบบ รวมทั้งปกป้องข้อมูล สำคัญไปจนถึงปลายทาง\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28838\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/Office-365-New-1-300x104.jpg\" alt=\"\" width=\"750\" height=\"260\" />\r\n\r\n&nbsp;\r\n\r\nทำให้องค์กรสามารถ บังคับใช้นโยบายด้านความปลอดภัยข้อมูลได้ อย่างมีประสิทธิภาพ นอกจากนั้น ระบบที่ทำงาน อยู่บนคลาวด์ ก็ยังช่วยให้มั่นใจได้ว่ามีความ พร้อมให้บริการตลอดเวลา ทั้งในสภาวะปกติ หรือในช่วงที่มีเหตุฉุกเฉิน หรือภัยพิบัติเกิดขึ้น ภายใต้การลงทุน\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n<h3><strong>ความต้องการขององค์กร</strong></h3>\r\n&nbsp;\r\n\r\nสำนักงานคณะกรรมการกำกับหลักทรัพย์และ ตลาดหลักทรัพย์ (ก.ล.ต.) ตั้งขึ้นในปี พ.ศ. 2535 มีหน้าที่หลักในการกำกับดูแล และพัฒนาตลาด ทุนให้ยั่งยืน พร้อมกับทำหน้าที่คุ้มครองผู้ลงทุนด้วย\r\n\r\n&nbsp;\r\n\r\nซึ่งในการเป็นองค์กรเชิงรุกที่จะทำหน้าที่นี้ ได้ในยุคปัจจุบันเทคโนโลยีสารสนเทศ จึงไม่ได้ เป็นเพียงเครื่องมือสำคัญในการกำกับดูแล แต่ ในขณะเดียวกัน ก็ยังสร้างความท้าทายใหม่ๆ แก่ ก.ล.ต. ด้วย คุณกำพล ศรธนะรัตน์ ผู้อำนวยการ ฝ่ายเทคโนโลยีสารสนเทศและการสื่อสาร ได้ชี้ ให้เห็นถึงความท้าทายเหล่านี้\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nคุณกำพล กล่าว\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nคุณกำพล กล่าวสรุป\r\n\r\n&nbsp;\r\n<h3><strong>ทางแก้ปัญหา</strong></h3>\r\n&nbsp;\r\n\r\nเพื่อตอบสนองต่อความท้าทายสำคัญข้างต้น ทาง ก.ล.ต. จึงได้พิจารณาทางเลือกการใช้งาน คลาวด์ โดยมีตัวอย่าง ได้แก่ การตัดสินใจย้าย ระบบอีเมล์สู่ Microsoft Office 365 พร้อมกับ ติดตั้งใช้งาน Microsoft Enterprise Mobility Suite (EMS)\r\n\r\n&nbsp;\r\n\r\nซึ่งเป็นโซลูชั่นที่ช่วยในการ บริหารจัดการ และปกป้องผู้ใช้อุปกรณ์พกพา คอมพิวเตอร์ และข้อมูลแบบครบวงจร ตั้งแต่ ต้นทางถึงปลายทาง\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nคุณกำพล กล่าว\r\n\r\n&nbsp;\r\n\r\nในการดำเนินการย้ายระบบครั้งนี้ ทางไมโครซอฟท์ ประเทศไทย และบริษัท เอ็มเวิร์จ จำกัด ได้เข้า มามีส่วนช่วยสนับสนุน ในการให้คำแนะนำ แก้ ปัญหาทางเทคนิค รวมทั้งการอบรมบุคลากรเพื่อ ให้เป็นวิทยากรในการอบรมภายในอีกทอดหนึ่ง\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nคุณกำพล กล่าว\r\n\r\n&nbsp;\r\n\r\nตามแผนงานที่วางไว้ ทางฝ่ายไอทีเลือกที่จะย้าย ระบบอีเมล์ขึ้นคลาวด์เป็นลำดับแรก เนื่องจาก เกี่ยวข้องกับผู้ใช้จำนวนมาก โดยเริ่มการย้ายระบบ อีเมล์ในเดือนมกราคม และเสร็จสิ้นในเดือน มิถุนายนที่ผ่านมา หลังจากนั้นจึงเริ่มติดตั้งใช้งาน โซลูชั่น EMS โดยใช้เวลาอีกประมาณ 2 เดือนเนื่องจากเรามีผู้ใช้ประมาณ 600 คน และเราต้องการให้การเปลี่ยนผ่านเป็นไปอย่างราบรื่น\r\n\r\n&nbsp;\r\n\r\nจึงเลือกที่จะทยอยย้ายเมล์บ๊อกซ์ ทีละส่วน และ ใช้ระบบอีเมล์ในลักษณะไฮบริดจ์ จนการย้าย ระบบเสร็จสมบูรณ์ แม้ในช่วงแรกที่เริ่มใช้งาน Office 365 ทางฝ่ายไอทีได้รับเสียงตอบรับว่า ระบบอีเมล์ทำงานช้า แต่หลังจากที่ได้ตรวจสอบ และบริหารแบนด์วิดธ์อย่างเหมาะสมแล้ว ก็พบ ว่า ไม่จำเป็นต้องเพิ่มแบนด์วิดธ์สำหรับรองรับ Office 365 โดยเฉพาะ\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28839 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/Sbase-blog-image-EMS.jpg\" alt=\"\" width=\"930\" height=\"332\" />\r\n\r\n&nbsp;\r\n\r\nในส่วนของ EMS นั้นจะต่างออกไป โดยหลังจาก ที่ติดตั้ง <a href=\"https://www.microsoft.com/en-us/cloud-platform/microsoft-intune\">Microsoft Intune</a>, <a href=\"https://www.microsoft.com/en-us/cloud-platform/system-center-configuration-manager\">System Center Configuration Manager</a> และ <a href=\"https://docs.microsoft.com/en-us/information-protection/understand-explore/what-is-azure-rms\">Right Management System</a> แล้ว เราจะต้องนำ นโยบายต่างๆ ที่เรากำหนดไว้ ไปทดสอบบน EMS ว่าสามารถควบคุม และบริหารจัดการผู้ใช้ อุปกรณ์ สิทธิ์ในการใช้งาน และการเข้าถึงข้อมูล ให้เป็นไปตามนโยบายได้จริง\r\n\r\n&nbsp;\r\n\r\n<strong>ประโยชน์ที่ได้รับ</strong>\r\n\r\n&nbsp;\r\n\r\nนับตั้งแต่ที่ได้มีการย้ายระบบอีเมล์ขึ้นสู่คลาวด์ อย่างสมบูรณ์เมื่อกลางปีที่ผ่านมา ทางฝ่ายไอที ก็ได้รับผลตอบรับที่ดีจากผู้ใช้\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nคุณกำพล กล่าว\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28841 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/cloudemail-1.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nนอกเหนือจากนั้น คุณกำพล ยังได้ชี้ให้เห็นถึง ประโยชน์ที่สำคัญ และชัดเจนยิ่งกว่า คือ การที่ ระบบอีเมล์ขององค์กร มีสภาพพร้อมให้บริการ (Availability) อยู่เสมอ และสามารถเข้าถึงข้อมูล ได้จากทุกที่อย่างปลอดภัย\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nคุณกำพล กล่าว\r\n\r\n&nbsp;\r\n\r\nนอกจากนี้ ยังมีอีกหลายโซลูชั่นใน Office 365 ที่ อยู่ในระหว่างการแนะนำให้บุคลากรในองค์กร ได้นำไปใช้งาน ไม่ว่าจะเป็น <a href=\"https://www.skype.com/en/business/skype-for-business/\">Skype for Business</a> และ <a href=\"https://www.yammer.com/\">Yammer </a>ทางฝ่ายไอทีได้เริ่มทยอยอบรม และเปิดให้ใช้งาน Skype for Business กับผู้ใช้ในบางกลุ่มก่อน เช่น ศูนย์ความสัมพันธ์ระหว่าง ประเทศ ซึ่งมีความจำเป็นต้องติดต่อ และประชุม ผ่านวิดีโอคอนเฟอเรนซ์อยู่เป็นประจำ\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28840 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/skypeyammer-1.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nจากเดิมที่ จะต้องไปใช้ห้องคอนเฟอเรนซ์ และเซตอัพ อุปกรณ์ เป็นการเฉพาะ แต่ในปัจจุบัน สามารถ ใช้เครื่องโน้ตบุ๊กและ Skype for Business ใน การประชุมทางไกลเป็นกลุ่มเล็กได้ง่ายๆ ช่วยให้การทำงานสะดวกมากขึ้น และปลอดภัยสูงขึ้น กว่าการใช้ช่องทางสาธารณะ\r\n\r\n&nbsp;\r\n\r\nจึงคาดว่า ภายหลังจากนี้ จะขยายขอบเขตการ ใช้งานให้กว้างขวางมากขึ้นและในส่วนของการ ใช้งาน Yammer เป็นแพลตฟอร์มด้านโซเชียล มีเดียในองค์กรนั้น คุณกำพลก็ได้ชี้ให้เห็นถึง แนวทางในการผนวกรวม Yammer เข้ากับ โซลูชั่นในการจัดการเอกสาร และการแบ่งปัน องค์ความรู้ ที่มีในองค์กรอยู่แล้ว\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nคุณกำพล กล่าวสรุป",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "cloud-applications",
          "title": "Cloud Applications"
        },
        {
          "domain": "portfolio_category",
          "slug": "cloud-platform-infrastructure",
          "title": "Cloud Platform &amp; Infrastructure"
        },
        {
          "domain": "portfolio_category",
          "slug": "data-center-transformation",
          "title": "Data Center Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "digital-transformation",
          "title": "Digital Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "government-state-enterprise",
          "title": "Government &amp; State Enterprise"
        },
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        },
        {
          "domain": "portfolio_category",
          "slug": "microsoft-solutions",
          "title": "Microsoft Solutions"
        },
        {
          "domain": "portfolio_category",
          "slug": "solutions",
          "title": "Solutions"
        },
        {
          "domain": "portfolio_category",
          "slug": "thinking",
          "title": "Thinking"
        }
      ]
    },
    {
      "title": "G-ABLE สร้างเวที Thailand’s Network Security Contest 2017 ต่อเนื่องเป็นครั้งที่ 10",
      "description": "บริษัท จีเอเบิล จำกัด ร่วมกับสำนักงานบริหารเทคโนโลยีสารสนเทศเพื่อพัฒนาการศึกษา สำนักงานคณะกรรมการการอุดมศึกษา จัดการแข่งขัน “Thailand’s Network Security Contest 2017” ต่อเนื่องเป็นครั้งที่ 10\r\n\r\n<!--more-->\r\n\r\nโดยเปิดโอกาสให้นิสิต นักศึกษามากกว่า 100 ทีมจากทั่วประเทศที่มีความสนใจด้านไอทีและมุ่งมั่นที่จะใช้เทคโนโลยีสารสนเทศในการสร้างสรรค์ให้เกิดประโยชน์อย่างมีคุณภาพ ได้ ‘โชว์ของ’ แสดงความสามารถในทางสร้างสรรค์ โดยนำเอาเทคโนโลยีสารสนเทศมาพัฒนาหรือประยุกต์ใช้อย่างถูกต้องเหมาะสมและคำนึงถึงจรรยาบรรณเป็นสำคัญ หวังสร้างแรงจูงใจให้เยาวชนเป็นคนใฝ่รู้ และเข้าถึงข้อมูลสารสนเทศต่างๆ อันจะเป็นหนทางนำไปสู่ความเข้าใจและปรับใช้สำหรับงานด้านความปลอดภัยของข้อมูลและระบบเครือข่ายคอมพิวเตอร์สำหรับองค์กร การแข่งขันครั้งนี้เพื่อชิงเงินรางวัลมูลค่ารวมกว่า 180,000 บาท จนในที่สุดสามารถคัดสรรเยาวชนคนไอทีคุณภาพ 12 ทีมเพื่อชิงชัย ผลการแข่งขันปรากฏว่าทีมซอล กุหลาบไฟ จากสถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง เป็นผู้ชนะเลิศ พร้อมสื่อทุกทีมเข้าแข่งขันสามารถเป็นกระบอกเสียงให้สังคมเห็นความสำคัญด้านความปลอดภัยของการใช้ไอที มีแรงบันดาลใจ และสามารถนำความรู้จากการแข่งขันต่อยอดการทำงานไอทีได้ในอนาคต\r\n\r\n&nbsp;\r\n\r\n<strong>สุเทพ อุ่นเมตตาจิต กรรมการผู้จัดการ บริษัทกลุ่ม จีเอเบิล</strong> ในฐานะผู้จัดการแข่งขันเปิดเผยถึงวัตถุประสงค์ของการจัดการแข่งขัน Thailand’s Network Security Contest ขึ้น เพื่อให้วงการ Information Technology ตระหนักว่า Network Security เป็นองค์ประกอบที่สำคัญ ไม่ใช่เพียงผู้อยู่เบื้องหลังอีกต่อไป โดยมุ่งหวังว่าเวทีนี้จะทำให้คนตระหนักในด้านความปลอดภัยของข้อมูลและระบบเครือข่ายคอมพิวเตอร์มากขึ้น พร้อมนำเสนอโครงการให้สำนักงานบริหารเทคโนโลยีสารสนเทศเพื่อพัฒนาการศึกษา สำนักงานคณะกรรมการการอุดมศึกษา (สกอ.) ร่วมเป็นเจ้าภาพ โดยเปิดโอกาสให้กลุ่มนักศึกษาทั่วประเทศมีส่วนร่วมต่อเนื่องเป็นปีที่ 10 แล้ว\r\n“ถ้าจะวัดว่าสำเร็จ เรายืนหยัดโครงการนี้มายาวนานถึง 10 ปี เราพบว่าทุกปี โครงการนี้ก้าวทันต่อการเปลี่ยนแปลงของเทคโนโลยี จึงอยู่ในเรดาร์ความสนใจของทุกคนที่เกี่ยวข้องอย่างต่อเนื่องเท่าเทียมกัน เยาวชนมีความเข้าใจด้าน Security ที่ดี มีนักศึกษาจากทั่วประเทศสมัครเพิ่มขึ้นเรื่อยๆทุกปีมากกว่า 100 ทีม ย่อมสะท้อนถึงแรงจูงใจ สะดุดใจให้เกิดความสนใจโครงการนี้และมีแรงบันดาลใจเข้าแข่งขันตามรุ่นพี่ ขณะเดียวกันเราเองก็เห็นพัฒนาการของเยาวชนที่มีความตั้งใจ มีความรู้ความสามารถมากขึ้น และถึงแม้กฎเกณฑ์ในแต่ละปีจะแตกต่างกันออกไป แต่เป้าหมายหลักยังคงต้องการให้เยาวชนแสดงความสามารถที่โดดเด่น แสดงออกถึงความใฝ่รู้ กล้าแสดงออก และมีความรับผิดชอบที่จะทำให้ Information Technology มีความปลอดภัย สามารถนำความรู้มาประยุกต์ใช้ได้ ซึ่งไม่ใช่แค่ความรู้ทางวิชาการ แต่ต้องมีไหวพริบ สามารถนำประสบการณ์มาสร้างประโยชน์ได้”\r\n\r\n&nbsp;\r\n\r\nทั้งนี้ ก่อนจะเข้าสู่รอบตัดเชือก 12 ทีมสุดท้าย ทางโครงการได้จัดอบรมความรู้ด้าน Network Security ทั้งเรื่องทักษะความรู้ ชี้เป้าแหล่งความรู้ และส่งต่อตัวอย่างต่างๆ ผ่านกูรูวิทยากรชั้นนำระดับประเทศที่สามารถให้ทั้งความรู้ ข้อแนะนำ ข้อคิด และประสบการณ์ตรงกับเยาวชน ซึ่งโครงการนี้ตั้งใจจะเป็นเวทีที่ให้ทุกคนได้ “เรียนรู้” และ “แสดงออก” สามารถเห็นภาพกว้างกว่าวิชาการที่มีอยู่ ได้ทดลองทำจริง และเรียนรู้ว่าจะประยุกต์ความรู้ที่มีอยู่เพื่อต่อสู้กับกลุ่มแฮกเกอร์ที่มีกลเม็ดเด็ดพรายมากขึ้น โดยใช้ไหวพริบให้เท่าทันได้อย่างไร\r\n“ถึงแม้จะมีการแข่งขันด้านความมั่นคงทางไซเบอร์มากมายหลายเวที อีกทั้งแฮกเกอร์เองก็พัฒนาความก้าวหน้าทางความปลอดภัยไต่ระดับสูงขึ้นเรื่อยๆ จนทำให้ผู้บริโภคเสียเปรียบ ดังนั้น คนที่อยู่ในวงการไอทีจำเป็นต้องเข้าใจในทักษะที่ถูกต้อง ซึ่งเวทีนี้มุ่งเน้นที่การสร้างแรงบันดาลใจให้คิดถึงความปลอดภัยที่ถูกต้องเหมาะสม ผ่านการตั้งโจทย์ให้เกิดการใช้งานอย่างถูกที่ถูกทางและเปิดประสบการณ์ในโลกกว้าง เพื่อให้ผู้เข้าแข่งขันนำความรู้ทางวิชาการและประสบการณ์จากหลายแหล่งมาต่อยอดพัฒนาและนำเสนอโดยคำนึงถึงทั้งด้าน Engineering ออกแบบต้องมีหลักการที่ถูกต้อง Economic ใช้สอยที่สะดวก มีต้นทุนทางเศรษฐศาตร์ที่เหมาะสม Education ใฝ่รู้และมีจรรยาบรรณ สำหรับโจทย์การแข่งขันแต่ละปีจะเปลี่ยนไปตามสภาวะความเหมาะสมของเทคโนโลยีและสภาพแวดล้อม โดยพยายามนำวิธีใหม่ๆทางเทคโนโลยีมาเสริมกับการแข่งขัน อย่างการเปิดใช้ Cloud Lab เพื่อให้เยาวชนเห็นภาพเสมือนจริง ทำให้เข้าใจ Network Security มากขึ้น รวมทั้งมีแนวโน้มสร้างเครื่องมือต่างๆ เพื่อทำให้โจทย์มีความซับซ้อนและใกล้เคียงความจริงมากขึ้น จำลองใกล้เคียงความจริงที่สุด เพื่อป้องกันและต่อกรกับกลุ่มแฮกเกอร์ได้จริงๆ”\r\n\r\n&nbsp;\r\n\r\nกรรมการผู้จัดการ บริษัทกลุ่ม จีเอเบิล กล่าวต่อว่า โครงการนี้ยังสะท้อนให้เห็นถึงค่านิยมและวิสัยทัศน์ขององค์กร ซึ่ง จีเอเบิล มุ่งเน้นการทำงานแบบมืออาชีพ ต้องรู้จริงในสิ่งที่ทำ และทำในสิ่งที่รู้ให้เกิดประโยชน์ด้วยกระบวนการต่างๆ ทั้งสิ่งที่ดีไซน์ถูกต้องตามหลักการ ลูกค้าใช้ให้เกิดประโยชน์ได้ มีต้นทุนทางเศรษฐศาสตร์ที่สมเหตุสมผล ขณะเดียวกันก็จะส่งสารให้ทุกคนตระหนักถึงความปลอดภัยของระบบให้มากเพียงพอเสมอ นอกจากนั้น ยังส่งสารถึงโอกาสเข้าสู่ตลาดแรงงานที่เปิดกว้างให้กับเยาวชนรุ่นใหม่ได้เข้าทำงานในองค์กรแห่งนี้ในอนาคต ขณะเดียวกันก็พร้อม เป็นส่วนหนึ่งในการสนับสนุนไทยแลนด์ 4.0 ยกระดับความก้าวหน้าด้านเทคโนโลยีของประเทศ โดยมุ่งเน้นให้ทุกคนตระหนักและทำให้ Information Technology ถูกนำไปใช้ด้วยความเท่าเทียม กับคนทุกกลุ่ม ทั่วถึง ทุกคนมีโอกาสใช้ได้ ผู้ประกอบการต้องสร้างสมดุลระหว่างการค้าและความเป็นธรรม และผู้ใช้งานต้องปรับเปลี่ยนพฤติกรรมใส่ใจเรื่องความปลอดภัยที่ถูกต้อง โดยใฝ่รู้ ยกระดับตัวเองให้ไล่ตามประเทศผู้นำเทคโนโลยีให้ทันการแข่งขัน\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n<strong>“Thailand’s Network Security Contest 2017”</strong> ครั้งที่ 10 ปรากฎว่าทั้ง 12 ทีมที่ผ่านเข้ารอบต่างได้รับรางวัลกันทุกทีม แบ่งออกเป็นรางวัลสปิริตยอดเยี่ยม รางวัลชมเชย รางวัลรองชนะเลิศ ซึ่งรางวัลชนะเลิศได้แก่ทีม ซอล กุหลาบไฟ โดยมีนายนลธวัช หนูมอ นายศวีระ อภินทนาพงศ์ และนายศรัทธาธรรม์ จันทร์ชาตรี จากคณะวิศวกรรมศาสตร์ สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง คว้าเงินสด 50,000 บาท พร้อมใบประกาศเกียรติคุณ น้องๆทั้งสามคน เปิดเผยว่า “พวกเราสนใจด้าน Security และเป็นกลุ่มในแลปในมหาวิทยาลัยอยู่แล้ว แต่โครงการนี้ทำให้เราได้ประสบการณ์จากการแข่งขันกับคนจากทั่วประเทศ ได้ทั้งความตื่นเต้นและสนุกจากสิ่งแวดล้อม ความกดดัน การแก้ปัญหาเฉพาะหน้า และโจทย์ที่ท้าทายและเปลี่ยนไปทุกปี สามารถนำไปต่อยอดในอาชีพได้ ก่อนการแข่งขัน พวกเราเตรียมพร้อมกว่า 2 เดือน ด้วยการทำโจทย์บ่อยๆ โดยเฉพาะการจำลองช่องโหว่หรือปัญหาด้านความปลอดภัยจากชีวิตจริงเข้ามาอยู่ในสนามแข่งขัน ซึ่งพวกเราคิดว่าการพรีเซนเทชั่น แบ่งหัวข้อองค์ความรู้ได้ชัดเจน สามารถนำไปใช้ได้อย่างไร และการใช้ความรู้รอบด้านและไหวพริบในการตอบคำถามน่าจะชนะใจกรรมการได้ และมองว่าโครงการนี้ทำให้เรารู้จุดบกพร่องของตัวเองและรู้ว่าจะเสริมจุดอ่อนด้วยความรู้ที่ได้จากโครงการนี้อย่างไร สามารถกลับไปเพิ่มเติมความรู้ และเล่าให้รุ่นพี่รุ่นน้องฟังได้อีกเพื่อเป็นแรงบันดาลใจต่อไป และอยากให้สังคมตระหนักถึงความเป็นส่วนตัวในการใช้งานโลกโซเชียลมากขึ้น”\r\n\r\n&nbsp;\r\n\r\nเช่นเดียวกับ ทีม Mr. Ossas ประกอบด้วยนายณัฐพล เลาติเจริญ นายณัฐพล ธนิตสุขการ และนายกิจจพันธ์ สิงห์ชัย จากภาควิชาวิศวกรรมคอมพิวเตอร์ คณะวิศวกรรมศาสตร์ มหาวิทยาลัยเกษตรศาสตร์ ซึ่งได้รับรางวัลรองชนะเลิศอันดับ 1 กล่าวเพิ่มเติมว่า “ปกติพวกเราก็เข้าร่วมงานประเภทนี้อยู่แล้ว และเมื่อมีเพื่อนที่มีความสนใจร่วมกันจึงร่วมโครงการนี้ ซึ่งที่นี่เปิดโอกาสให้เรียนรู้และทดสอบจัดระบบ หาข้อมูลว่ามีช่องโหว่อย่างไร ทำให้ได้พบคนไอทีจากทั่วประเทศ เห็นความสามารถที่หลากหลาย ได้รู้จักทีมอื่น ได้คอนเน็คชั่น และอาจมีโอกาสได้แชร์ความคิดเห็นหรือแก้ปัญหาร่วมกันในอนาคต ทั้งยังทำให้คนทั่วไปสนใจในด้านความปลอดภัยเพิ่มขึ้น รู้ว่ามีเทคนิคใหม่ๆที่ทำให้ระบบข้อมูลคอมพิวเตอร์มีความเสี่ยงมากขึ้น ส่วนคนที่เป็นโปรแกรมเมอร์เองก็ควรตระหนักว่าทุกครั้งที่โค้ดหรือสร้างโปรแกรมก็ต้องเพิ่มด้าน Security เข้าไปด้วย”",
      "category": []
    },
    {
      "title": "โรงรับจำนำพฤกษามันนี่ เลือกใช้ \u000bPawn Shop System on AWS",
      "description": "\r\n<h2><b>About </b><b>โรงรับจำนำพฤกษามันนี่</b></h2>\r\n<b>เกี่ยวกับ โรงรับจำนำพฤกษามันนี่</b>\r\n\r\nเป็นโรงรับจำนำที่ได้รับมาตรฐาน ISO9001:2015 โดยมีสาขาที่ให้บริการแล้ว 11 สาขา ทั่วทั้งจังหวัดสงขลาและปัตตานี เป็นโรงรับจำนำที่มุ่งมั่นพัฒนา Application สำหรับใช้จัดการข้อมูลสินทรัพย์ที่ลูกค้านำมาจำนำ เพื่ออำนวยความสะดวกกับพนักงานและลูกค้าที่มาใช้บริการโรงรับจำนำ ให้ลูกค้าได้รับการบริการที่รวดเร็ว และรองรับการขยายสาขาเพิ่มขึ้นในอนาคตPawn Shop System เป็นระบบจัดการข้อมูลสินทรัพย์ที่ลูกค้านำมาจำนำ โดยมีฟังก์ชันการทำงาน คือ\r\n<ul>\r\n \t<li>จัดการข้อมูลตั๋วจำนำ รองรับการจัดเก็บข้อมูลลุกค้า, สินทรัพย์ที่ลูกค้านำมาจำนำ, ดอกเบี้ย และ อายุตั๋วจำนำ</li>\r\n \t<li>จัดการข้อมูลการจัดเก็บสินทรัพย์ที่ลูกค้านำมาจำนำ</li>\r\n \t<li>จัดการสินทรัพย์หลุดจำนำ รองรับการ ประเมินราคาสินค้า, การซื้อสินทรัพย์โดยพนักงาน และการขายสินทรัพย์ให้ลูกค้า</li>\r\n \t<li>รายงานธุรกรรมต่าง ๆ ที่เกิดขึ้นในโรงรับจำนำ</li>\r\n \t<li>จัดการบัญชีรายรับและค่าใช้จ่าย ที่เกิดขึ้นในโรงรับจำนำ</li>\r\n</ul>\r\n\r\n<h2><b>Why Cloud Why AWS</b></h2>\r\nPawn Shop System คือระบบของโรงรับจำนำพฤกษามันนี่ เป็นระบบจัดการข้อมูลสินทรัพย์ที่ลูกค้านำมาจำนำ ซึ่งเป็นระบบที่ต้องการความยืดหยุ่นในการดำเนินการ ตอบสนองความต้องการของผู้บริหารโรงรับจำนำพฤกษามันนี่ และรองรับการใช้การที่คล่องตัวให้กับพนักงานในสาขาต่างๆ\r\n\r\nดังนั้นการเลือกระบบดังกล่าวให้อยู่ในรูปแบบระบบ Cloud services จะช่วยในเรื่องของการจัดการระบบเพื่อรองการทำงานจากทั้งส่วนกลางและสาขาอื่นๆ ทั่วประเทศ อีกทั้งยังควบคุมต้นทุนได้ง่าย พร้อมปรับเปลี่ยนการตั้งค่าการใช้งานได้รวดเร็ว รวมถึงหากจำเป็นที่จะต้องต่อยอด ก็มีความพร้อม โดยสามารถที่จะมีระบบนิเวศขึ้นมาเพื่อที่จะรองรับการพัฒนาได้อย่างต่อเนื่องและรวดเร็วยิ่งขึ้นด้วย\r\n<h2><b>Why G-Able</b></h2>\r\nเนื่องจากจีเอเบิล มีความชำนาญและมีประสบการณ์ในการจัดทำระบบที่เกี่ยวข้องกับทางด้านไอทีไม่ว่าจะเป็น Infrastructure และ Software Development มากกว่า 20 ปี ซึ่งสามารถให้บริการวิเคราะห์ ออกแบบ แนะนำการบริหารและจัดการข้อมูลการจัดเก็บสินทรัพย์ให้ได้อย่างมีประสิทธิภาพ\r\n\r\nซึ่งปัจจุบันทางจีเอเบิล ได้ช่วยในการปรับปรุงระบบให้รองรับเรื่องของการจัดการบัญชีรายรับและค่าใช้จ่าย, รายงานธุรกรรมต่าง ๆ รวมถึงยังได้วางแผนเพื่อพัฒนาต่อยอดระบบให้รองรับการจำนำแบบ online ผ่านมือถือในอนาคต เป็นต้น",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        },
        {
          "domain": "portfolio_category",
          "slug": "service",
          "title": "Service"
        }
      ]
    },
    {
      "title": "Application Support Outsourcing Services",
      "description": "หากพูดถึง IT Outsourcing Services หลายท่านคงทราบกันดี คือการให้บริการจากหน่วยงานภายนอก จัดหาทีมงานเข้ามาช่วยองค์กรของท่าน ในการบริหารจัดการงานทางด้าน IT เพื่อรองรับกับความเปลี่ยนแปลงอันหลากหลาย<!--more-->\r\n\r\nเพื่อทำงานส่วนที่บุคลากรในองค์กรของท่านไม่ถนัด หรือใช้คนภายนอกทำให้ได้ราคาที่ถูกกว่าต้นทุนภายในองค์กรเอง หรือเป็นงานที่ต้องใช้ความชำนาญพิเศษ ซึ่งหากท่านดำเนินการเองอาจจะมีต้นทุนสูงเป็นต้น\r\n\r\n&nbsp;\r\n\r\nโดยทำการจ้างเป็นลักษณะสัญญาว่าจ้างเป็นระยะเวลา เพื่อให้บุคลากรภายในองค์กรของท่านมุ่งเน้นในธุรกิจหลัก เพื่อให้เกิดข้อได้เปรียบทางการแข่งขันธุรกิจได้มากขึ้น\r\n\r\n&nbsp;\r\n<h3><strong>ทำความรู้จัก </strong><strong>Application Support</strong></h3>\r\n&nbsp;\r\n\r\n<strong>Application Support</strong> เป็นส่วนงานการให้บริการ ส่วนงานหนึ่งใน IT Outsourcing Services ให้บริการในการดูแลระบบงาน Application หรือ Program ทั้งที่ลูกค้ามีใช้งานอยู่แล้วในปัจจุบัน และระบบงานใหม่ที่ลูกค้าวางแผนจะนำมาใช้งานในองค์กร\r\n\r\n&nbsp;\r\n\r\nโดยให้บริการในลักษณะของการนั่งปฏิบัติงานประจำ ณ ที่ตั้งของลูกค้า (On Site) เพื่อให้มั่นใจว่ามีทีมที่คอยช่วยดูแลระบบงาน Application หรือ Program นั้นๆ สามารถทำงานได้อย่างปกติ และช่วยป้องกันปัญหาที่อาจจะเกิดขึ้นกับระบบเพื่อให้ระบบสามารถตอบสนองและสนับสนุนการดำเนินธุรกิจของลูกค้าได้อย่างเต็มประสิทธิภาพคุ้มค่ากับการลงทุน\r\n\r\n&nbsp;\r\n<h3><strong>Application Support ทำงานอย่างไร?</strong></h3>\r\n&nbsp;\r\n\r\nหากจะพูดถึงการทำงานของ Application Support ท่านลองนึกถึงสิ่งที่เกิดขึ้นในหน่วยงานปฏิบัติการคอมพิวเตอร์ (IT) ท่านจะเห็นว่ามีคนอยู่กลุ่มหนึ่งที่ยุ่งกับการรับโทรศัพท์รับแจ้งปัญหาจากลูกค้า (Customer) หรือผู้ใช้งาน (User)\r\n\r\n&nbsp;\r\n\r\nอีกกลุ่มหนึ่งกำลังนั่งวิเคราะห์ปัญหาที่เกิดขึ้นกับระบบงาน หรือกำลังพยายามหาสาเหตุ หรือแนวทางแก้ไขปัญหาที่เกิดขึ้นจากที่ได้รับแจ้งจากผู้ใช้งาน หรือลูกค้าเพื่อให้ระบบงานนั้นๆ สามารถกลับมาให้บริการได้อีกครั้งอย่างเร็วที่สุด\r\n\r\n&nbsp;\r\n\r\nกลุ่มคนเหล่านั้น ก็คือ IT Support รวมถึงทีมงาน Application Support ที่ให้บริการในการสนับสนุนให้ระบบงาน Application หรือ Program ตอบสนองต่อธุรกิจขององค์กรให้สามารถดำเนินไปได้อย่างต่อเนื่อง\r\n\r\n&nbsp;\r\n\r\nทีมงาน Application Support ไม่เพียงแค่ให้บริการงานที่เกี่ยวข้องกับ Application หรือ Program ในองค์กรของลูกค้าเท่านั้น ทีมงานยังมีหน้าที่ในการติดตามปัญหา ประสานงานไปยังเจ้าของ Application หรือ Program นั้นๆ หรือหน่วยงานอื่นๆ ที่เกี่ยวข้องกับระบบ (3rd Party)\r\n\r\n&nbsp;\r\n\r\nในกรณีพบเจอสิ่งผิดปกติต่างๆ ไม่ว่าจะเป็น Defect, Bug ที่เกิดขึ้นในระบบนั้นๆเอง หรือ ระบบ Network หรือสาเหตุอื่นใดที่ทำ ให้ระบบงานนั้นๆ ไม่สามารถใช้งานได้ ส่งผลให้ธุรกิจหลักขององค์กรต้องหยุดชะงัก\r\n\r\n&nbsp;\r\n\r\nการที่ไม่สามารถดำเนินการต่อไปได้ชั่วขณะ อาจมีผลทำให้ธุรกิจเกิดความเสียหายเป็นต้น เพื่อเร่งดำเนินการแก้ไขให้ระบบกลับมาพร้อมใช้งาน รวมถึงการรายงานสาเหตุและผลของการดำเนินการให้แก่ผู้ที่เกี่ยวข้องทราบ\r\n\r\n&nbsp;\r\n<h3><strong>Application Support </strong><strong>กับ </strong><strong>ITIL</strong></h3>\r\n&nbsp;\r\n\r\nการทำงานของ Application Support มุ่งเน้นเพื่อให้ลูกค้าหรือองค์กรที่เลือกใช้บริการ Application Support Outsourcing จากบริษัทได้รับประโยชน์สูงสุดจากการบริการ ดังนั้นบริษัท Provider ต่างๆ จึงได้มีการนำ <a href=\"http://searchdatacenter.techtarget.com/definition/ITIL\">ITIL </a>(Information Technology Infrastructure Library) ที่เป็น Best Practice และมาตรฐานการให้บริการที่ใช้กันอย่างแพร่หลาย มาใช้ในการบริหารจัดการงานบริการแก่ลูกค้า\r\n\r\n&nbsp;\r\n\r\nITIL นั้นเป็นแนวทางปฏิบัติที่มีขั้นตอนการบริหารจัดการงาน ด้านการให้บริการด้วย IT (IT Service Management) ซึ่งมีส่วนประกอบหลักอยู่ 5 ส่วนคือ\r\n\r\n&nbsp;\r\n\r\n<strong>1.Service Strategy (SS) </strong>กลยุทธ์ด้านการบริการ เป็นส่วนประกอบแรกสำหรับการสร้างงานบริการด้าน IT (IT Service Management) โดยในส่วนนี้จะคำนึงถึง “What?” “Why?” และ “How?” เน้นความเข้าใจและการสร้างคุณค่าให้เกิดขึ้น (Value Creation) และกำหนดเป้าหมายและความคาดหวังของประสิทธิภาพของงานบริการ\r\n\r\n&nbsp;\r\n\r\n<strong>2.Service Design (SD)</strong> การออกแบบงานบริการ เป็นส่วนประกอบที่นำเอาข้อมูลจาก Service Strategy มาออกแบบเป็นงานบริการจริง โดยมุ่งเน้นให้งานบริการที่จะสร้างขึ้นใหม่ หรืองานที่มีการเปลี่ยนแปลง สามารถสร้างคุณค่าได้จริงต่อธุรกิจ\r\n\r\n&nbsp;\r\n\r\nมีความพร้อมให้บริการมีขีดความสามารถเพียงพอต่อความต้องการของธรุกิจมีแผนรองรับเหตุไม่คาดฝันเพื่อให้บริการมีความต่อเนื่อง มีการติดตามมาตรฐานระดับการให้บริการที่ได้ตกลงไว้ (Service Level) และมุ่งมั่นให้งานบริการที่จะสร้างนั้นสอดคล้องกับมาตรฐานและกฎระเบียบที่กำหนดไว้\r\n\r\n&nbsp;\r\n\r\nสำหรับในส่วนประกอบนี้ไม่ได้เจาะจงเฉพาะงานบริการใหม่เพียงอย่างเดียว แต่รวมไปถึงการปรับปรุงงานบริการเดิมให้ดีขึ้นด้วย\r\n\r\n&nbsp;\r\n\r\n<strong>3.Service Transition (ST) </strong>การส่งมอบงานบริการ เป็นส่วนประกอบที่นำเอาข้อมูลจาก Service Design มาทำแผนส่งมอบงานบริการ ทั้งแผนงานใหม่หรือแผนงานที่มีการปรับเปลี่ยนงานบริการเดิม เพื่อให้แน่ใจว่างานบริการที่จะส่งมอบตรงตามความต้องการของลูกค้า\r\n\r\n&nbsp;\r\n\r\nซึ่งในส่วนนี้จะประกอบไปด้วย การวางแผนงานและการบริหารจัดการ (Planning and Managing Changes and Release Managing) การบริหารความเสี่ยง (Risk Management) การถ่ายทอดความรู้ (Knowledge Management) รวมถึงการตรวจสอบว่าสิ่งที่จะส่งมอบครบและตรงตามความต้องการของลูกค้า\r\n\r\n&nbsp;\r\n\r\n<strong>4.Service Operation (SO)</strong> การปฏิบัติงานบริการ เป็นส่วนประกอบที่ใช้ในการปฎิบัติงานบริการ การบริหารจัดการงานที่ต้องทำในแต่ละวัน รวมไปถึงการสนับสนุนให้งานบริการต่างๆ สำเร็จลุล่วง ตรงตามระดับมาตรฐานการให้บริการที่ได้ตกลงไว้ (Service Level)\r\n\r\n&nbsp;\r\n\r\nมีการเฝ้าติดตามหรือรับแจ้งเหตุผิดปกติที่ส่งผลกระทบต่อการให้บริการต้องหยุดชะงัก พร้อมหาแนวทางการแก้ไขปัญหาอย่างเร่งด่วนเพื่อให้บริการกลับสู่สภาพปกติและวิเคราะห์หาสาเหตุที่แท้จริงของปัญหาให้พบเพื่อลดโอกาสการเกิดปัญหาซ้ำอีกในอนาคต\r\n\r\n&nbsp;\r\n\r\n<strong>5.Continual Service Improvement (CSI)</strong> การพัฒนางานด้านบริการ เป็นส่วนประกอบที่นำเอาข้อมูลการให้บริการที่ได้จากการประเมินผลงาน มาวิเคราะห์และจัดทำรายงานสรุป เพื่อส่งต่อไปยังส่วนประกอบต่างๆ เพื่อใช้ในการพัฒนางานบริการและปรับปรุงงานบริการให้ดีขึ้น และมีคุณภาพอย่างต่อเนื่อง\r\n\r\n&nbsp;\r\n\r\n<img class=\"aligncenter wp-image-29026 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/ITIL-service-strategy-lifecycle-1.png\" alt=\"\" width=\"378\" height=\"369\" />\r\n<h4 style=\"text-align: center;\">รูปที่ 1 ITIL Service Life Cycle</h4>\r\n&nbsp;\r\n\r\nจากรูป ITIL Service Life Cycle จะเห็นได้ว่า 4 องค์ประกอบหลัก Service Strategy, Service Design, Service Transition และ Service Operation จะถูกคลุมด้วย Continual Service Improvement\r\n\r\n&nbsp;\r\n\r\nนั่นก็คือทุกองค์ประกอบ จะต้องมีการพัฒนาปรับปรุงให้มีความก้าวหน้าอยู่เสมอ เพื่อให้ลูกค้าที่มาใช้บริการพึงพอใจมากที่สุด และกลับมาใช้บริการอีกในการให้บริการ Application Support\r\n\r\n&nbsp;\r\n\r\nโดยนำหลักการ ITIL มาเป็นแนวทางปฏิบัติในการให้บริการนั้น สามารถออกแบบการบริการได้หลายรูปแบบ ขึ้นอยู่กับความต้องการของลูกค้าเป็นสำคัญ แต่เพื่อให้ท่านผู้อ่านเห็นภาพมากขึ้น ขอยกตัวอย่างการให้บริการดังภาพต่อไปนี้\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n<img class=\"wp-image-16795 size-full aligncenter\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/App_support_2.jpg\" alt=\"\" width=\"602\" height=\"201\" />\r\n<h4 style=\"text-align: center;\">รูปที่ 2 Application Support – Supporting Model</h4>\r\n&nbsp;\r\n\r\nจากรูปที่ 2 การให้บริการ Application Support จะเกิดขึ้นโดยผู้ใช้งาน (User) เกิดคำถาม หรือแจ้งปัญหา หรือเหตุการณ์ที่เกิดขึ้นเกี่ยวกับการใช้งานระบบงานหนึ่ง จึงทำการแจ้งปัญหาหรือเหตุการณ์ (Incident) ดังกล่าวให้กับทีม Application Support\r\n\r\n&nbsp;\r\n\r\nโดยทีมจะมีการส่งต่องาน (Escalate) ตามขอบเขต การดำเนินการของแต่ละ Level โดยเริ่มจาก Level 1, Level 2, Level 3 ตามลำดับเพื่อทำการวิเคราะห์ตรวจสอบ หาสาเหตุของปัญหา โดยทีม Application Support จะนำปัญหาที่ได้รับแจ้งเข้าสู่กระบวนการที่เรียกว่า Incident Management การจัดการกระบวนการ Incident Management มีกระบวนการ จัดการพื้นฐานสอดคล้องกับมาตรฐานของ ITIL-Based โดยกระบวนการพื้นฐานที่นำมาปรับใช้มีขั้นตอนดังนี้\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n<img class=\"aligncenter wp-image-16796 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/02/App_support_3.jpg\" alt=\"\" width=\"556\" height=\"384\" />\r\n<h4 style=\"text-align: center;\">รูปที่ 3 ภาพรวมกระบวนการ Incident Management</h4>\r\n&nbsp;\r\n\r\nจากรูปที่ 3 ในกระบวนการ Incident Management ซึ่งประกอบไปด้วย ผู้เกี่ยวข้องอยู่ด้วยกันหลายส่วน จะมีการ กำหนดบทบาทหน้าที่และความรับผิดชอบใน Incident Management (Roles and Responsibilities) ดังนี้\r\n\r\n&nbsp;\r\n\r\nบทบาท\r\n\r\nหน้าที่และความรับผิดชอบ\r\n\r\n\r\n\r\n\r\n\r\nStaff / Authorized User\r\n\r\nผู้ใช้งานที่ได้รับอนุญาตทำการแจ้งทีมงาน Application Support Level 1 เพื่อรายงานปัญหาเกี่ยวกับระบบงาน (Application) โดยผ่านวิธีการที่มีการตกลงในสัญญา\r\n\r\n&nbsp;\r\n\r\nซึ่งผู้ใช้งานจะให้ข้อมูลการติดต่อรายละเอียดของ Incident นอกจากนี้ ผู้ใช้งานจะได้รับแจ้งสถานะของ Incident\r\n\r\n&nbsp;\r\n\r\nรวมถึงวิธีการแก้ไข Incident และผู้ใช้งานจะทำการตรวจสอบความถูกต้องของผลการแก้ไข Incident ก่อนที่ทีมงาน Application Support Level 1 จะทำการปิด Incident นั้น\r\n\r\n\r\n\r\n\r\n\r\nApplication Support Level 1\r\n\r\nทีมงาน Application Support Level 1 จะเป็นศูนย์กลางในการรับ Incident\r\n\r\n&nbsp;\r\n\r\nโดยที่ Incident จะถูกบันทึก และส่งต่อไปยังทีมงานที่เหมาะสมทีมงาน Application Level 1 มีสถานภาพเป็นเจ้าของ Incident และเป็น 1st Level Support (โดยให้ Workaround แก่ผู้ใช้งาน)\r\n\r\n&nbsp;\r\n\r\nรวมถึงทำการแยกประเภท Incident จัดลำดับให้ ความสำคัญและทำการแก้ Incident เบื้องต้นและสอบถาม Incident เพื่อทำการรายงานสถานะแก่ผู้ใช้งาน\r\n\r\n\r\n\r\n\r\n\r\nApplication Support Level 2\r\n\r\nIncident ที่ไม่สามารถแก้ไขได้โดยทีมงาน Application Support Level 1 จะถูกส่งต่อไปยัง Application Support Level 2 ซึ่งเป็น 2nd Level Support\r\n\r\n&nbsp;\r\n\r\nโดยที่ 2nd Line Support จะประกอบด้วยทีมงานที่มีความรู้ความชำนาญระบบ (Application) มากกว่าจะได้รับมอบหมายให้ทำการวิเคราะห์และหาวิธีแก้ไข Incident รวมถึงทำการประสานงานกับทีมงาน Application Support Level 3 เพื่อช่วยในการแก้ไข\r\n\r\n\r\n\r\n\r\n\r\nApplication Support Level 3\r\n\r\nIncident ที่ไม่สามารถแก้ไขได้โดยทีมงาน Application Support Level 2 จะถูกส่งต่อไปยัง Application Support Level 3 ซึ่งเป็น 3rd Line Support\r\n\r\n&nbsp;\r\n\r\nเพื่อช่วยในการแก้ไขช่วยในการวิเคราะห์หาสาเหตุของปัญหาวิธีการแก้ไข Incident เพื่อนำระบบนั้นๆ กลับสู่สภาวะปกติ\r\n\r\n\r\n\r\n\r\n\r\nIncident Manager \r\n\r\nIncident Manager มีหน้าที่ในการบริหารจัดการ Incident ซึ่งส่งไปทุกทีมงานที่เกี่ยวข้องในการแก้ไข Incident รวมถึงจัดทำข้อมูลและรายงานสำหรับผู้บริหาร\r\n\r\n&nbsp;\r\n\r\nอีกทั้ง Incident Manager มีหน้าที่ให้คำแนะนำในการปรับปรุงและดูแลกระบวนการ Incident Management ให้มีประสิทธิภาพและประสิทธิผลในกรณีที่เกิดปัญหารุนแรง (Major Incident) ขึ้น Incident Manager มีหน้าที่ในการกำหนดผู้รับผิดชอบและดูแลการแก้ไข Incident ดังกล่าว\r\n\r\n\r\n\r\n\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\nจากข้อมูลข้างต้นจนมาถึงตรงนี้ ท่านผู้อ่านหลายท่านคงกำลังพิจารณาที่จะเลือกใช้บริการ Application Supportจาก IT Outsourcing Services Provider กันแล้วใช่ไหมคะ เพื่อเป็นการเสริมให้ท่านผู้อ่านตัดสินใจเลือกใช้บริการเร็วขึ้น เรามาดูประโยชน์ที่จะได้รับจากการจ้าง Application Support Outsourcing Services กันต่อเลยค่ะ\r\n\r\n&nbsp;\r\n<h3><strong>ประโยชน์ </strong><strong>Application Support Outsourcing</strong></h3>\r\n&nbsp;\r\n\r\n\r\n<ul>\r\n \t<li>ประหยัดค่าใช้จ่ายโดยเฉพาะค่าใช้จ่ายทางด้านแรงงาน</li>\r\n \t<li>ประหยัดเวลาในการดำเนินงานด้านที่บุคลากรในองค์กรไม่ถนัด</li>\r\n \t<li>ได้รับบริการจากบุคลากรที่มีคุณภาพมีความชำนาญในการดำเนินงาน</li>\r\n \t<li>ช่วยให้บุคลากรเกิดองค์ความรู้ใหม่ๆ จากประสบการณ์ความรู้มากขึ้น</li>\r\n \t<li>ช่วยให้บุคลากรในองค์กรของท่าน มุ่งเน้นทำงานในส่วนที่สำคัญในธุรกิจหลักมากขึ้น และมีข้อได้เปรียบทางการแข่งขันมากขึ้น</li>\r\n \t<li>มีการปฏิบัติตามสัญญาอย่างเคร่งครัด (Contracts) ถ้าการปฏิบัติงานไม่เป็นไปตามสัญญา องค์กรสามารถปรับ หรือฟ้องร้องทางกฎหมายได้ ซึ่งอาจจะทำได้ยากหากเป็นกระบวนการทำงานของหน่วยงานภายในองค์กร</li>\r\n \t<li>ลดความเสี่ยงทางธุรกิจ (Risk Management) ที่ไม่ต้องรับภาระทั้งหมด ถ้าเกิดการเปลี่ยนแปลงที่ไม่คาดคิด หรือช่วยในเรื่องของการบริหารจัดการบุคลากร</li>\r\n \t<li>เป็นตัวช่วยผลักดันสำหรับการเปลี่ยนแปลง (Change)องค์กรสามารถใช้ข้อตกลงที่ทำกับผู้รับทำงานจากภายนอกเป็นเครื่องมือสำหรับการเปลี่ยนแปลงในกระบวนการทำงานที่ไม่สามารถทำได้เองหากพิจารณากันจริงๆ จะเห็นว่าทุกองค์กรในยุคโลกาภิวัฒน์มีการนำ Application หรือ Program มาใช้งานในการสนับสนุน</li>\r\n</ul>\r\n\r\n\r\n&nbsp;\r\n\r\nธุรกิจขององค์กรเพิ่มขึ้น เพื่อให้บุคลากรขององค์กร ทำ งานได้อย่างมีประสิทธิผล มุ่งเน้นที่ธุรกิจขององค์กรเป็นหลัก ดังนั้นทุกๆ องค์กรคงหลีกเลี่ยงไม่ได้เลย ที่จะต้องมีทีมงาน Application Support ที่คอยดูแล ให้บริการบริหารจัดการงานที่เกี่ยวข้องกับระบบงาน Application หรือ Program เพื่อให้ธุรกิจหลักขององค์กรสามารถดำ เนินต่อไปได้อย่างต่อเนื่อง\r\n\r\n&nbsp;\r\n\r\nขอขอบคุณแหล่งข้อมูล :\r\n<ol>\r\n \t<li>http://www.best-management-practice.com/serviceStrategy2011_demo/</li>\r\n \t<li>http://www.best-management-practice.com/gempdf/itsmf_an_introductory_overview_of_itil_v3.pdf</li>\r\n</ol>",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "healthcare",
          "title": "Healthcare"
        },
        {
          "domain": "portfolio_category",
          "slug": "media",
          "title": "Media"
        },
        {
          "domain": "portfolio_category",
          "slug": "outsourcing-service",
          "title": "Outsourcing Service"
        },
        {
          "domain": "portfolio_category",
          "slug": "retails",
          "title": "Retails"
        },
        {
          "domain": "portfolio_category",
          "slug": "transportation-logistic",
          "title": "Transportation &amp; Logistic"
        }
      ]
    },
    {
      "title": "AIS ใช้ CA DevTest Solutions ช่วยด้านทดสอบ เลือก G-Able บริการเด่น-เข้าใจผลิตภัณฑ์",
      "description": "การดำเนินธุรกิจในทุกวันนี้ เทคโนโลยีมีส่วนช่วยเพิ่มประสิทธิภาพในการทำงานเป็นอย่างมาก<!--more-->ยิ่งหากมีการเลือกเครื่องมือที่เหมาะสมกับการใช้งาน ยิ่งทำให้มีประสิทธิภาพในการทำงานมากยิ่งขึ้น\r\n\r\n&nbsp;\r\n\r\n<a href=\"http://www.ais.co.th/index.html?intcid=coverpage-th-entersite\">AIS</a> (บริษัท แอดวานซ์ อินโฟร์ เซอร์วิส จำกัด) เป็นหนึ่งในองค์กรที่มีการใช้งานเทคโนโลยีเป็นเครื่องมือในการทำงานมากที่สุดแห่งหนึ่ง การจะเลือกเอาเทคโนโลยีใดมาใช้นั้น ต้องมั่นใจว่า เครื่องมือเหล่านั้นสามารถตอบโจทย์ในการใช้งานได้เป็นอย่างดี และสอดคล้องกับวิสัยทัศน์ขององค์กร\r\n\r\n&nbsp;\r\n\r\n<img class=\"wp-image-28832 size-full aligncenter\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/g-able-ca-1.jpg\" alt=\"\" width=\"700\" height=\"173\" />\r\n\r\n&nbsp;\r\n\r\n<a href=\"https://docops.ca.com/devtest-solutions/8-0/en/\">CA DevTest Solutions</a> (ชื่อเดิม CA LISA Service Virtualization) หนึ่งในเครื่องมือด้านการทดสอบระบบที่ AIS เลือกใช้ในโครงการสำคัญๆ ทำไม AIS จึงเลือกเครื่องมือนี้ และตอบโจทย์อะไรบ้าง ทั้งหมดนี้มีคำตอบ\r\n\r\n&nbsp;\r\n\r\n<strong>คุณวรายุทธ วงศ์ไพบูลย์วัฒน </strong>System Quality Assurance Manager จาก บริษัทไมโม่เทค จำกัด หนึ่งในบริษัทลูกของ AIS มีหน้าที่พัฒนาแอปพลิเคชันต่างๆ ของ AIS ได้กล่าวถึงการเลือกใช้เครื่องมือ CA DevTest Solutions ว่า\r\n\r\n&nbsp;\r\n\r\nการเลือกใช้เครื่องมือดังกล่าวมีมาตั้งแต่ปีที่ผ่านมา ภายใต้วิสัยทัศน์ AIS ปี 2015 และส่งต่อมายังวิสัยทัศน์ปี 2016 ที่ภาพรวมล้วนมุ่งเน้นการไปสู่ “ดิจิทัล” ทั้งระบบ นั่นหมายความว่าระบบไอทีต้องเร็ว และเพิ่มประสิทธิภาพในกระบวนต่างๆ\r\n\r\n&nbsp;\r\n\r\nโดยปัจจุบันโครงการระยะยาว คือ Solution Transformation ทำการปรับปรุงเครื่องมือ และอุปกรณ์ภายในให้ทันสมัย คล่องตัวขึ้น เพื่อพัฒนาบริษัทให้มีความคล่องตัวทันสมัย แข่งขันกับคู่แข่งได้\r\n\r\n&nbsp;\r\n<h3><strong>CA DevTest Solutions ตัวช่วยลดเวลาทดสอบ</strong></h3>\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-28833 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/test.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nAIS เลือก CA DevTest Solutions มาเพื่อใช้กับทุกโครงการของ AIS ที่ต้องการความรวดเร็ว นั่นหมายถึงการลด Communication Hub ลงจากเดิมที่ต้องพึ่งหน่วยงานอื่นหรือทีม Outsource ในการทำงาน\r\n\r\n&nbsp;\r\n\r\nแต่เมื่อใช้ CA DevTest Solutions ซึ่งเป็น Service Virtualization ช่วยให้ไมโม่เทค สามารถทำงานต่างๆ ได้เองโดยไม่ต้องพึ่งทีมอื่น ซึ่งช่วยเพิ่มประสิทธิภาพการทำงาน และลดเวลาที่จะทำการทดสอบระบบไปได้อย่างมาก เช่น จากเดิมอาจจะต้องใช้เวลา 2-3 วัน ลดเหลือเพียงไม่กี่ชั่วโมง\r\n\r\n&nbsp;\r\n\r\nจุดแรกในการใช้ CA DevTest Solutions อย่างจริงจังเริ่มต้นจาก นโยบายของ AIS ช่วง เดือนธันวาคม 2015 ที่ต้องการเปิดตัว <a href=\"http://www.ais.co.th/playapp/\">AIS PLAY</a> ซึ่งเป็นแอปพลิเคชันบน Video Platform ภายในเดือนมกราคมที่ผ่านมา ซึ่งมีเวลาในการพัฒนาแอป น้อยมาก และเชื่อว่าในหลายองค์กรก็ไม่อาจจะทำได้สำเร็จ\r\n\r\n&nbsp;\r\n\r\n<img class=\"wp-image-28835 size-full aligncenter\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/supp_thumb_faq.jpg\" alt=\"\" width=\"394\" height=\"223\" />\r\n\r\n&nbsp;\r\n\r\nคุณ วรายุทธ กล่าวเสริมว่า แต่ด้วย CA DevTest Solutions ทำให้เราพัฒนาแอป ในโครงการ AIS PLAY ได้สำเร็จลุล่วงไปด้วยดี เราสามารถทำ Mock Up ได้ด้วย Service Virtualization หรือการทดสอบแอพ โดยในขณะนั้นเราได้ส่งทีมงานไปคุยกับทีมเขียนแอปพลิเคชันที่สิงคโปร์ เพื่อบอกแนวทางในการพัฒนาแอป\r\n\r\n&nbsp;\r\n\r\nในด้านการทำงาน <strong>คุณสุรศักดื์ เกิดผล</strong> Test Engineer <a href=\"http://www.mimotech.co.th/\">บริษัท ไมโม่เทค จำกัด</a> ได้กล่าวเสริมว่า หลังจากที่ได้รับมอบหมายงานจากคุณวรายุทธ ก็เริ่มดำเนินงานทันที โดยลักษณะการทำงานนั้น หากทีมพัฒนาแอปฯ ต้องการทดสอบแอปฯ ก็จะทำการสร้าง Mock up ขึ้นมาจาก CA DevTest Solutions\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n\r\nคุณสุรศักดิ์กล่าว และเสริมว่าการทำงานระหว่างสองฝ่าย คือทีมพัฒนา และทีมทดสอบจะมีเอกสาร ที่เรียกว่า Interface Spec ซึ่งเป็นเอกสารที่ทุกคนใช้ร่วมกัน มีการบอกวิธี หรือคำสั่งในการเชื่อมต่อกับระบบ หน้าที่ของทีมทดสอบจะทำการสร้าง Mock Up จากเอกสารนี้รอไว้\r\n\r\n&nbsp;\r\n\r\nคุณ วรายุทธ เสริมว่า ถ้าย้อนกลับไปเมื่อ 10 ปีที่แล้ว รูปแบบการพัฒนาแอปพลิเคชันคือ ต้องทำแต่ละส่วนให้เสร็จก่อน แล้วจึงค่อยนำมาต่อเข้าด้วยกัน คล้ายๆ กับประตูที่เปิดไปหากัน แต่ปัจจุบันเราสามารถสร้างประตูเองได้โดยไม่ต้องรอให้แอปพลิเคชันพัฒนาเสร็จทุกส่วน\r\n\r\n&nbsp;\r\n<h3><strong>ลดเวลาตัดขั้นตอนที่ไม่จำเป็น</strong></h3>\r\n&nbsp;\r\n\r\n<img class=\"wp-image-28834 size-medium aligncenter\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/faster-300x205.png\" alt=\"\" width=\"300\" height=\"205\" />\r\n\r\n&nbsp;\r\n\r\nคุณสุรศักดิ์ กล่าวถึงการทำงานว่า ปกติในการทำ Mock Up ของแอปพลิเคชันตัวหนึ่งแต่เดิมต้องมีการวางแผน และจ้าง Vendor จากภายนอกมาเป็นผู้พัฒนา ซึ่งต้องใช้เวลามากในการสร้าง อีกทั้งยังต้องมีการปรับแก้กันไปมา และมีค่าใช้จ่ายที่สูง\r\n\r\n&nbsp;\r\n\r\nขณะที่ CA DevTest Solutions เป็นเครื่องมือที่ช่วยให้ทีมงานสามารถสร้าง Mock Up ขึ้นมาใช้ได้เองในช่วงการพัฒนา AIS PLAY ทีมงานได้มีการใช้ CA DevTest Solutions เป็นตัวแทนของโหนดต่างๆ ในระบบหลังบ้าน 3-4 โหนด\r\n\r\n&nbsp;\r\n\r\nทั้งนี้ ในความเป็นจริง AIS มีการใช้ CA DevTest Solutions อยู่ในบางโปรเจกต์ แต่ไม่จริงจังมากนัก จนมาถึงโปรเจกต์ AIS PLAY ที่ได้มีการนำเอา CA DevTest Solutions มาใช้อย่างจริงจัง\r\n\r\n&nbsp;\r\n\r\nเมื่อติดปัญหาในส่วนใด ตัวแทนของ G-ABLE (บริษัท จีเอเบิล จำกัด) ซึ่งเป็นผู้อิมพลีเม้นต์ระบบและคอยให้ความช่วยเหลือในการแก้ปัญหาที่ติดขัดได้ทันที ซึ่งทำให้สามารถออนไลน์โหนดที่ต้องการได้ภายในเวลาไม่เกิน 30 นาที\r\n\r\n&nbsp;\r\n\r\n\r\n\r\nคุณวรายุทธ กล่าวเสริมว่า ปกติกระบวนการทำแอปพลิเคชันหรือบริการๆ หนึ่ง จะมีการทำงานประมาณ 30-50 ขั้นตอน การทดสอบก็เป็นหนึ่งในนั้นและเป็นกระบวนการที่สำคัญที่สุด\r\n\r\n&nbsp;\r\n\r\nไม่ว่าจะเป็น Unit Test, Function Test เป็นการทดสอบฟังก์ชันจากทีมทดสอบ, IoT Test เป็นการเอาฟังก์ชันที่ทางทีมพัฒนาสร้างขึ้นมาเอาไปทดสอบกับทั้งระบบเพื่อหาว่ามีข้อผิดพลาดที่จุดใด และ Performance Load Test ทดสอบการรับโหลดของระบบ",
      "category": [
        {
          "domain": "portfolio_tag",
          "slug": "ais",
          "title": "AIS"
        },
        {
          "domain": "portfolio_tag",
          "slug": "ca-devtest-solutions",
          "title": "CA DevTest Solutions"
        },
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        },
        {
          "domain": "portfolio_category",
          "slug": "it-operation-management",
          "title": "IT Operation Management"
        },
        {
          "domain": "portfolio_tag",
          "slug": "mobile-application",
          "title": "Mobile application"
        },
        {
          "domain": "portfolio_category",
          "slug": "telecommunication",
          "title": "Telecommunication"
        }
      ]
    },
    {
      "title": "เอสซีจี เคมิคอลส์ วางใจ อ๊อปติมัส ซอฟต์ เลือก ITEM Solution พัฒนาระบบจัดเก็บเอกสาร",
      "description": "ด้วยความมุ่งมั่นในการพัฒนานวัตกรรมสินค้าและบริการที่มีมูลค่าเพิ่มต่อเนื่อง รวมทั้งแผนในการยกระดับองค์กรให้เป็น <a href=\"http://www.ecofactory.fti.or.th/\">โรงงานอุตสาหกรรมเชิงนิเวศ</a> (Eco Factory) ของเอสซีจี เคมิคอลส์ ต่างต้องอาศัยกระบวนการการพัฒนาด้านการบริหารจัดการ<!--more-->และการดำเนินงานสู่ความเป็นเลิศโดยการเพิ่มประสิทธิภาพทั่วทั้งองค์กร\r\n\r\n&nbsp;\r\n\r\nเพื่อให้เดินกลยุทธ์ได้ตามเป้าหมายที่กำหนดไว้ ทั้งนี้เครื่องมือสำคัญที่จะตอบโจทย์ด้านการเพิ่มประสิทธิภาพขององค์กรนั้นคือ เทคโนโลยีสารสนเทศ ซึ่งปัจจุบันแทรกซึม อยู่ในทุกด้านของการทำงาน และมีส่วนในการขับเคลื่อนธุรกิจให้เดินหน้าได้รวดเร็วคล่องตัว\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-29021 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/SCG-3-1.jpg\" alt=\"\" width=\"700\" height=\"430\" />\r\n\r\n&nbsp;\r\n\r\nสำหรับ <a href=\"https://www.scgchemicals.com/th\">เอสซีจี เคมิคอลส์</a> ให้ความสำคัญในทุกด้านทุกจุดต่อการนำเทคโนโลยีสารสนเทศมาใช้ในธุรกิจ แม้แต่ด้านการจัดเก็บเอกสารภายในองค์กรที่ได้นำระบบ การจัดเก็บแบบครบวงจรเข้ามาใช้เมื่อราว 2 ปีที่ผ่านมา\r\n\r\n&nbsp;\r\n\r\nด้วยเพราะเทคโนโลยีสารสนเทศสามารถช่วยจัดเก็บเอกสารให้เป็นระบบ สามารถเรียกใช้ได้สะดวกรวดเร็ว เพื่อสนองตอบต่อการเติบโตทางธุรกิจ และการเปลี่ยนแปลงของสถานการณ์ตลาดที่สามารถเกิดขึ้นได้ตลอดเวลา\r\n\r\n&nbsp;\r\n\r\nเริ่มจากเมื่อราว 2 ปีที่ผ่านมา หรือในปี 2556 <strong>BSO</strong> (Business Service Office) ได้รับมอบหมายให้ดูเอกสารสำคัญในองค์กร ซึ่งเอกสารเหล่านี้เป็นเอกสารที่มีความสำคัญในระดับสูงสุด รวมถึงเป็นเอกสารที่เป็นความลับในการดำเนินธุรกิจ ทำให้ทีมต้องมีการออกแบบอย่างมีประสิทธิภาพ และสะดวกต่อการใช้งานของคนในองค์กร\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-29022 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/doc-1.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nที่เอสซีจี เคมิคอลส์ ทั้งองค์กรได้ทำการจัดระบบการจัดเก็บเอกสารขององค์กรใหม่ทั้งหมด ด้วยการนำระบบ <strong>ITEM Solution</strong> เข้ามาใช้ คุณสุจารี รุ่งโรจน์สุนทร Sale Support Manager and  Corporate Affairs Manager บริษัท เอสซีจี เคมิคอลส์ จำกัด กล่าวว่า\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n<h3><strong>จุดเริ่มต้นเปลี่ยนระบบจัดเก็บเอกสาร</strong></h3>\r\nในการปรับเปลี่ยนระบบการจัดเก็บเอกสารของ เอสซีจี เคมิคอลส์ที่ได้นำระบบใหม่มาใช้งานนั้น เริ่มจากร่วมกันวิเคราะห์ปัญหาและความต้องการของแต่ละฝ่ายภายในองค์กร จากนั้นหาแนวทางใน การปรับปรุงกระบวนการจัดเก็บเอกสารให้เกิดประสิทธิภาพยิ่งขึ้นมีแพลตฟอร์มเดียวกัน และสามารถเรียกใช้งานได้ง่าย\r\n\r\n\r\n\r\nคุณสุจารี กล่าวเสริม\r\n\r\n&nbsp;\r\n<h3><strong>เลือกที่ประสบการณ์-ความพร้อม</strong></h3>\r\nเมื่อเอสซีจี เคมิคอลส์ มีแผนในการพัฒนาระบบการจัดเก็บเอกสาร ดังที่กล่าวมาแล้ว จากนั้นก็เข้าสู่กระบวนการคัดเลือกบริษัทผู้วางระบบ ซึ่งได้ให้เข้ามานำเสนอ 3 ราย ด้วยโจทย์เดียวกัน และสรุปเลือก Optimus Soft ในที่สุด\r\n\r\n&nbsp;\r\n\r\nคุณสุจารี กล่าวถึงเหตุผลที่เลือก Optimus Soft ว่ามี 3 ประการ คือ ประการแรก\r\n\r\n&nbsp;\r\n\r\n“<strong><em>ประสบการณ์และความเชี่ยวชาญ</em></strong>” ซึ่ง Optimus Soft ผ่านการอิมพลีเมนต์ระบบจัดเก็บเอกสารให้กับลูกค้ามาแล้ว หลายราย โดยเฉพาะลูกค้าในกลุ่มธนาคารซึ่งมีเอกสารจำนวนมาก มีความซับซ้อน และระบบเอกสารบางส่วนมีลักษณะคล้ายคลึงกับ เอสซีจี เคมิคอลส์ นอกจากนี้ Optimus Soft ยังมีความเชี่ยวชาญ ในการวางระบบการจัดเก็บเอกสารด้วยประการที่สอง\r\n\r\n&nbsp;\r\n\r\n“<em><strong>ความเชื่อมั่นในทีมงาน</strong></em>” Optimus Soft เป็นบริษัทที่ดำเนินธุรกิจผู้ให้บริการครบวงจร มีความมั่นคง มีบริการหลังการขายระยะยาว อีกทั้งยังมีการให้บริการที่น่าพอใจด้วยข้อมูลการให้บริการแก่บริษัทในเครือ โดยมีทีมที่เอาใจใส่ ดูแล พร้อมให้ความช่วยเหลืออย่างเต็มที่ ประการที่สาม\r\n\r\n&nbsp;\r\n\r\n“<em><strong> โซลูชัน</strong> </em>” ระบบที่เสนอเป็นโซลูชันการจัดเก็บ เอกสารครบวงจร ใช้งานได้ง่าย และตรงกับความต้องการของ เอสซีจี เคมิคอลส์\r\n\r\n&nbsp;\r\n<h3><strong>ปรับให้เหมาะสนองรับโจทย์</strong></h3>\r\nจากความหลากหลายของประเภทเอกสารตามภารกิจงานของ เอสซีจี เคมิคอลส์ นั้น โปรแกรมสำเร็จรูปมิอาจตอบโจทย์ความต้องการทั้งหมดได้ จึงต้องมีการปรับแก้เพื่อให้ใช้งานได้ตามความต้องการมากที่สุด\r\n\r\n&nbsp;\r\n\r\nซึ่งปัญหาดังกล่าวได้รับการแก้ไขจากทีมของผู้วางระบบเป็นอย่างดี พยายามหาวิธีในการปรับปรุงให้สอดรับกับงานมากที่สุด พร้อมทั้งเสนอแนะแนวทางในการจัดเก็บเอกสารเพื่อให้เกิดความคุ้มค่าสูงสุด\r\n\r\n&nbsp;\r\n\r\nโดยการอิมพลีเมนต์ ITEM Solution ของเอสซีจี เคมิคอลส์ ใช้ระยะเวลาราว 3 เดือนนับตั้งแต่รับโจทย์ซึ่งจัดว่ารวดเร็วมากเมื่อเทียบกับปริมาณงานเอกสารและความต้องการที่หลากหลาย\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n\r\nคุณสุจารี กล่าว พร้อมเสริมว่า\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n&nbsp;\r\n\r\n<img class=\"alignnone wp-image-29024 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/03/running-doc-1.jpg\" alt=\"\" width=\"750\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nคุณทัชพร วัฒนคุณธรรม Corporate Affairs Officer บริษัท เอสซีจี เคมิคอลส์ จำกัด กล่าวว่า หากมองถึงประโยชน์ของโซลูชันมี สองด้าน ในด้านของผู้ใช้ คือใช้งานได้ง่าย การค้นหาเอกสารทำได้ อย่างรวดเร็วขึ้นกว่าเดิม\r\n\r\n&nbsp;\r\n\r\nส่วนในด้านของผู้ให้บริการเอกสารหรือแอดมิน มีประโยชน์มากในด้านการบริหารจัดการเอกสาร ง่ายต่อการควบคุมเอกสาร มีการบันทึกผู้ยืม มีการบันทึกเวลาในการคืน สามารถติดตามเอกสารได้ ลดการสูญหาย และในอนาคตหากต้องเปลี่ยนผู้ดูแลเอกสารก็ไม่ต้องกังวลเรื่องการสูญหาย\r\n\r\n&nbsp;\r\n\r\nยกระดับระบบงานเอกสาร เอสซีจี เคมิคอลส์ มีเอกสารสำคัญที่ไม่สามารถประเมินมูลค่าได้ ซึ่งมีความสำคัญต่อการดำเนินธุรกิจ หากเอกสารฉบับใดฉบับหนึ่งสูญหาย อาจเกิดผลกระทบที่คาดการณ์ไม่ได้ โดยเอกสารสำคัญเหล่านี้จำเป็นจะต้องเก็บไว้ให้ปลอดภัย พร้อมที่จะเรียกใช้งานได้ทันทีและควรมีระบบแจ้งเตือนการหมดอายุ\r\n\r\n&nbsp;\r\n\r\nรวมไปถึงระบบกำหนดบุคคลที่สามารถเข้าถึงเอกสารซึ่งวันนี้เอสซีจี เคมิคอลส์ มีระบบการจัดเก็บเอกสารที่มีฟังก์ชันทุกความสามารถที่กล่าวมาอย่างครบครัน ซึ่งช่วยเพิ่มประสิทธิภาพการทำงาน และการบริหารจัดการเอกสารได้อย่างไร้กังวล",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "digital-transformation",
          "title": "Digital Transformation"
        },
        {
          "domain": "portfolio_category",
          "slug": "energy-industrial",
          "title": "Energy &amp; Industrial"
        },
        {
          "domain": "portfolio_category",
          "slug": "government-state-enterprise",
          "title": "Government &amp; State Enterprise"
        },
        {
          "domain": "portfolio_category",
          "slug": "healthcare",
          "title": "Healthcare"
        },
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        },
        {
          "domain": "portfolio_category",
          "slug": "iot-internet-of-things",
          "title": "IoT (Internet of Things)"
        },
        {
          "domain": "portfolio_category",
          "slug": "thinking",
          "title": "Thinking"
        },
        {
          "domain": "portfolio_category",
          "slug": "transportation-logistic",
          "title": "Transportation &amp; Logistic"
        }
      ]
    },
    {
      "title": "บริหารจัดการบัญชีอย่างไร ไม่ให้ลูกค้า \"หลุดมือ\"",
      "description": "ในยุคที่ข้อมูลเกี่ยวกับผู้บริโภคสามารถถูกนำมาต่อยอดและเปลี่ยนรูปมาสู่การเป็น <strong>“สินทรัพย์” </strong>ทางธุรกิจได้ทำให้บริษัทต่าง ๆ ต้องเกาะติดเเม้เเต่ <strong>“ชื่อ</strong><strong>บัญชีผู้ใช้งาน” </strong>เพื่อเป็นช่องทางการทำความรู้จักและเข้าใจลูกค้าและว่าที่คู่ค้าได้อย่างลึกซึ้ง ประตูแห่งโอกาสทางธุรกิจก็ยิ่งเปิดกว้างมากขึ้น พฤติกรรมผู้บริโภคเริ่มหันมาใช้บัญชีเครือข่างสังคมออนไลน์ใช้งานเป็นประจำในการเชื่อมต่อเข้าถึงบัญชีออนไลน์หรือข้อมูลออนไลน์โดยไม่จำเป็นต้องสร้างหรือจดจำชื่อบัญชีผู้ใช้งานและรหัสผ่านอื่น ๆ ให้มากมายอีกต่อไป\r\n\r\n<img class=\"aligncenter wp-image-24363 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/account-facebook-1.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n<h4>การขยับตัวในระดับองค์กร</h4>\r\n<div class=\"page\" title=\"Page 39\">\r\n<div class=\"section\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n<div class=\"page\" title=\"Page 39\">\r\n<div class=\"section\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n\r\nเมื่อเร็วๆ นี้ ผลสำรวจโดย Janrain บริษัทผู้พัฒนาและให้บริการแพลตฟอร์มการเข้าถึงและกำหนดอัตลักษณ์ลูกค้าระบุว่าหน่ึงในบทบาทสำคัญของ CIO ในยุคที่ข้อมูลเป็นสินทรัพย์เปี่ยมมูลค่าสำหรับทุกองค์กรคือ ต้องช่วยให้องค์กรพบหนทางที่ง่ายกว่าเดิมสำหรับลูกค้าในการเข้าถึงบัญชีออนไลน์ เนื่องจากปฏิเสธไม่ได้เลยว่าปัจจุบันผู้บริโภคต่างก็เหนื่อยหน่ายกับการกรอกข้อมูลลงทะเบียนต่าง ๆ อีกทั้งยังต้องจำชื่อผู้ใช้งานอื่น ๆ เเละรหัสผ่านที่ยาวเหยียดที่ใช้ยืนยันตัวตน และหากจะหลีกเลี่ยงความน่ารำคาญข้างต้น วิธีการหน่ึงก็คือการเข้าถึงผ่านบัญชีผู้ใช้งานเครือข่ายสังคมออนไลน์ <strong>“Social Log-In”</strong> ซึ่งผู้ใช้งานสามารถเชื่อมต่อทุกข้อมูลออนไลน์ผ่านบัญชีโซเชียล อย่างเช่น Facebook\r\n\r\n</div>\r\n<img class=\"aligncenter wp-image-24356 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/facebook-2.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n<div class=\"column\">\r\n<div class=\"page\" title=\"Page 39\">\r\n<div class=\"section\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n\r\nเมื่อหันมาดูตัวเลขจำนวนผู้ใช้งํานเครือข่ายโซเชียลยอดนิยมอันดับ 1 ของโลก จากข้อมูลเชิงสถิติอย่างเป็นทางการล่าสุดจากเฟซบุ๊กระบุว่า สิ้นไตรมาส 3 ปี 2016 มีจำนวนผู้ใช้งานที่เป็น Active Users สูงถึง 1.79 พันล้านคนนั้นยังมองเห็นไม่ชัดเจนถึง <strong>“ข้อมูลผู้บริโภค”</strong> จำนวนมหาศาลที่จะหลั่งไหลเข้าสู่ภาคธุรกิจต่างๆ ผ่านรูปแบบการเชื่อมต่อโลกออนไลน์ผ่าน Social Log-In ในอนาคต\r\n\r\n<img class=\"aligncenter wp-image-24357 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/การยอมรับในการล็อคอินผ่านโซเชียล-1.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n<div class=\"page\" title=\"Page 39\">\r\n<div class=\"section\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n\r\nอย่างไรก็ตาม ผลการศึกษาหลายฉบับได้ข้อสรุปตรงกันว่า ยังมีผู้ใช้งานจํานวนมากมักหลีกเลี่ยงการทำ Social Log-In เพราะไม่ต้องการให้บริษัทหรือองค์กรต่างๆ ได้ข้อมูลส่วนตัวเกี่ยวกับกิจกรรมบนสื่อสังคมออนไลน์ ขณะท่ีมีหลายคนกังวลเกี่ยวกับความปลอดภัยและการถูกจู่โจมด้วยข้อความมหาศาลด้านกิจกรรมการตลาดจากบริษัทต่าง ๆ เเบบไม่มีทางหนีรอด\r\n\r\n<img class=\"aligncenter wp-image-24358 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/บริหารจัดการลูกค้าไม่ให้หลุดมือ-1.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n<h4>พฤติกรรมของผู้บริโภคที่เปลี่ยนแปลงไป</h4>\r\n<div class=\"page\" title=\"Page 39\">\r\n<div class=\"section\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n\r\nเจมี่ เบ็คแลนด์ รองประธานฝ่ายผลิตภัณฑ์ของ Janrain กล่าวว่า Social Log-In ก็คือผลประโยชน์ขั้นต่ำ (Table Stakes) ที่ธุรกิจออนไลน์จะได้ไว้ในมืออยู่แล้ว เนื่องจากผู้ใช้งานเว็บไซต์ส่วนใหญ่มักจะใช้บัญชีโซเชียลในการลงทะเบียนเว็บไซต์ใหม่ ๆ ด้วย เเต่ทั้งนั้นผู้บริหารของธุรกิจออนไลน์ก็ต้องเข้าใจถึงข้อกังวลเรื่องความปลอดภัยข้อมูลส่วนบุคคลด้วย โดยเฉพาะเมื่อมีข่าวสารเกี่ยวกับการรั่วไหลของข้อมูลลูกค้าจำนวนมากถูกนำเสนอออกมาเป็นระยะๆ\r\n\r\n<img class=\"aligncenter wp-image-24359 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/ความเป็นส่วนตัวของข้อมูล-1.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n<div class=\"page\" title=\"Page 39\">\r\n<div class=\"section\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n\r\nโดยผลสํารวจครั้งนี้ พบว่ามีสัดส่วนถึง 94% ยังกังวลเกี่ยวกับความเป็นส่วนตัวของข้อมูลและ 61% แสดงความกังวลอย่างมาก<strong> </strong>อย่างไรก็ตาม 2 ใน 3 ของผู้ตอบแบบสํารวจมีเเนวคิดเป็นกลางสําหรับเทคโนโลยใหม่ ๆ ในการเข้าถึงบัญชีออนไลน์ อย่างเช่น วิธีสแกนลายนิ้วมือหรือระบบจดจำเสียง อีกหนึ่งข้อมูลที่น่าสนใจจากรายงานฉบับนี้ก็คือ<strong>  “ปฏิกิริยา”</strong> ของผู้บริโภคที่จะมีต่อข่าวสารที่ไม่ตรงกับความสนใจของพวกเขา โดยเฉพาะหากได้รับข่าวสํารพวกนั้น <strong>“ถี่”</strong> หรือมากเกินไป โดยกลุ่มตัวอย่าง 85% บอกว่าจะยกเลิกการรับข่าวสารผ่านอีเมล์จากบริษัทนั้น ๆ , 63% ไม่ใส่ใจการสื่อสารท่ี่มาจากบริษัทนั้นอีกต่อไป, 59% ตั้งค่าให้เป็นเมล์ขยะ, 36% เลิกเข้าไปยังเว็บไซต์ และ 27% บอกว่าจะหยุดซื้อผลิตภัณฑ์จากบริษัทนั้น\r\n\r\n<img class=\"aligncenter wp-image-24360 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/ผลงานต่ำกว่ามาตรฐาน.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n<div class=\"page\" title=\"Page 40\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n<h4><strong>ผลสำรวจข้างต้น สะท้อนชัดเจนถึงโจทย์ท้าทายสำหรับภาคธุรกิจคือ จำเป็นต้องมีแนวทางท่ี “ดียิ่งขึ้น” ในการใช้ข้อมูลจากบัญชีลูกค้าไปทำการตลาดควบคู่กับการอธิบายอย่างชัดเจนแก่ลูกค้าว่าข้อมูลบัญชีที่พวกเขาเข้าถึงนั้นด ถูกนำไปใช้และแบ่งปันอย่างไร</strong></h4>\r\n</div>\r\nCr.CIO Insight\r\n\r\nhttp://www.techfreakstuff.com/2010/04/hack-facebook-account-username-password.html\r\n\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "energy-industrial",
          "title": "Energy &amp; Industrial"
        },
        {
          "domain": "portfolio_category",
          "slug": "media",
          "title": "Media"
        },
        {
          "domain": "portfolio_category",
          "slug": "retails",
          "title": "Retails"
        },
        {
          "domain": "portfolio_category",
          "slug": "transportation-logistic",
          "title": "Transportation &amp; Logistic"
        }
      ]
    },
    {
      "title": "FIDO: Future of Online Authentication",
      "description": "<h4>การยืนยันตัวตน (Authentication) บนโลกออนไลน์</h4>\r\n<img class=\"aligncenter wp-image-24431 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/Authentication.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nถือเป็นปัจจัยทางความมั่นคงที่มีความสำคัญสูงสุด เพราะเป็นวิธีการที่องค์กรใช้ในการระบุตัวตนของผู้ใช้งานระบบ ไม่ว่าจะเป็นพนักงานหรือลูกค้างานวิจัยจำนวนมากบ่งชี้ว่ากว่า 80% ของการโจมตีมีต้นเหตุหรือต่อยอดมาจากการขโมย Password ไม่ว่าจะด้วยวิธี Phishing หรือการใช้ Weak Password ที่เดาได้ง่าย (ง่ายต่อการ Brute Force) หรือผู้ใช้งานระบบมีการใช้ Username และ Password ที่ซ้ำกันในหลายระบบ\r\n\r\n<img class=\"aligncenter wp-image-24432 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/Force.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\nทำให้หากระบบ A ถูกโจมตีแล้วคนร้ายได้ Username/Password ของนาย ก. ไป พยายามใช้ในระบบ B ถ้านาย ก. ใช้ Username/Password เดียวกัน ยึดครอง Account บนระบบ B ได้ด้วย เป็นต้นปัจจุบันมีโซลูชันมากมายช่วยให้การใช้ Username/Password ในการยืนยันตัวตนออนไลน์ปลอดภัยขึ้น เช่น การใช้ One-Time-Password (OTP) ผ่าน SMS (ธนาคารหลายๆ แห่งในประเทศไทยใช้ระบบ OTP) หรือการใช้ Time -Based OTP แอปพลิเคชัน เช่น ระบบของ Microsoft, Google, Facebook มีให้เลือกใช้เพื่อเป็น 2nd Factor Authentication (Password = Something You Know, OTP = Something You Have) หรือการยืนยันตัวตนทางที่สองเพื่อลดความเสี่ยง\r\n\r\n<img class=\"aligncenter wp-image-24433 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/OTP.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nแต่การใช้ระบบดังกล่าวมีข้อเสีย เช่น นำไปใช้ยาก (App TOTP ต้องมีการ Setup ที่ซับซ้อนและการเปลี่ยนหรือย้ายสิทธิของแอปพลิเคชันบนเครื่องต้องมีการเตรียมการล่วงหน้า) หรือมีต้นทุนสูงขึ้น (เช่น SMS-OTP เพิ่มต้นทุนให้ระบบ) และทั้งหมดนี้ยังประสบปัญหายุ่งยากในการใช้งาน (ต้องพิมพ์หลายหนทั้ง Username/Password และ OTP ด้วย) และยังอาจจะถูกทำ Phishing หรือ Man-in-the-Middle เพื่อขโมย Username/Password/OTP ได้อยู่ดี (ยากขึ้นแต่ปัญหาไม่หมดไป)\r\n\r\n<img class=\"aligncenter wp-image-24437 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/Phishing.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n<h4></h4>\r\n<h4>FIDO (Fast IDentity Online: <a href=\"https://fidoalliance.org\">https://fidoalliance.org</a>)</h4>\r\nเป็นการรวมกลุ่มพันธมิตรของบริษัทยักษ์ใหญ่ทางเทคโนโลยีของโลก เพื่อแก้ปัญหาของความไม่ปลอดภัยของการใช้ Username/Password ในการยืนยันตัวตนออนไลน์ โดย FIDO ได้จัดทำมาตรฐาน Online Authentication ที่ใช้ Biometric เช่น ลายนิ้วมือ เสียง ภาพ หรือองค์ประกอบทางกายภาพของร่างกาย มาใช้ในการยืนยันตัวตนอย่างปลอดภัยมากขึ้น โดยมีเป้าหมายเพื่อให้เกิด Passwordless Authentication Experience เพื่อนำไปสู่การลดการใช้ Username/ Password ลง เป้าหมายคือลดโดยสิ้นเชิง\r\n\r\n<img class=\"aligncenter wp-image-24436 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/FIDO.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\nมาตรฐานของ FIDO นั้นเป็น Open Standard Protocol โดยมีการออกใบอนุญาตรับรองสองประเภทคือ UAF (Universal Authentication Framework) และ U2F (Universal Second Factor) หากระบบใดมีการอิมพลีเม้นต์ตามมาตรฐานแล้ว จะสามารถใช้ร่วมกับระบบอื่นๆ ที่ใช้มาตรฐานเดียวกันไม่ว่าจะใช้ยี่ห้อใดก็ตาม ซึ่งเป็นอุปสรรคของการนำระบบ Biometric มาใช้ในอดีต (เพราะหากซื้อระบบของ ยี่ห้อใด ก็ต้องซื้ออุปกรณ์ของยี่ห้อนั้นตลอดไป หรือ Locked-In นั่นเอง)\r\n<h4></h4>\r\n<h4>UAF คือ Passwordless User Experience</h4>\r\n<img class=\"aligncenter wp-image-24434 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/UAF.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\nซึ่งมีหลักการง่ายๆ คือ ผู้ใช้จะต้องมีอุปกรณ์ที่มี UAF Compatible อยู่ (เป็นฮาร์ดแวร์หรือเป็นแอปพลิเคชันก็ได้ เช่น iPhone/Android ที่มี UAF Stack ดังเช่นรุ่นที่มี Programmable Secure Enclave) เมื่อผู้ใช้ต้องการล็อกอินเข้าเว็บหรือเข้าระบบที่รองรับ UAF ผู้ใช้ทำการยืนยันตัวตนเข้ากับอุปกรณ์ที่ตนเองถืออยู่ด้วย Biometric หรือ PIN (ในกรณีที่อุปกรณ์ ไม่มี Biometric) อุปกรณ์ดังกล่าวจะทำการยืนยันตัวตนเพื่อเข้าเว็บหรือระบบโดยไม่มีการส่ง Biometric หรือ PIN ไปยังระบบ (กล่าวคือ Biometric หรือ PIN นั้นจะไม่ถูกส่งออกจากอุปกรณ์ของผู้ใช้เลย ทำให้ไม่สามารถถูกขโมยได้) โดยวิธีการยืนยันตัวตนนั้นใช้ Cryptographic Protocol ที่สามารถป้องกันการโจมตีได้ (Public Key Cryptography)\r\n\r\n<img class=\"aligncenter wp-image-24435 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/Biometric.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nการยืนยันตัวตนแบบ UAF นั้นเทียบได้กับการมี 2-Factor Authentication คือ Something You Are (Biometric) และ Something You Have (อุปกรณ์ UAF) ส่วน U2F หรือ Second Factor User Experience นั้น ทำงานคล้ายกัน คือ ผู้ใช้ทำการล็อกอินเข้าเว็บหรือระบบด้วย Username/Password จากนั้นระบบจะถามหา U2F Device ผู้ใช้จึงทำการยืนยันตัวตนกับอุปกรณ์ดังกล่าว ซึ่งระบบจะสื่อสารกับเว็บหรือระบบเองด้วย Protocol ที่ปลอดภัยเช่นเดียวกับ UAF เพื่อใช้ในการยืนยันตัวตน ซึ่งในรูปแบบนี้จะเสมือนกับการทำ 3-Factor Authentication คือ Something You Know (Username/Password), Something You Are (Biometric) และ Something You Have (อุปกรณ์ U2F)\r\n\r\n&nbsp;\r\n\r\n<img class=\"aligncenter wp-image-24441 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/U2F.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\nการยืนยันตัวตนทั้งหมดนี้จะต้องมีการลงทะเบียนอุปกรณ์ UAF/U2F ไว้กับระบบก่อนโดยเรียกว่า ขั้นตอนการ Registration เป็นขั้นตอนการนำ Public Key ของ UAF/U2F Device ไปผูกกับ Biometric (หรือ PIN) จากนั้นทำการฝากไว้ที่เซิร์ฟเวอร์ ทำการผูก Identity ของผู้ใช้ (Something You Are) เข้ากับอุปกรณ์ดังกล่าว (Something You Have) โดยที่หากคนร้ายได้อุปกรณ์ดังกล่าวไปก็ไม่สามารถใช้ยืนยันตัวตนได้ เนื่องจากไม่มี Biometric หรือ PIN หรือหากคนร้ายขโมย Biometric หรือ PIN ไปได้ (เช่นลอกลายนิ้วมือหรืออัดเสียง) ก็ไม่มีอุปกรณ์ดังกล่าว หากซื้ออุปกรณ์ชิ้นใหม่ก็ไม่สามารถล็อกอินได้เพราะระบบได้ผูก Biometric เข้ากับอุปกรณ์นั้นเพียงชิ้นเดียว\r\n\r\n<img class=\"aligncenter wp-image-24440 size-full\" src=\"https://www.g-able.com/engine/wp-content/uploads/2017/04/Registration-1.jpg\" alt=\"\" width=\"700\" height=\"350\" />\r\n\r\n&nbsp;\r\n\r\nทั้งนี้ อาจจะมีหลายคนสงสัยว่าการใช้ PIN (ที่ไม่ใช่ Biometric) ในการยืนยันตัวตนกับ U2F หรือ UAF Device นั้นต่างจากการใช้ Password อย่างไร ความแตกต่างคือ PIN ใช้ยืนยันตัวตนกับ UAF/U2F Device เท่านั้น โดยไม่ได้เก็บไว้บนเซิร์ฟเวอร์ จึงไม่สามารถขโมยได้ ถึงแม้จะมีความปลอดภัยที่ต่ำกว่า Biometric แต่ปลอดภัยกว่า Password เพราะคนร้ายไม่สามารถขโมย PIN นี้จากเซิรฟ์เวอร์ได้ และเเม้เเต่คนร้ายทำ Phishing ได้ PIN นี้ไปก็ไม่มีประโยชน์หากเขาไม่สามารถขโมย UAF/U2F Device ที่ผูกไว้กับ PIN นี้\r\n\r\n&nbsp;\r\n\r\n<strong>การยืนยันตัวตนรูปแบบใหม่ของ FIDO นี้ เราเชื่อว่าจะมาแทนที่การใช้ Username/Password โดยทั่วไปอย่างแน่นอน และเป็นการใช้ Biometric ยืนยันตัวตนแบบถูกต้องปลอดภัยต่างจากการใช้ Biometric ที่มีใช้อยู่ทั่วไป เช่น บางระบบมีการนำ Biometric ไปเก็บบนเซิร์ฟเวอร์ (เสี่ยงต่อการถูกโจมตี) หรือบางระบบเพียงเอา Biometric มาเก็บ Username/Password หรือ Session Token บนอุปกรณ์มือถือเท่านั้น การยืนยันตัวตนกับระบบยังคงใช้ Username/Password เพื่อยืนตัวตนเช่นเดิม (แอปพลิเคชันหลายๆ ตัวที่ใช้ TouchID บน iPhone มีลักษณะนี้) ซึ่งไม่ได้เพิ่มความปลอดภัยขึ้นเพราะหากมีการขโมย Username/Password ไปได้ก็สามารถทำการโจมตีได้เช่นกัน</strong>\r\n\r\n&nbsp;\r\n\r\nขอบคุณรูปภาพประกอบจาก\r\n<ul>\r\n \t<li>www.cmtelecom.com/products/messaging/one-time-password</li>\r\n \t<li>http://www.komando.com/happening-now/390476/top-story-got-these-emails-from-paypal-or-amazon-delete-them-theyre-phishy</li>\r\n \t<li>http://www.ballinahockey.org.au/club-news/selection-trials-and-registration/</li>\r\n \t<li>https://www.yubico.com/about/background/fido/</li>\r\n</ul>",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "energy-industrial",
          "title": "Energy &amp; Industrial"
        },
        {
          "domain": "portfolio_category",
          "slug": "healthcare",
          "title": "Healthcare"
        }
      ]
    },
    {
      "title": "Gosoft วางใจ G-Able ติดตั้งและดูแลระบบ Application Performance Monitoring เพื่อเพิ่มประสิทธิภาพงานบริการให้กับ 7-Eleven ทั่วประเทศ",
      "description": "<img class=\"aligncenter wp-image-31047\" src=\"https://www.g-able.com/engine/wp-content/uploads/2018/01/GOSOFT-25611129-IMG_4881-2-1024x682.jpg\" alt=\"\" width=\"700\" height=\"467\" />\r\n<h6 style=\"text-align: center;\">คุณประวิทย์ ตั้งมโนเพียรชัย ตำแหน่ง Team Leader ฝ่าย Technical Infrastructure บริษัท Gosoft</h6>\r\n&nbsp;\r\n\r\n<strong>‘การรักษาประสิทธิภาพ’</strong>คือหัวใจสำคัญของธุรกิจ และเมื่อเป็นธุรกิจขนาดยักษ์ใหญ่อย่าง ‘7-Eleven’ ที่มีสาขา พาร์ทเนอร์ และลูกค้าอยู่มากมาย หนึ่งในโจทย์สำคัญที่ช่วยสนับสนุนงานบริการของ 7-Eleven ให้เป็นไปอย่างราบรื่น คือ การมอนิเตอร์ระบบงานไอที สำหรับการตรวจจับปัญหาก่อนที่ปัญหาจะเกิด หรือเรียกว่าการทำ Proactive Monitoring วิเคราะห์หาต้นตอของปัญหา (Root Cause Analysis) เพื่อให้สามารถแก้ไขได้ตรงจุด รวดเร็ว\r\n\r\n&nbsp;\r\n\r\nนั่นทำให้ บริษัท โกซอฟท์ (ประเทศไทย) จำกัด หรือ Gosoft บริษัทที่ทำหน้าที่เป็น ไอที (Information Technology) ส่วนกลางให้กับบริษัท ซีพี ออลล์ จำกัด (มหาชน) และบริษัทในเครือทั้งหมด ซึ่งมีหน้าที่หลักในการ ดูแลแก้ไขระบบไอที ต้องมุ่งแสวงหาโซลูชันเพื่อตอบโจทย์ดังกล่าว โดยมีพันธมิตรอย่าง G-Able เข้ามาติดตั้งและดูแลระบบ <strong>Application Performance Monitoring (APM)</strong> ของ Dynatrace เพื่อตรวจสอบประสิทธิภาพการทำงานของระบบไอที และประเมินความเสถียรภาพของการใช้งานระบบจาก 7-Eleven ทุกสาขาทั่วประเทศ\r\n\r\n&nbsp;\r\n\r\n<img class=\"aligncenter wp-image-31048\" src=\"https://www.g-able.com/engine/wp-content/uploads/2018/01/GOSOFT-25611129-IMG_4863.jpg\" alt=\"\" width=\"700\" height=\"467\" />\r\n\r\n<strong>คุณประวิทย์ ตั้งมโนเพียรชัย ตำแหน่ง Team Leader ฝ่าย Technical Infrastructure บริษัท Gosoft</strong> เปิดเผยว่าบริษัทฯ ต้องการเปลี่ยนจากระบบมอนิเตอร์ตามส่วนต่างๆ เช่น ส่วน Database ส่วน Firewall มาเป็นระบบที่สามารถมอนิเตอร์แบบองค์รวม\r\n\r\n&nbsp;\r\n\r\n“แต่เดิมเราจะมีตัวมอนิเตอร์เป็นจุดๆ แต่เวลาเกิดปัญหาจะไม่มีทางรู้เลยว่าเกิดจากจุดใด เราจึงมองหาเครื่องมือที่จะทำให้เราเห็นปัญหาตั้งแต่ต้นจนจบ” คุณประวิทย์กล่าว\r\n\r\n&nbsp;\r\n<h4></h4>\r\n<h4></h4>\r\n<strong>เลือกโปรดักส์ที่ตอบโจทย์และผู้ให้บริการที่เข้าใจ</strong>\r\n\r\nผลจากการทำ Proof of Concept (POC) ระบบ APM โดย G-Able ได้คะแนนสูงสุด จึงได้รับความไว้วางใจให้มาเป็นผู้ติดตั้งและดูแลระบบ\r\n\r\nคุณประวิทย์กล่าวถึงเหตุผลที่ทำให้การติดตั้งระบบ APM จาก G-Able ประสบผลสำเร็จ คือ\r\n\r\n<strong>“โปรดักส์ที่ตอบโจทย์”</strong> โปรดักส์ Dynatrace ที่ G-Able นำเสนอนั้นสามารถทำตามโจทย์ที่ Gosoftคาดหวังได้อย่างมีประสิทธิภาพ\r\n\r\n<strong>“ความเข้าใจของผู้ให้บริการ”</strong> G-Able สามารถตีโจทย์ความต้องการของทาง Gosoft และให้บริการด้วยความเข้าใจ พร้อมเข้าแก้ปัญหาอย่างตรงจุด\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n<strong>ตรวจสอบและแก้ปัญหาได้ตรงจุด</strong>\r\n\r\nระบบ APM ช่วยให้เห็นจุดที่เป็นปัญหาได้เร็วและแม่นยำขึ้น เช่น ช่วยให้ทราบว่า Coding ส่วนใดมีปัญหา หรือ การเชื่อมต่อกับระบบฐานข้อมูล (Database) ผิดปกติหรือไม่ ซึ่งทำให้ Gosoft แก้ปัญหาได้อย่างตรงจุด หรือป้องกันโดยไม่ต้องรอให้ปัญหาเกิดขึ้นก่อน หรือหากเจอปัญหาก็สามารถย้อนกลับมาตรวจสอบจาก Log ได้ ยกตัวอย่างเช่น ระบบ Online Payment การซำระเงินที่เคาท์เตอร์ 7-Eleven จะมีการกำหนดเวลารอรับบริการ (Service Level Agreement) หาก Transaction ไม่สำเร็จหรือช้ากว่าคาปกติที่ตั้งไว้ ระบบ APM สามารถแสดงเส้นทาง Transaction ตั้งแต่ระบบหน้าร้านไปจนถึงปลายทางคือผู้ว่าจ้างหรือเจ้าหนี้ของลูกค้าได้ว่าติดขัดที่จุดใด และใช้เป็นข้อมูลอ้างอิงในกรณีที่ผู้ว่าจ้างต้องการทราบที่มาของปัญหา เป็นต้น\r\n\r\n&nbsp;\r\n\r\n<strong>ลดค่าใช้จ่ายของบริษัท</strong>\r\n\r\nการวิเคราะห์ปัญหาที่ตรงจุด ช่วยทำให้ CP All บริหารงบประมาณการลงทุนในการแก้ปัญหาได้อย่างเหมาะสม และคุ้มค่า สามารถเห็นผลลัพธ์ที่วัดค่าได้ชัดเจน\r\n\r\n&nbsp;\r\n\r\n<img class=\"aligncenter wp-image-31049\" src=\"https://www.g-able.com/engine/wp-content/uploads/2018/01/GOSOFT-25611129-IMG_4827.jpg\" alt=\"\" width=\"700\" height=\"467\" />\r\n\r\n&nbsp;\r\n\r\n<strong>ความประทับใจในการทำงานร่วมกับ G-Able</strong>\r\n\r\n&nbsp;\r\n\r\n“ตั้งแต่วันแรกที่เข้ามานำเสนอ จนถึงวันที่ส่งมอบโครงการ ทาง G-Able ให้การสนับสนุนเป็นอย่างดี ไม่ว่าจะเป็นการให้ข้อมูลของระบบ ช่วยเหลือแนะนำการใช้งานระบบ รวมถึงการทำ Knowledge Transfer และ Technology Update”\r\n\r\n&nbsp;\r\n\r\nEnd Result หรือผลที่ได้รับหลังการติดตั้งใช้งาน คือ การล่วงรู้ปัญหาในระบบไอทีได้อย่างแม่นยำ สามารถแก้ไขได้อย่างตรงจุด รวดเร็ว เพื่อบริหารค่าใช้จ่ายได้อย่างเหมาะสม ทำให้ Gosoft and CP All เดินหน้าตามยุทธศาสตร์ทางธุรกิจได้อย่างไร้ข้อกังวล อีกทั้งยังได้สร้างความมั่นใจให้กับคู่ค้าในการจับมือดำเนินธุรกิจไปด้วยกัน\r\n\r\n&nbsp;\r\n\r\nอ่านเรื่องราวความประทับใจของลูกค้าอื่นๆได้ที่นี่\r\n\r\n<!--HubSpot Call-to-Action Code --><span id=\"hs-cta-wrapper-a55f13c5-2bbc-4ec7-b5b9-8ed072690deb\" class=\"hs-cta-wrapper\"><span id=\"hs-cta-a55f13c5-2bbc-4ec7-b5b9-8ed072690deb\" class=\"hs-cta-node hs-cta-a55f13c5-2bbc-4ec7-b5b9-8ed072690deb\"><!-- >\r\n<div id=\"hs-cta-ie-element\"></div>\r\n<!--><a href=\"https://cta-redirect.hubspot.com/cta/redirect/2667344/a55f13c5-2bbc-4ec7-b5b9-8ed072690deb\"><img id=\"hs-cta-img-a55f13c5-2bbc-4ec7-b5b9-8ed072690deb\" class=\"hs-cta-img\" style=\"border-width: 0px;\" src=\"https://no-cache.hubspot.com/cta/default/2667344/a55f13c5-2bbc-4ec7-b5b9-8ed072690deb.png\" alt=\"Customer Stories\" /></a></span><script charset=\"utf-8\" src=\"https://js.hscta.net/cta/current.js\"></script><script type=\"text/javascript\"> hbspt.cta.load(2667344, 'a55f13c5-2bbc-4ec7-b5b9-8ed072690deb', {}); </script></span><!-- end HubSpot Call-to-Action Code -->",
      "category": [
        {
          "domain": "portfolio_tag",
          "slug": "7-11",
          "title": "7-11"
        },
        {
          "domain": "portfolio_tag",
          "slug": "apm",
          "title": "APM"
        },
        {
          "domain": "portfolio_tag",
          "slug": "application-performance-monitoring",
          "title": "Application Performance Monitoring"
        },
        {
          "domain": "portfolio_tag",
          "slug": "cp",
          "title": "CP"
        },
        {
          "domain": "portfolio_category",
          "slug": "customer-journey",
          "title": "Customer Journey"
        },
        {
          "domain": "portfolio_tag",
          "slug": "g-able",
          "title": "G-Able"
        },
        {
          "domain": "portfolio_tag",
          "slug": "gosoft",
          "title": "Gosoft"
        },
        {
          "domain": "portfolio_category",
          "slug": "it-operation-management",
          "title": "IT Operation Management"
        }
      ]
    },
    {
      "title": "ตัดสินใจได้ชาญฉลาดยิ่งขึ้น ด้วย Tableau เครื่องมือวิเคราะห์เชิงลึก",
      "description": "<span style=\"color: #333333;\"><strong>ผลลัพธ์ที่สำคัญ</strong></span>\r\n<ul>\r\n \t<li><span style=\"color: #333333;\">บริดจ์สโตนสามารถวิเคราะห์ผลการดำเนินธุรกิจได้แบบทุกที่ทุกเวลา</span></li>\r\n \t<li><span style=\"color: #333333;\">สามารถดึงข้อมูลเชิงลึกจากข้อมูลทั่วไปในเวลาเพียงไม่กี่นาที แทนที่จะต้องใช้เวลา 2-3 ชั่วโมง</span></li>\r\n \t<li><span style=\"color: #333333;\">ตอนนี้พนักงานร้อยละ 50 ของบริษัทใช้ <strong>Tableau</strong> ประกอบการตัดสินใจด้วยข้อมูล</span></li>\r\n</ul>\r\nบริดจสโตน ผู้นำระดับโลกในการพัฒนานวัตกรรมเทคโนโลยีด้านยางรถยนต์ มุ่งมั่นและพัฒนาอย่างต่อเนื่องจนเกิดเป็นผลิตภัณฑ์ต่าง ๆ มากมาย เช่น ยางรถยนต์ประหยัดน้ำมันที่ทำให้ใช้เชื้อเพลิงได้อย่างมีประสิทธิภาพมากยิ่งขึ้น\r\n\r\n&nbsp;\r\n\r\nปรัชญาที่บริดจ์สโตนยึดถือนั้น ได้ช่วยชี้นำให้องค์กรสามารถสรรค์สร้างผลิตภัณฑ์และชุมชนที่ดีขึ้น และรวมถึงการมีพันธะสัญญาในการที่จะตัดสินใจบนพื้นฐานของเหตุและผล\r\n\r\n&nbsp;\r\n\r\nแน่นอนว่าบริษัท บริดจสโตนเซลส์ (ประเทศไทย) เองนั้นก็ยึดมั่นในปรัชญานี้ ในฐานะที่เป็นบริษัทหนึ่งของของกลุ่มบริดจสโตน โดยบริษัทได้ทำงานโดยใช้ซอฟต์แวร์ Tableau และร่วมมือกับพาร์ทเนอร์ผู้เชี่ยวชาญอย่างบริษัท G-Able ในการสร้างเสริมวัฒนธรรมการใช้ข้อมูลขององค์กร ทำให้ปัจจุบันบริษัทสามารถใช้ Tableau แทนสเปรดชีตต่าง ๆ เพื่อให้ทีมในบริษัทสามารถเข้าใจข้อมูลที่ตนมีได้ดียิ่งขึ้น\r\n<h6>- คุณสิงหเดช ชำนาญนัก ผู้จัดการแผนก IT บริษัทบริดจสโตนเซลส์ (ประเทศไทย) กล่าว</h6>\r\n\r\n<h2><span style=\"color: #010101;\"><strong>การจูงใจให้พนักงานหันมาใช้งาน </strong><strong>Tableau</strong></span></h2>\r\nก่อนหน้านี้ ทีมงานของบริษัท จำเป็นต้องใช้สเปรดชีตในการวิเคราะห์ข้อมูล ทว่า การใช้สเปรดชีตนั้นก็มีข้อจำกัดในการวิเคราะห์ อีกทั้ง ยังเสียเวลาในการรวบรวมข้อมูลจากแหล่งข้อมูลต่าง ๆ ที่แตกต่างกัน เช่น ERP ของบริดจสโตน\r\n\r\n&nbsp;\r\n\r\n“เช่นเดียวกับหลาย ๆ บริษัท ในอดีตเราเองก็เคยทำอะไรในแบบเดิม ๆ มาก่อน แต่สุดท้ายแล้ว เราเองก็อยากได้เครื่องมือที่จะช่วยให้เราวิเคราะห์ขั้นสูงได้มากกว่านี้ เราจึงลองพิจารณาโซลูชันหลาย ๆ แบบ แล้วพบว่า Tableau คือ โซลูชันที่ตอบโจทย์ความต้องการต่าง ๆ ของเราได้ทั้งหมด” คุณสิงหเดช ชำนาญนัก ผู้จัดการแผนก IT บริษัทบริดจสโตนเซลส์ (ประเทศไทย) กล่าว “ข้อดีของ Tableau คือ เป็นซอฟต์แวร์ที่ทรงพลังมาก ทำให้ผู้ใช้สามารถนำเสนอข้อมูลของตนเองได้เมื่อต้องการ ดังนั้น เมื่อใดก็ตามที่ฝ่ายบริหารมีคำถาม พนักงานก็สามารถเปิดดูแดชบอร์ดของตนเอง และนำเสนอข้อมูลได้อย่างรวดเร็ว”\r\n\r\n&nbsp;\r\n\r\nบริดจสโตนยังจับมือทำงานร่วมกับบริษัท G-Able เนื่องจากบริษัทต้องการผู้เชี่ยวชาญชาวไทยเข้ามาช่วยเหลือในการนำโซลูชันไปใช้งานและผลักดันให้มีการนำไปใช้ เพราะโดยธรรมชาติแล้วพนักงานมักจะหันไปใช้สเปรดชีตทุกครั้งที่ต้องวิเคราะห์หรือจัดทำรายงาน ทั้งนี้ เพื่อจะให้พนักงานหันมาใช้ Tableau ทาง G-Able จึงจัดการอบรมเชิงปฏิบัติการ (workshop) และโครงการอบรมต่าง ๆ เพื่อให้พนักงานได้เห็นถึงประโยชน์ที่จะได้รับจากการใช้โปรแกรม และสอนวิธีการใช้งานอีกด้วย\r\n\r\n&nbsp;\r\n\r\nโดยในขั้นตอนแรกของการนำไปใช้ บริษัทเริ่มจากการนำ <strong>Tableau Desktop</strong> มาใช้ในแผนกวางแผนทรัพยากรบุคคลและทีมฝ่ายการเงินก่อน เนื่องจากทีมดังกล่าวต้องทำงานวิเคราะห์สเปรดชีตกันแบบวันต่อวันอยู่แล้ว ดังนั้น การที่ทำให้ทีมเหล่านี้หันมาใช้โปรแกรมได้ ก็ถือได้ว่าเป็นความสำเร็จก้าวสำคัญ\r\n\r\n&nbsp;\r\n\r\nขณะนี้ พนักงานจากทีมดังกล่าวไม่เพียงแค่สนับสนุนการใช้ Tableau เท่านั้น แต่ยังช่วยเหลือผู้ใช้งานคนอื่น ๆ ทั่วทั้งบริษัทอีกด้วย ปัจจุบันบริดจสโตนได้นำ<strong> Tableau Server</strong> มาใช้ด้วย ทำให้ทีมที่มีความคล่องตัวอย่างฝ่ายขายนั้น สามารถเข้าถึงข้อมูลเชิงลึกได้ทุกที่ทุกเวลา\r\n<h6>- คุณสิงหเดช ชำนาญนัก ผู้จัดการแผนก IT บริษัทบริดจสโตนเซลส์ (ประเทศไทย) กล่าว</h6>\r\n\r\n<h2><strong>เพิ่มความพร้อมให้แก่ข้อมูล</strong></h2>\r\nหนึ่งในข้อดีของ Tableau คือ ซอฟต์แวร์นี้สามารถรวมข้อมูลจากหลาย ๆ แหล่งเข้าด้วยกันได้ ทำให้บริดจสโตนสามารถวิเคราะห์และสรุปข้อมูลที่มีออกมาเป็นภาพได้ภายในที่เดียว ซึ่งรวมถึงข้อมูลที่อยู่ใน SAP และข้อมูลการตลาดและการขาย ที่อยู่ในรูปแบบของไฟล์ CSV และไฟล์ Excel\r\n\r\n&nbsp;\r\n\r\nปัจจุบัน เวลาใช้ในการวิเคราะห์รายวันนั้น ลดไปถึงร้อยละ 50 ทำให้ประหยัดเวลาไปได้ถึง 2 ชั่วโมงครึ่งต่อวัน นอกจากนี้ ผู้ใช้ Tableau 148 คนในบริษัท ยังสามารถทำงานร่วมกันได้โดยใช้แหล่งข้อมูลที่มีความจริงแท้เพียงหนึ่งแหล่งเท่านั้น และสามารถนำข้อมูลที่ได้ ไปสร้างและปรับในแดชบอร์ดของตนเองได้ แทนที่จำเป็นจะต้องไปหาฝ่าย IT ให้ช่วยจัดการ\r\n\r\n&nbsp;\r\n\r\nคุณสิงหเดชเล่าว่า ผลลัพธ์ที่ได้นั้นดีขึ้นสำหรับทุก ๆ คน “ผู้ใช้งานธุรกิจได้ทราบถึงข้อมูลของตนเอง และรู้ว่าตัวเองต้องการอะไรบ้าง ต่างกับเมื่อก่อน ที่ฝ่าย IT จะต้องเสียเวลามากมายกับการรวบรวมข้อมูลที่ต้องใช้ แถมบางครั้ง ก็ทำออกมาได้ไม่ถูกต้อง”\r\n\r\n&nbsp;\r\n\r\nหนึ่งในข้อมูลสำคัญที่ทางบริดจสโตนติดตามอยู่ นั่นคือ ข้อมูลอัตราการตอบสนองต่อกิจกรรมการขายและการตลาดของลูกค้า และเมื่อมี Tableau ทีมต่าง ๆ ก็สามารถจับตาดูข้อมูลดังกล่าวได้แบบเรียลไทม์ และสามารถระบุได้ว่า มีโอกาสใดบ้างที่สามารถใช้เพื่อเพิ่มยอดขายได้ ยกตัวอย่างเช่น บริดจสโตนสามารถมองเห็นได้อย่างง่ายดายว่า สินค้าประเภทไหนบ้างที่ขายดีในแต่ละภูมิภาค และใช้ข้อมูลนั้นไปปรับยุทธศาสตร์การขายและการตลาด นอกจากนี้ บริดจสโตนยังสามารถคาดการณ์ความต้องการของลูกค้าได้มากขึ้น และมั่นใจได้ว่าสามารถผลิตสินค้าที่ตรงกับความต้องการของลูกค้า\r\n\r\n&nbsp;\r\n\r\nบริดจสโตนยังคงร่วมมือกับทาง G-Able และมีส่วนร่วมในชุมชนผู้ใช้ Tableau เพื่อสร้างเสริมต่อยอดประโยชน์ที่ได้รับด้วยแนวปฏิบัติที่เป็นเลิศของอุตสาหกรรม เพราะบริษัทต้องการเสริมความแข็งแกร่งในความชำนาญการด้านข้อมูล และช่วยให้ผู้ใช้งานธุรกิจสามารถหาข้อมูลได้ด้วยตนเอง และเข้าใจข้อมูลของตนเองได้ง่ายขึ้น\r\n<h6>- คุณสิงหเดช ชำนาญนัก ผู้จัดการแผนก IT บริษัทบริดจสโตนเซลส์ (ประเทศไทย) กล่าว</h6>\r\n",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        },
        {
          "domain": "portfolio_category",
          "slug": "service",
          "title": "Service"
        }
      ]
    },
    {
      "title": "สำนักบริหารการศึกษา (สบศ) ของ Kasetsart University เลือกใช้ Registration System on AWS",
      "description": "\r\n<h2><span style=\"color: #000000;\"><b>สำนักบริหารการศึกษา ของ </b><b>Kasetsart University</b></span></h2>\r\nสำนักบริหารการศึกษาเป็นสำนักที่รวบรวมหลายฝ่ายไว้เพื่อวางแผนพัฒนาการบริหารและพัฒนางานวิชาการ ของมหาวิทยาลัย โดยมีพันธกิจ คือ\r\n<ul>\r\n \t<li>ประสานงานและบริหารจัดการด้านวิชาการและการจัดการเรียนการสอนชองมหาวิทยาลัย</li>\r\n \t<li>แสวงหา รับสมัครและคัดเลือกบุคคลที่มีศักยภาพเข้าศึกษาต่อในมหาวิทยาลัย</li>\r\n \t<li>บริการนิสิต อาจารย์ บุคลากรและหน่วยงานในการจัดการเรียนการสอนด้วยเทคโนโลยีที่ทันสมัย</li>\r\n \t<li>เป็นแหล่งสารสนเทศด้านวิชาการและข้อมูลทางการศึกษา</li>\r\n \t<li>ประสานความร่วมมือ และสร้างเครือข่ายด้านการบริการให้กับหน่วยงานภายในและภายนอกมหาวิทยาลัย ในระดับชาติและนานาชาติ</li>\r\n</ul>\r\n\r\n<h2><b>Why Cloud Why AWS</b></h2>\r\nระบบการลงทะเบียน (KU-ISEA) คือระบบที่ทางทางสำนักบริหารการศึกษาได้ดำเนินการปรับปรุง ซึ่งเป็นระบบที่ต้องการความยืดหยุ่นในการดำเนินการ และยังตอบสนองความต้องการของมหาวิทยาลัยเกษตรศาสตร์ รวมถึงรองรับการใช้งานที่คล่องตัวให้กับนิสิต\r\n\r\nดังนั้นการเลือกระบบดังกล่าวให้อยู่ในรูปแบบระบบ Cloud services จะช่วยในเรื่องของการจัดการระบบเพื่อรองรับการทำงานจากทั้งส่วนกลางและวิทยาเขตอื่นได้ อีกทั้งยังควบคุมต้นทุนได้ง่าย พร้อมปรับเปลี่ยนการตั้งค่าการใช้งานได้รวดเร็ว รวมถึงหากจำเป็นที่จะต้องต่อยอด ก็มีความพร้อม โดยสามารถที่จะมีระบบนิเวศขึ้นมาเพื่อที่จะรองรับการพัฒนาได้อย่างต่อเนื่องและรวดเร็วยิ่งขึ้นด้วย\r\n<h2><b>Why G-Able</b></h2>\r\nจีเอเบิล มีความชำนาญและมีประสบการณ์ในการจัดทำระบบที่เกี่ยวข้องกับทางด้านไอทีไม่ว่าจะเป็น Infrastructure และ Software Development มามากกว่า 20 ปี ซึ่งสามารถให้บริการวิเคราะห์ ออกแบบ และแนะนำการบริหารจัดการการลงทะเบียนให้ได้อย่างมีประสิทธิภาพ\r\n\r\nซึ่งปัจจุบันทาง จีเอเบิล ได้ช่วยในการปรับปรุงระบบให้รองรับเรื่องการเลือกรูปแบบการลงทะเบียน, ชำระเงินออนไลน์, การพิจารณาการลงทะเบียนจากทางอาจารย์ เป็นต้น\r\n\r\nรวมถึงยังได้วางแผนเพื่อพัฒนาต่อยอดระบบให้รองรับ Pattern การคิดคำนวณเงินและหน่วยกิต การลงทะเบียนข้ามวิทยาเขต เป็นต้น",
      "category": [
        {
          "domain": "portfolio_category",
          "slug": "industries",
          "title": "Industries"
        },
        {
          "domain": "portfolio_category",
          "slug": "service",
          "title": "Service"
        }
      ]
    }
  ]
}
